{
  "version": "2.0",
  "service": "<p>Amazon Managed Service for Prometheus is a serverless, Prometheus-compatible monitoring service for container metrics that makes it easier to securely monitor container environments at scale. With Amazon Managed Service for Prometheus, you can use the same open-source Prometheus data model and query language that you use today to monitor the performance of your containerized workloads, and also enjoy improved scalability, availability, and security without having to manage the underlying infrastructure.</p> <p>For more information about Amazon Managed Service for Prometheus, see the <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/what-is-Amazon-Managed-Service-Prometheus.html\">Amazon Managed Service for Prometheus</a> User Guide.</p> <p>Amazon Managed Service for Prometheus includes two APIs.</p> <ul> <li> <p>Use the Amazon Web Services API described in this guide to manage Amazon Managed Service for Prometheus resources, such as workspaces, rule groups, and alert managers.</p> </li> <li> <p>Use the <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/AMP-APIReference.html#AMP-APIReference-Prometheus-Compatible-Apis\">Prometheus-compatible API</a> to work within your Prometheus workspace.</p> </li> </ul>",
  "operations": {
    "CreateAlertManagerDefinition": "<p>The <code>CreateAlertManagerDefinition</code> operation creates the alert manager definition in a workspace. If a workspace already has an alert manager definition, don't use this operation to update it. Instead, use <code>PutAlertManagerDefinition</code>.</p>",
    "CreateAnomalyDetector": "<p>Creates an anomaly detector within a workspace using the Random Cut Forest algorithm for time-series analysis. The anomaly detector analyzes Amazon Managed Service for Prometheus metrics to identify unusual patterns and behaviors.</p>",
    "CreateLoggingConfiguration": "<p>The <code>CreateLoggingConfiguration</code> operation creates rules and alerting logging configuration for the workspace. Use this operation to set the CloudWatch log group to which the logs will be published to.</p> <note> <p>These logging configurations are only for rules and alerting logs.</p> </note>",
    "CreateQueryLoggingConfiguration": "<p>Creates a query logging configuration for the specified workspace. This operation enables logging of queries that exceed the specified QSP threshold.</p>",
    "CreateRuleGroupsNamespace": "<p>The <code>CreateRuleGroupsNamespace</code> operation creates a rule groups namespace within a workspace. A rule groups namespace is associated with exactly one rules file. A workspace can have multiple rule groups namespaces.</p> <important> <p>The combined length of a rule group namespace and a rule group name cannot exceed 721 UTF-8 bytes.</p> </important> <p>Use this operation only to create new rule groups namespaces. To update an existing rule groups namespace, use <code>PutRuleGroupsNamespace</code>.</p>",
    "CreateScraper": "<p>The <code>CreateScraper</code> operation creates a scraper to collect metrics. A scraper pulls metrics from Prometheus-compatible sources and sends them to your Amazon Managed Service for Prometheus workspace. You can configure scrapers to collect metrics from Amazon EKS clusters, Amazon MSK clusters, or from VPC-based sources that support DNS-based service discovery. Scrapers are flexible, and can be configured to control what metrics are collected, the frequency of collection, what transformations are applied to the metrics, and more.</p> <p>An IAM role will be created for you that Amazon Managed Service for Prometheus uses to access the metrics in your source. You must configure this role with a policy that allows it to scrape metrics from your source. For Amazon EKS sources, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/AMP-collector-how-to.html#AMP-collector-eks-setup\">Configuring your Amazon EKS cluster</a> in the <i>Amazon Managed Service for Prometheus User Guide</i>.</p> <p>The <code>scrapeConfiguration</code> parameter contains the base-64 encoded YAML configuration for the scraper.</p> <p>When creating a scraper, the service creates a <code>Network Interface</code> in each <b>Availability Zone</b> that are passed into <code>CreateScraper</code> through subnets. These network interfaces are used to connect to your source within the VPC for scraping metrics.</p> <note> <p>For more information about collectors, including what metrics are collected, and how to configure the scraper, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/AMP-collector-how-to.html\">Using an Amazon Web Services managed collector</a> in the <i>Amazon Managed Service for Prometheus User Guide</i>.</p> </note>",
    "CreateWorkspace": "<p>Creates a Prometheus workspace. A workspace is a logical space dedicated to the storage and querying of Prometheus metrics. You can have one or more workspaces in each Region in your account.</p>",
    "DeleteAlertManagerDefinition": "<p>Deletes the alert manager definition from a workspace.</p>",
    "DeleteAnomalyDetector": "<p>Removes an anomaly detector from a workspace. This operation is idempotent.</p>",
    "DeleteLoggingConfiguration": "<p>Deletes the rules and alerting logging configuration for a workspace.</p> <note> <p>These logging configurations are only for rules and alerting logs.</p> </note>",
    "DeleteQueryLoggingConfiguration": "<p>Deletes the query logging configuration for the specified workspace.</p>",
    "DeleteResourcePolicy": "<p>Deletes the resource-based policy attached to an Amazon Managed Service for Prometheus workspace.</p>",
    "DeleteRuleGroupsNamespace": "<p>Deletes one rule groups namespace and its associated rule groups definition.</p>",
    "DeleteScraper": "<p>The <code>DeleteScraper</code> operation deletes one scraper, and stops any metrics collection that the scraper performs.</p>",
    "DeleteScraperLoggingConfiguration": "<p>Deletes the logging configuration for a Amazon Managed Service for Prometheus scraper.</p>",
    "DeleteWorkspace": "<p>Deletes an existing workspace. </p> <note> <p>When you delete a workspace, the data that has been ingested into it is not immediately deleted. It will be permanently deleted within one month.</p> </note>",
    "DescribeAlertManagerDefinition": "<p>Retrieves the full information about the alert manager definition for a workspace.</p>",
    "DescribeAnomalyDetector": "<p>Retrieves detailed information about a specific anomaly detector, including its status and configuration.</p>",
    "DescribeLoggingConfiguration": "<p>Returns complete information about the current rules and alerting logging configuration of the workspace.</p> <note> <p>These logging configurations are only for rules and alerting logs.</p> </note>",
    "DescribeQueryLoggingConfiguration": "<p>Retrieves the details of the query logging configuration for the specified workspace.</p>",
    "DescribeResourcePolicy": "<p>Returns information about the resource-based policy attached to an Amazon Managed Service for Prometheus workspace.</p>",
    "DescribeRuleGroupsNamespace": "<p>Returns complete information about one rule groups namespace. To retrieve a list of rule groups namespaces, use <code>ListRuleGroupsNamespaces</code>.</p>",
    "DescribeScraper": "<p>The <code>DescribeScraper</code> operation displays information about an existing scraper.</p>",
    "DescribeScraperLoggingConfiguration": "<p>Describes the logging configuration for a Amazon Managed Service for Prometheus scraper.</p>",
    "DescribeWorkspace": "<p>Returns information about an existing workspace. </p>",
    "DescribeWorkspaceConfiguration": "<p>Use this operation to return information about the configuration of a workspace. The configuration details returned include workspace configuration status, label set limits, and retention period.</p>",
    "GetDefaultScraperConfiguration": "<p>The <code>GetDefaultScraperConfiguration</code> operation returns the default scraper configuration used when Amazon EKS creates a scraper for you.</p>",
    "ListAnomalyDetectors": "<p>Returns a paginated list of anomaly detectors for a workspace with optional filtering by alias.</p>",
    "ListRuleGroupsNamespaces": "<p>Returns a list of rule groups namespaces in a workspace.</p>",
    "ListScrapers": "<p>The <code>ListScrapers</code> operation lists all of the scrapers in your account. This includes scrapers being created or deleted. You can optionally filter the returned list.</p>",
    "ListTagsForResource": "<p>The <code>ListTagsForResource</code> operation returns the tags that are associated with an Amazon Managed Service for Prometheus resource. Currently, the only resources that can be tagged are scrapers, workspaces, and rule groups namespaces. </p>",
    "ListWorkspaces": "<p>Lists all of the Amazon Managed Service for Prometheus workspaces in your account. This includes workspaces being created or deleted. </p>",
    "PutAlertManagerDefinition": "<p>Updates an existing alert manager definition in a workspace. If the workspace does not already have an alert manager definition, don't use this operation to create it. Instead, use <code>CreateAlertManagerDefinition</code>.</p>",
    "PutAnomalyDetector": "<p>When you call <code>PutAnomalyDetector</code>, the operation creates a new anomaly detector if one doesn't exist, or updates an existing one. Each call to this operation triggers a complete retraining of the detector, which includes querying the minimum required samples and backfilling the detector with historical data. This process occurs regardless of whether you're making a minor change like updating the evaluation interval or making more substantial modifications. The operation serves as the single method for creating, updating, and retraining anomaly detectors.</p>",
    "PutResourcePolicy": "<p>Creates or updates a resource-based policy for an Amazon Managed Service for Prometheus workspace. Use resource-based policies to grant permissions to other AWS accounts or services to access your workspace.</p> <p>Only Prometheus-compatible APIs can be used for workspace sharing. You can add non-Prometheus-compatible APIs to the policy, but they will be ignored. For more information, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/AMP-APIReference-Prometheus-Compatible-Apis.html\">Prometheus-compatible APIs</a> in the <i>Amazon Managed Service for Prometheus User Guide</i>.</p> <p>If your workspace uses customer-managed KMS keys for encryption, you must grant the principals in your resource-based policy access to those KMS keys. You can do this by creating KMS grants. For more information, see <a href=\"https://docs.aws.amazon.com/kms/latest/APIReference/API_CreateGrant.html\">CreateGrant</a> in the <i>AWS Key Management Service API Reference</i> and <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/encryption-at-rest-Amazon-Service-Prometheus.html\">Encryption at rest</a> in the <i>Amazon Managed Service for Prometheus User Guide</i>.</p> <p>For more information about working with IAM, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/security_iam_service-with-iam.html\">Using Amazon Managed Service for Prometheus with IAM</a> in the <i>Amazon Managed Service for Prometheus User Guide</i>.</p>",
    "PutRuleGroupsNamespace": "<p>Updates an existing rule groups namespace within a workspace. A rule groups namespace is associated with exactly one rules file. A workspace can have multiple rule groups namespaces.</p> <important> <p>The combined length of a rule group namespace and a rule group name cannot exceed 721 UTF-8 bytes.</p> </important> <p>Use this operation only to update existing rule groups namespaces. To create a new rule groups namespace, use <code>CreateRuleGroupsNamespace</code>.</p> <p>You can't use this operation to add tags to an existing rule groups namespace. Instead, use <code>TagResource</code>.</p>",
    "TagResource": "<p>The <code>TagResource</code> operation associates tags with an Amazon Managed Service for Prometheus resource. The only resources that can be tagged are rule groups namespaces, scrapers, and workspaces.</p> <p>If you specify a new tag key for the resource, this tag is appended to the list of tags associated with the resource. If you specify a tag key that is already associated with the resource, the new tag value that you specify replaces the previous value for that tag. To remove a tag, use <code>UntagResource</code>.</p>",
    "UntagResource": "<p>Removes the specified tags from an Amazon Managed Service for Prometheus resource. The only resources that can be tagged are rule groups namespaces, scrapers, and workspaces. </p>",
    "UpdateLoggingConfiguration": "<p>Updates the log group ARN or the workspace ID of the current rules and alerting logging configuration.</p> <note> <p>These logging configurations are only for rules and alerting logs.</p> </note>",
    "UpdateQueryLoggingConfiguration": "<p>Updates the query logging configuration for the specified workspace.</p>",
    "UpdateScraper": "<p>Updates an existing scraper.</p> <p>You can't use this function to update the source from which the scraper is collecting metrics. To change the source, delete the scraper and create a new one.</p>",
    "UpdateScraperLoggingConfiguration": "<p>Updates the logging configuration for a Amazon Managed Service for Prometheus scraper.</p>",
    "UpdateWorkspaceAlias": "<p>Updates the alias of an existing workspace. </p>",
    "UpdateWorkspaceConfiguration": "<p>Use this operation to create or update the label sets, label set limits, and retention period of a workspace.</p> <p>You must specify at least one of <code>limitsPerLabelSet</code> or <code>retentionPeriodInDays</code> for the request to be valid.</p>"
  },
  "shapes": {
    "AccessDeniedException": {
      "base": "<p>You do not have sufficient access to perform this action.</p>",
      "refs": {}
    },
    "AlertManagerDefinitionData": {
      "base": "<p>The base-64 encoded blob that is alert manager definition.</p> <p>For details about the alert manager definition, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/APIReference/yaml-AlertManagerDefinitionData.html\">AlertManagedDefinitionData</a>.</p>",
      "refs": {
        "AlertManagerDefinitionDescription$data": "<p>The actual alert manager definition.</p> <p>For details about the alert manager definition, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/APIReference/yaml-AlertManagerDefinitionData.html\">AlertManagedDefinitionData</a>.</p>",
        "CreateAlertManagerDefinitionRequest$data": "<p>The alert manager definition to add. A base64-encoded version of the YAML alert manager definition file.</p> <p>For details about the alert manager definition, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/APIReference/yaml-AlertManagerDefinitionData.html\">AlertManagedDefinitionData</a>.</p>",
        "PutAlertManagerDefinitionRequest$data": "<p>The alert manager definition to use. A base64-encoded version of the YAML alert manager definition file.</p> <p>For details about the alert manager definition, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/APIReference/yaml-AlertManagerDefinitionData.html\">AlertManagedDefinitionData</a>.</p>"
      }
    },
    "AlertManagerDefinitionDescription": {
      "base": "<p>The details of an alert manager definition. It is the configuration for the alert manager, including information about receivers for routing alerts.</p>",
      "refs": {
        "DescribeAlertManagerDefinitionResponse$alertManagerDefinition": "<p>The alert manager definition.</p>"
      }
    },
    "AlertManagerDefinitionStatus": {
      "base": "<p>The status of the alert manager. </p>",
      "refs": {
        "AlertManagerDefinitionDescription$status": "<p>A structure that displays the current status of the alert manager definition..</p>",
        "CreateAlertManagerDefinitionResponse$status": "<p>A structure that displays the current status of the alert manager definition.</p>",
        "PutAlertManagerDefinitionResponse$status": "<p>A structure that returns the current status of the alert manager definition.</p>"
      }
    },
    "AlertManagerDefinitionStatusCode": {
      "base": "<p>State of an <code>AlertManagerDefinition</code>.</p>",
      "refs": {
        "AlertManagerDefinitionStatus$statusCode": "<p>The current status of the alert manager. </p>"
      }
    },
    "AmpConfiguration": {
      "base": "<p>The <code>AmpConfiguration</code> structure defines the Amazon Managed Service for Prometheus instance a scraper should send metrics to.</p>",
      "refs": {
        "Destination$ampConfiguration": "<p>The Amazon Managed Service for Prometheus workspace to send metrics to.</p>"
      }
    },
    "AnomalyDetectorAlias": {
      "base": null,
      "refs": {
        "AnomalyDetectorDescription$alias": "<p>The user-friendly name of the anomaly detector.</p>",
        "AnomalyDetectorSummary$alias": "<p>The user-friendly name of the anomaly detector.</p>",
        "CreateAnomalyDetectorRequest$alias": "<p>A user-friendly name for the anomaly detector.</p>",
        "ListAnomalyDetectorsRequest$alias": "<p>Filters the results to anomaly detectors with the specified alias.</p>"
      }
    },
    "AnomalyDetectorArn": {
      "base": null,
      "refs": {
        "AnomalyDetectorDescription$arn": "<p>The Amazon Resource Name (ARN) of the anomaly detector.</p>",
        "AnomalyDetectorSummary$arn": "<p>The Amazon Resource Name (ARN) of the anomaly detector.</p>",
        "CreateAnomalyDetectorResponse$arn": "<p>The Amazon Resource Name (ARN) of the created anomaly detector.</p>",
        "PutAnomalyDetectorResponse$arn": "<p>The Amazon Resource Name (ARN) of the updated anomaly detector.</p>"
      }
    },
    "AnomalyDetectorConfiguration": {
      "base": "<p>The configuration for the anomaly detection algorithm.</p>",
      "refs": {
        "AnomalyDetectorDescription$configuration": "<p>The algorithm configuration of the anomaly detector.</p>",
        "CreateAnomalyDetectorRequest$configuration": "<p>The algorithm configuration for the anomaly detector.</p>",
        "PutAnomalyDetectorRequest$configuration": "<p>The algorithm configuration for the anomaly detector.</p>"
      }
    },
    "AnomalyDetectorDescription": {
      "base": "<p>Detailed information about an anomaly detector.</p>",
      "refs": {
        "DescribeAnomalyDetectorResponse$anomalyDetector": "<p>The detailed information about the anomaly detector.</p>"
      }
    },
    "AnomalyDetectorEvaluationInterval": {
      "base": null,
      "refs": {
        "AnomalyDetectorDescription$evaluationIntervalInSeconds": "<p>The frequency, in seconds, at which the anomaly detector evaluates metrics.</p>",
        "CreateAnomalyDetectorRequest$evaluationIntervalInSeconds": "<p>The frequency, in seconds, at which the anomaly detector evaluates metrics. The default value is 60 seconds.</p>",
        "PutAnomalyDetectorRequest$evaluationIntervalInSeconds": "<p>The frequency, in seconds, at which the anomaly detector evaluates metrics.</p>"
      }
    },
    "AnomalyDetectorId": {
      "base": null,
      "refs": {
        "AnomalyDetectorDescription$anomalyDetectorId": "<p>The unique identifier of the anomaly detector.</p>",
        "AnomalyDetectorSummary$anomalyDetectorId": "<p>The unique identifier of the anomaly detector.</p>",
        "CreateAnomalyDetectorResponse$anomalyDetectorId": "<p>The unique identifier of the created anomaly detector.</p>",
        "DeleteAnomalyDetectorRequest$anomalyDetectorId": "<p>The identifier of the anomaly detector to delete.</p>",
        "DescribeAnomalyDetectorRequest$anomalyDetectorId": "<p>The identifier of the anomaly detector to describe.</p>",
        "PutAnomalyDetectorRequest$anomalyDetectorId": "<p>The identifier of the anomaly detector to update.</p>",
        "PutAnomalyDetectorResponse$anomalyDetectorId": "<p>The unique identifier of the updated anomaly detector.</p>"
      }
    },
    "AnomalyDetectorMissingDataAction": {
      "base": "<p>Specifies the action to take when data is missing during anomaly detection evaluation.</p>",
      "refs": {
        "AnomalyDetectorDescription$missingDataAction": "<p>The action taken when data is missing during evaluation.</p>",
        "CreateAnomalyDetectorRequest$missingDataAction": "<p>Specifies the action to take when data is missing during evaluation.</p>",
        "PutAnomalyDetectorRequest$missingDataAction": "<p>Specifies the action to take when data is missing during evaluation.</p>"
      }
    },
    "AnomalyDetectorStatus": {
      "base": "<p>The status information of an anomaly detector.</p>",
      "refs": {
        "AnomalyDetectorDescription$status": "<p>The current status of the anomaly detector.</p>",
        "AnomalyDetectorSummary$status": "<p>The current status of the anomaly detector.</p>",
        "CreateAnomalyDetectorResponse$status": "<p>The status information of the created anomaly detector.</p>",
        "PutAnomalyDetectorResponse$status": "<p>The status information of the updated anomaly detector.</p>"
      }
    },
    "AnomalyDetectorStatusCode": {
      "base": null,
      "refs": {
        "AnomalyDetectorStatus$statusCode": "<p>The status code of the anomaly detector.</p>"
      }
    },
    "AnomalyDetectorSummary": {
      "base": "<p>Summary information about an anomaly detector for list operations.</p>",
      "refs": {
        "AnomalyDetectorSummaryList$member": null
      }
    },
    "AnomalyDetectorSummaryList": {
      "base": null,
      "refs": {
        "ListAnomalyDetectorsResponse$anomalyDetectors": "<p>The list of anomaly detectors in the workspace.</p>"
      }
    },
    "Blob": {
      "base": null,
      "refs": {
        "GetDefaultScraperConfigurationResponse$configuration": "<p>The configuration file. Base 64 encoded. For more information, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/AMP-collector-how-to.html#AMP-collector-configuration\">Scraper configuration</a>in the <i>Amazon Managed Service for Prometheus User Guide</i>.</p>",
        "ScrapeConfiguration$configurationBlob": "<p>The base 64 encoded scrape configuration file.</p>"
      }
    },
    "Boolean": {
      "base": null,
      "refs": {
        "AnomalyDetectorMissingDataAction$markAsAnomaly": "<p>Marks missing data points as anomalies.</p>",
        "AnomalyDetectorMissingDataAction$skip": "<p>Skips evaluation when data is missing.</p>"
      }
    },
    "CloudWatchLogDestination": {
      "base": "<p>Configuration details for logging to CloudWatch Logs.</p>",
      "refs": {
        "LoggingDestination$cloudWatchLogs": "<p>Configuration details for logging to CloudWatch Logs.</p>",
        "ScraperLoggingDestination$cloudWatchLogs": "<p>The CloudWatch Logs configuration for the scraper logging destination.</p>"
      }
    },
    "ClusterArn": {
      "base": "<p>The ARN of an EKS cluster.</p>",
      "refs": {
        "EksConfiguration$clusterArn": "<p>ARN of the Amazon EKS cluster.</p>"
      }
    },
    "ComponentConfig": {
      "base": "<p>Configuration settings for a scraper component.</p>",
      "refs": {
        "ScraperComponent$config": "<p>The configuration settings for the scraper component.</p>"
      }
    },
    "ConflictException": {
      "base": "<p>The request would cause an inconsistent state.</p>",
      "refs": {}
    },
    "CreateAlertManagerDefinitionRequest": {
      "base": "<p>Represents the input of a <code>CreateAlertManagerDefinition</code> operation.</p>",
      "refs": {}
    },
    "CreateAlertManagerDefinitionResponse": {
      "base": "<p>Represents the output of a <code>CreateAlertManagerDefinition</code> operation.</p>",
      "refs": {}
    },
    "CreateAnomalyDetectorRequest": {
      "base": null,
      "refs": {}
    },
    "CreateAnomalyDetectorRequestLabelsMap": {
      "base": null,
      "refs": {
        "CreateAnomalyDetectorRequest$labels": "<p>The Amazon Managed Service for Prometheus metric labels to associate with the anomaly detector.</p>"
      }
    },
    "CreateAnomalyDetectorResponse": {
      "base": null,
      "refs": {}
    },
    "CreateLoggingConfigurationRequest": {
      "base": "<p>Represents the input of a <code>CreateLoggingConfiguration</code> operation.</p>",
      "refs": {}
    },
    "CreateLoggingConfigurationResponse": {
      "base": "<p>Represents the output of a <code>CreateLoggingConfiguration</code> operation.</p>",
      "refs": {}
    },
    "CreateQueryLoggingConfigurationRequest": {
      "base": null,
      "refs": {}
    },
    "CreateQueryLoggingConfigurationResponse": {
      "base": null,
      "refs": {}
    },
    "CreateRuleGroupsNamespaceRequest": {
      "base": "<p>Represents the input of a <code>CreateRuleGroupsNamespace</code> operation.</p>",
      "refs": {}
    },
    "CreateRuleGroupsNamespaceResponse": {
      "base": "<p>Represents the output of a <code>CreateRuleGroupsNamespace</code> operation.</p>",
      "refs": {}
    },
    "CreateScraperRequest": {
      "base": "<p>Represents the input of a <code>CreateScraper</code> operation.</p>",
      "refs": {}
    },
    "CreateScraperResponse": {
      "base": "<p>Represents the output of a <code>CreateScraper</code> operation.</p>",
      "refs": {}
    },
    "CreateWorkspaceRequest": {
      "base": "<p>Represents the input of a <code>CreateWorkspace</code> operation.</p>",
      "refs": {}
    },
    "CreateWorkspaceResponse": {
      "base": "<p>Represents the output of a <code>CreateWorkspace</code> operation.</p>",
      "refs": {}
    },
    "DeleteAlertManagerDefinitionRequest": {
      "base": "<p>Represents the input of a <code>DeleteAlertManagerDefinition</code> operation.</p>",
      "refs": {}
    },
    "DeleteAnomalyDetectorRequest": {
      "base": null,
      "refs": {}
    },
    "DeleteLoggingConfigurationRequest": {
      "base": "<p>Represents the input of a <code>DeleteLoggingConfiguration</code> operation.</p>",
      "refs": {}
    },
    "DeleteQueryLoggingConfigurationRequest": {
      "base": null,
      "refs": {}
    },
    "DeleteResourcePolicyRequest": {
      "base": null,
      "refs": {}
    },
    "DeleteRuleGroupsNamespaceRequest": {
      "base": "<p>Represents the input of a <code>DeleteRuleGroupsNamespace</code> operation.</p>",
      "refs": {}
    },
    "DeleteScraperLoggingConfigurationRequest": {
      "base": null,
      "refs": {}
    },
    "DeleteScraperRequest": {
      "base": "<p>Represents the input of a <code>DeleteScraper</code> operation.</p>",
      "refs": {}
    },
    "DeleteScraperResponse": {
      "base": "<p>Represents the output of a <code>DeleteScraper</code> operation.</p>",
      "refs": {}
    },
    "DeleteWorkspaceRequest": {
      "base": "<p>Represents the input of a <code>DeleteWorkspace</code> operation.</p>",
      "refs": {}
    },
    "DescribeAlertManagerDefinitionRequest": {
      "base": "<p>Represents the input of a <code>DescribeAlertManagerDefinition</code> operation.</p>",
      "refs": {}
    },
    "DescribeAlertManagerDefinitionResponse": {
      "base": "<p>Represents the output of a <code>DescribeAlertManagerDefinition</code> operation.</p>",
      "refs": {}
    },
    "DescribeAnomalyDetectorRequest": {
      "base": null,
      "refs": {}
    },
    "DescribeAnomalyDetectorResponse": {
      "base": null,
      "refs": {}
    },
    "DescribeLoggingConfigurationRequest": {
      "base": "<p>Represents the input of a <code>DescribeLoggingConfiguration</code> operation.</p>",
      "refs": {}
    },
    "DescribeLoggingConfigurationResponse": {
      "base": "<p>Represents the output of a <code>DescribeLoggingConfiguration</code> operation.</p>",
      "refs": {}
    },
    "DescribeQueryLoggingConfigurationRequest": {
      "base": null,
      "refs": {}
    },
    "DescribeQueryLoggingConfigurationResponse": {
      "base": null,
      "refs": {}
    },
    "DescribeResourcePolicyRequest": {
      "base": null,
      "refs": {}
    },
    "DescribeResourcePolicyResponse": {
      "base": null,
      "refs": {}
    },
    "DescribeRuleGroupsNamespaceRequest": {
      "base": "<p>Represents the input of a <code>DescribeRuleGroupsNamespace</code> operation.</p>",
      "refs": {}
    },
    "DescribeRuleGroupsNamespaceResponse": {
      "base": "<p>Represents the output of a <code>DescribeRuleGroupsNamespace</code> operation.</p>",
      "refs": {}
    },
    "DescribeScraperLoggingConfigurationRequest": {
      "base": null,
      "refs": {}
    },
    "DescribeScraperLoggingConfigurationResponse": {
      "base": null,
      "refs": {}
    },
    "DescribeScraperRequest": {
      "base": "<p>Represents the input of a <code>DescribeScraper</code> operation.</p>",
      "refs": {}
    },
    "DescribeScraperResponse": {
      "base": "<p>Represents the output of a <code>DescribeScraper</code> operation.</p>",
      "refs": {}
    },
    "DescribeWorkspaceConfigurationRequest": {
      "base": null,
      "refs": {}
    },
    "DescribeWorkspaceConfigurationResponse": {
      "base": null,
      "refs": {}
    },
    "DescribeWorkspaceRequest": {
      "base": "<p>Represents the input of a <code>DescribeWorkspace</code> operation.</p>",
      "refs": {}
    },
    "DescribeWorkspaceResponse": {
      "base": "<p>Represents the output of a <code>DescribeWorkspace</code> operation.</p>",
      "refs": {}
    },
    "Destination": {
      "base": "<p>Where to send the metrics from a scraper.</p>",
      "refs": {
        "CreateScraperRequest$destination": "<p>The Amazon Managed Service for Prometheus workspace to send metrics to.</p>",
        "ScraperDescription$destination": "<p>The Amazon Managed Service for Prometheus workspace the scraper sends metrics to.</p>",
        "ScraperSummary$destination": "<p>The Amazon Managed Service for Prometheus workspace the scraper sends metrics to.</p>",
        "UpdateScraperRequest$destination": "<p>The new Amazon Managed Service for Prometheus workspace to send metrics to.</p>"
      }
    },
    "EksConfiguration": {
      "base": "<p>The <code>EksConfiguration</code> structure describes the connection to the Amazon EKS cluster from which a scraper collects metrics.</p>",
      "refs": {
        "Source$eksConfiguration": "<p>The Amazon EKS cluster from which a scraper collects metrics.</p>"
      }
    },
    "FilterKey": {
      "base": "<p>The name of the key by which to filter.</p>",
      "refs": {
        "ScraperFilters$key": "<p>The name of the key to filter by. Currently supported filter keys are <code>status</code>, <code>sourceArn</code>, <code>destinationArn</code>, and <code>alias</code>.</p>"
      }
    },
    "FilterValue": {
      "base": "<p>The value for a given key by which to filter.</p>",
      "refs": {
        "FilterValues$member": null
      }
    },
    "FilterValues": {
      "base": "<p>A list of scraper filter values.</p>",
      "refs": {
        "ScraperFilters$value": "<p>The values of the given key by which to filter.</p>"
      }
    },
    "GetDefaultScraperConfigurationRequest": {
      "base": "<p>Represents the input of a <code>GetDefaultScraperConfiguration</code> operation.</p>",
      "refs": {}
    },
    "GetDefaultScraperConfigurationResponse": {
      "base": "<p>Represents the output of a <code>GetDefaultScraperConfiguration</code> operation.</p>",
      "refs": {}
    },
    "IamRoleArn": {
      "base": "<p>An ARN identifying an IAM role used by the scraper.</p>",
      "refs": {
        "RoleConfiguration$sourceRoleArn": "<p>The Amazon Resource Name (ARN) of the role used in the source account to enable cross-account scraping. For information about the contents of this policy, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/AMP-collector-how-to.html#cross-account-remote-write\">Cross-account setup</a>.</p>",
        "RoleConfiguration$targetRoleArn": "<p>The Amazon Resource Name (ARN) of the role used in the target account to enable cross-account scraping. For information about the contents of this policy, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/AMP-collector-how-to.html#cross-account-remote-write\">Cross-account setup</a>.</p>",
        "ScraperDescription$roleArn": "<p>The Amazon Resource Name (ARN) of the IAM role that provides permissions for the scraper to discover and collect metrics on your behalf.</p> <p>For example, <code>arn:aws:iam::123456789012:role/service-role/AmazonGrafanaServiceRole-12example</code>.</p>",
        "ScraperSummary$roleArn": "<p>The Amazon Resource Name (ARN) of the IAM role that provides permissions for the scraper to discover and collect metrics on your behalf.</p>"
      }
    },
    "IdempotencyToken": {
      "base": "<p>An identifier used to ensure the idempotency of a write request.</p>",
      "refs": {
        "CreateAlertManagerDefinitionRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "CreateAnomalyDetectorRequest$clientToken": "<p>A unique, case-sensitive identifier that you provide to ensure the idempotency of the request.</p>",
        "CreateLoggingConfigurationRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "CreateQueryLoggingConfigurationRequest$clientToken": "<p>(Optional) A unique, case-sensitive identifier that you can provide to ensure the idempotency of the request.</p>",
        "CreateRuleGroupsNamespaceRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "CreateScraperRequest$clientToken": "<p>(Optional) A unique, case-sensitive identifier that you can provide to ensure the idempotency of the request.</p>",
        "CreateWorkspaceRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "DeleteAlertManagerDefinitionRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "DeleteAnomalyDetectorRequest$clientToken": "<p>A unique, case-sensitive identifier that you provide to ensure the idempotency of the request.</p>",
        "DeleteLoggingConfigurationRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "DeleteQueryLoggingConfigurationRequest$clientToken": "<p>(Optional) A unique, case-sensitive identifier that you can provide to ensure the idempotency of the request.</p>",
        "DeleteResourcePolicyRequest$clientToken": "<p>A unique, case-sensitive identifier that you provide to ensure the request is safe to retry (idempotent).</p>",
        "DeleteRuleGroupsNamespaceRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "DeleteScraperLoggingConfigurationRequest$clientToken": "<p>A unique, case-sensitive identifier that you provide to ensure the request is processed exactly once.</p>",
        "DeleteScraperRequest$clientToken": "<p>(Optional) A unique, case-sensitive identifier that you can provide to ensure the idempotency of the request.</p>",
        "DeleteWorkspaceRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "PutAlertManagerDefinitionRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "PutAnomalyDetectorRequest$clientToken": "<p>A unique, case-sensitive identifier that you provide to ensure the idempotency of the request.</p>",
        "PutResourcePolicyRequest$clientToken": "<p>A unique, case-sensitive identifier that you provide to ensure the request is safe to retry (idempotent).</p>",
        "PutRuleGroupsNamespaceRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "UpdateLoggingConfigurationRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "UpdateQueryLoggingConfigurationRequest$clientToken": "<p>(Optional) A unique, case-sensitive identifier that you can provide to ensure the idempotency of the request.</p>",
        "UpdateScraperRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "UpdateWorkspaceAliasRequest$clientToken": "<p>A unique identifier that you can provide to ensure the idempotency of the request. Case-sensitive.</p>",
        "UpdateWorkspaceConfigurationRequest$clientToken": "<p>You can include a token in your operation to make it an idempotent opeartion. </p>"
      }
    },
    "IgnoreNearExpected": {
      "base": "<p>Configuration for threshold settings that determine when values near expected values should be ignored during anomaly detection.</p>",
      "refs": {
        "RandomCutForestConfiguration$ignoreNearExpectedFromAbove": "<p>Configuration for ignoring values that are near expected values from above during anomaly detection.</p>",
        "RandomCutForestConfiguration$ignoreNearExpectedFromBelow": "<p>Configuration for ignoring values that are near expected values from below during anomaly detection.</p>"
      }
    },
    "IgnoreNearExpectedAmountDouble": {
      "base": null,
      "refs": {
        "IgnoreNearExpected$amount": "<p>The absolute amount by which values can differ from expected values before being considered anomalous.</p>"
      }
    },
    "IgnoreNearExpectedRatioDouble": {
      "base": null,
      "refs": {
        "IgnoreNearExpected$ratio": "<p>The ratio by which values can differ from expected values before being considered anomalous.</p>"
      }
    },
    "Integer": {
      "base": null,
      "refs": {
        "InternalServerException$retryAfterSeconds": "<p>Advice to clients on when the call can be safely retried.</p>",
        "ThrottlingException$retryAfterSeconds": "<p>Advice to clients on when the call can be safely retried.</p>"
      }
    },
    "InternalServerException": {
      "base": "<p>An unexpected error occurred during the processing of the request.</p>",
      "refs": {}
    },
    "KmsKeyArn": {
      "base": "<p>A KMS Key ARN.</p>",
      "refs": {
        "CreateWorkspaceRequest$kmsKeyArn": "<p>(optional) The ARN for a customer managed KMS key to use for encrypting data within your workspace. For more information about using your own key in your workspace, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/encryption-at-rest-Amazon-Service-Prometheus.html\">Encryption at rest</a> in the <i>Amazon Managed Service for Prometheus User Guide</i>.</p>",
        "CreateWorkspaceResponse$kmsKeyArn": "<p>(optional) If the workspace was created with a customer managed KMS key, the ARN for the key used.</p>",
        "WorkspaceDescription$kmsKeyArn": "<p>(optional) If the workspace was created with a customer managed KMS key, the ARN for the key used.</p>",
        "WorkspaceSummary$kmsKeyArn": "<p>(optional) If the workspace was created with a customer managed KMS key, the ARN for the key used.</p>"
      }
    },
    "LabelName": {
      "base": null,
      "refs": {
        "LabelSet$key": null
      }
    },
    "LabelSet": {
      "base": null,
      "refs": {
        "LimitsPerLabelSet$labelSet": "<p>This defines one label set that will have an enforced active time series limit. </p> <p>Label values accept ASCII characters and must contain at least one character that isn't whitespace. ASCII control characters are not accepted. If the label name is metric name label <code>__<i>name</i>__</code>, then the <i>metric</i> part of the name must conform to the following pattern: <code>[a-zA-Z_:][a-zA-Z0-9_:]*</code> </p>"
      }
    },
    "LabelValue": {
      "base": null,
      "refs": {
        "LabelSet$value": null
      }
    },
    "LimitsPerLabelSet": {
      "base": "<p>This structure defines one label set used to enforce active time series limits for the workspace, and defines the limit for that label set.</p> <p>A label set is a unique combination of label-value pairs. Use them to control time series limits and to monitor usage by specific label groups. Example label sets might be <code>team:finance</code> or <code>env:prod</code> </p>",
      "refs": {
        "LimitsPerLabelSetList$member": null
      }
    },
    "LimitsPerLabelSetEntry": {
      "base": "<p>This structure contains the information about the limits that apply to time series that match one label set.</p>",
      "refs": {
        "LimitsPerLabelSet$limits": "<p>This structure contains the information about the limits that apply to time series that match this label set.</p>"
      }
    },
    "LimitsPerLabelSetEntryMaxSeriesLong": {
      "base": null,
      "refs": {
        "LimitsPerLabelSetEntry$maxSeries": "<p>The maximum number of active series that can be ingested that match this label set. </p> <p>Setting this to 0 causes no label set limit to be enforced, but it does cause Amazon Managed Service for Prometheus to vend label set metrics to CloudWatch</p>"
      }
    },
    "LimitsPerLabelSetList": {
      "base": null,
      "refs": {
        "UpdateWorkspaceConfigurationRequest$limitsPerLabelSet": "<p>This is an array of structures, where each structure defines a label set for the workspace, and defines the active time series limit for each of those label sets. Each label name in a label set must be unique.</p>",
        "WorkspaceConfigurationDescription$limitsPerLabelSet": "<p>This is an array of structures, where each structure displays one label sets for the workspace and the limits for that label set.</p>"
      }
    },
    "ListAnomalyDetectorsRequest": {
      "base": null,
      "refs": {}
    },
    "ListAnomalyDetectorsRequestMaxResultsInteger": {
      "base": null,
      "refs": {
        "ListAnomalyDetectorsRequest$maxResults": "<p>The maximum number of results to return in a single call. Valid range is 1 to 1000.</p>"
      }
    },
    "ListAnomalyDetectorsResponse": {
      "base": null,
      "refs": {}
    },
    "ListRuleGroupsNamespacesRequest": {
      "base": "<p>Represents the input of a <code>ListRuleGroupsNamespaces</code> operation.</p>",
      "refs": {}
    },
    "ListRuleGroupsNamespacesRequestMaxResultsInteger": {
      "base": null,
      "refs": {
        "ListRuleGroupsNamespacesRequest$maxResults": "<p>The maximum number of results to return. The default is 100.</p>"
      }
    },
    "ListRuleGroupsNamespacesResponse": {
      "base": "<p>Represents the output of a <code>ListRuleGroupsNamespaces</code> operation.</p>",
      "refs": {}
    },
    "ListScrapersRequest": {
      "base": "<p>Represents the input of a <code>ListScrapers</code> operation.</p>",
      "refs": {}
    },
    "ListScrapersRequestMaxResultsInteger": {
      "base": null,
      "refs": {
        "ListScrapersRequest$maxResults": "<p>Optional) The maximum number of scrapers to return in one <code>ListScrapers</code> operation. The range is 1-1000.</p> <p>If you omit this parameter, the default of 100 is used.</p>"
      }
    },
    "ListScrapersResponse": {
      "base": "<p>Represents the output of a <code>ListScrapers</code> operation.</p>",
      "refs": {}
    },
    "ListTagsForResourceRequest": {
      "base": null,
      "refs": {}
    },
    "ListTagsForResourceResponse": {
      "base": null,
      "refs": {}
    },
    "ListWorkspacesRequest": {
      "base": "<p>Represents the input of a <code>ListWorkspaces</code> operation.</p>",
      "refs": {}
    },
    "ListWorkspacesRequestMaxResultsInteger": {
      "base": null,
      "refs": {
        "ListWorkspacesRequest$maxResults": "<p>The maximum number of workspaces to return per request. The default is 100.</p>"
      }
    },
    "ListWorkspacesResponse": {
      "base": "<p>Represents the output of a <code>ListWorkspaces</code> operation.</p>",
      "refs": {}
    },
    "LogGroupArn": {
      "base": null,
      "refs": {
        "CloudWatchLogDestination$logGroupArn": "<p>The ARN of the CloudWatch log group to which the vended log data will be published. This log group must exist prior to calling this operation.</p>",
        "CreateLoggingConfigurationRequest$logGroupArn": "<p>The ARN of the CloudWatch log group to which the vended log data will be published. This log group must exist prior to calling this operation.</p>",
        "LoggingConfigurationMetadata$logGroupArn": "<p>The ARN of the CloudWatch log group to which the vended log data will be published.</p>",
        "UpdateLoggingConfigurationRequest$logGroupArn": "<p>The ARN of the CloudWatch log group to which the vended log data will be published.</p>"
      }
    },
    "LoggingConfigurationMetadata": {
      "base": "<p>Contains information about the current rules and alerting logging configuration for the workspace.</p> <note> <p>These logging configurations are only for rules and alerting logs.</p> </note>",
      "refs": {
        "DescribeLoggingConfigurationResponse$loggingConfiguration": "<p>A structure that displays the information about the logging configuration.</p>"
      }
    },
    "LoggingConfigurationStatus": {
      "base": "<p>The status of the logging configuration. </p>",
      "refs": {
        "CreateLoggingConfigurationResponse$status": "<p>A structure that displays the current status of the logging configuration.</p>",
        "LoggingConfigurationMetadata$status": "<p>The current status of the logging configuration.</p>",
        "UpdateLoggingConfigurationResponse$status": "<p>A structure that contains the current status of the logging configuration.</p>"
      }
    },
    "LoggingConfigurationStatusCode": {
      "base": "<p>State of a logging configuration.</p>",
      "refs": {
        "LoggingConfigurationStatus$statusCode": "<p>The current status of the current rules and alerting logging configuration.</p> <note> <p>These logging configurations are only for rules and alerting logs.</p> </note>"
      }
    },
    "LoggingDestination": {
      "base": "<p>Defines a destination and its associated filtering criteria for query logging.</p>",
      "refs": {
        "LoggingDestinations$member": null
      }
    },
    "LoggingDestinations": {
      "base": "<p>A list structure that contains a single CloudWatch Logs destination.</p>",
      "refs": {
        "CreateQueryLoggingConfigurationRequest$destinations": "<p>The destinations where query logs will be sent. Only CloudWatch Logs destination is supported. The list must contain exactly one element.</p>",
        "QueryLoggingConfigurationMetadata$destinations": "<p>The configured destinations for the query logging configuration.</p>",
        "UpdateQueryLoggingConfigurationRequest$destinations": "<p>The destinations where query logs will be sent. Only CloudWatch Logs destination is supported. The list must contain exactly one element.</p>"
      }
    },
    "LoggingFilter": {
      "base": "<p>Filtering criteria that determine which queries are logged.</p>",
      "refs": {
        "LoggingDestination$filters": "<p>Filtering criteria that determine which queries are logged.</p>"
      }
    },
    "LoggingFilterQspThresholdLong": {
      "base": null,
      "refs": {
        "LoggingFilter$qspThreshold": "<p>The Query Samples Processed (QSP) threshold above which queries will be logged. Queries processing more samples than this threshold will be captured in logs.</p>"
      }
    },
    "PaginationToken": {
      "base": "<p>A token used to access the next page in a paginated result set.</p>",
      "refs": {
        "ListAnomalyDetectorsRequest$nextToken": "<p>The pagination token to continue retrieving results.</p>",
        "ListAnomalyDetectorsResponse$nextToken": "<p>The pagination token to retrieve the next set of results.</p>",
        "ListRuleGroupsNamespacesRequest$nextToken": "<p>The token for the next set of items to return. You receive this token from a previous call, and use it to get the next page of results. The other parameters must be the same as the initial call.</p> <p>For example, if your initial request has <code>maxResults</code> of 10, and there are 12 rule groups namespaces to return, then your initial request will return 10 and a <code>nextToken</code>. Using the next token in a subsequent call will return the remaining 2 namespaces.</p>",
        "ListRuleGroupsNamespacesResponse$nextToken": "<p>A token indicating that there are more results to retrieve. You can use this token as part of your next <code>ListRuleGroupsNamespaces</code> request to retrieve those results.</p>",
        "ListScrapersRequest$nextToken": "<p>(Optional) The token for the next set of items to return. (You received this token from a previous call.)</p>",
        "ListScrapersResponse$nextToken": "<p>A token indicating that there are more results to retrieve. You can use this token as part of your next <code>ListScrapers</code> operation to retrieve those results.</p>",
        "ListWorkspacesRequest$nextToken": "<p>The token for the next set of items to return. You receive this token from a previous call, and use it to get the next page of results. The other parameters must be the same as the initial call.</p> <p>For example, if your initial request has <code>maxResults</code> of 10, and there are 12 workspaces to return, then your initial request will return 10 and a <code>nextToken</code>. Using the next token in a subsequent call will return the remaining 2 workspaces.</p>",
        "ListWorkspacesResponse$nextToken": "<p>A token indicating that there are more results to retrieve. You can use this token as part of your next <code>ListWorkspaces</code> request to retrieve those results.</p>"
      }
    },
    "PrometheusMetricLabelKey": {
      "base": null,
      "refs": {
        "CreateAnomalyDetectorRequestLabelsMap$key": null,
        "PrometheusMetricLabelMap$key": null
      }
    },
    "PrometheusMetricLabelMap": {
      "base": null,
      "refs": {
        "AnomalyDetectorDescription$labels": "<p>The Amazon Managed Service for Prometheus metric labels associated with the anomaly detector.</p>",
        "PutAnomalyDetectorRequest$labels": "<p>The Amazon Managed Service for Prometheus metric labels to associate with the anomaly detector.</p>"
      }
    },
    "PrometheusMetricLabelValue": {
      "base": null,
      "refs": {
        "CreateAnomalyDetectorRequestLabelsMap$value": null,
        "PrometheusMetricLabelMap$value": null
      }
    },
    "PutAlertManagerDefinitionRequest": {
      "base": "<p>Represents the input of a <code>PutAlertManagerDefinition</code> operation.</p>",
      "refs": {}
    },
    "PutAlertManagerDefinitionResponse": {
      "base": "<p>Represents the output of a <code>PutAlertManagerDefinition</code> operation.</p>",
      "refs": {}
    },
    "PutAnomalyDetectorRequest": {
      "base": null,
      "refs": {}
    },
    "PutAnomalyDetectorResponse": {
      "base": null,
      "refs": {}
    },
    "PutResourcePolicyRequest": {
      "base": null,
      "refs": {}
    },
    "PutResourcePolicyResponse": {
      "base": null,
      "refs": {}
    },
    "PutRuleGroupsNamespaceRequest": {
      "base": "<p>Represents the input of a <code>PutRuleGroupsNamespace</code> operation.</p>",
      "refs": {}
    },
    "PutRuleGroupsNamespaceResponse": {
      "base": "<p>Represents the output of a <code>PutRuleGroupsNamespace</code> operation.</p>",
      "refs": {}
    },
    "QueryLoggingConfigurationMetadata": {
      "base": "<p>The metadata for a query logging configuration.</p>",
      "refs": {
        "DescribeQueryLoggingConfigurationResponse$queryLoggingConfiguration": "<p>The detailed information about the query logging configuration for the specified workspace.</p>"
      }
    },
    "QueryLoggingConfigurationStatus": {
      "base": "<p>The status information for a query logging configuration.</p>",
      "refs": {
        "CreateQueryLoggingConfigurationResponse$status": "<p>The current status of the query logging configuration.</p>",
        "QueryLoggingConfigurationMetadata$status": "<p>The current status of the query logging configuration.</p>",
        "UpdateQueryLoggingConfigurationResponse$status": "<p>The current status of the query logging configuration.</p>"
      }
    },
    "QueryLoggingConfigurationStatusCode": {
      "base": null,
      "refs": {
        "QueryLoggingConfigurationStatus$statusCode": "<p>The current status of the query logging configuration.</p>"
      }
    },
    "RandomCutForestConfiguration": {
      "base": "<p>Configuration for the Random Cut Forest algorithm used for anomaly detection in time-series data.</p>",
      "refs": {
        "AnomalyDetectorConfiguration$randomCutForest": "<p>The Random Cut Forest algorithm configuration for anomaly detection.</p>"
      }
    },
    "RandomCutForestConfigurationSampleSizeInteger": {
      "base": null,
      "refs": {
        "RandomCutForestConfiguration$sampleSize": "<p>The number of data points sampled from the input stream for the Random Cut Forest algorithm. The default number is 256 consecutive data points.</p>"
      }
    },
    "RandomCutForestConfigurationShingleSizeInteger": {
      "base": null,
      "refs": {
        "RandomCutForestConfiguration$shingleSize": "<p>The number of consecutive data points used to create a shingle for the Random Cut Forest algorithm. The default number is 8 consecutive data points.</p>"
      }
    },
    "RandomCutForestQuery": {
      "base": null,
      "refs": {
        "RandomCutForestConfiguration$query": "<p>The Prometheus query used to retrieve the time-series data for anomaly detection.</p> <important> <p>Random Cut Forest queries must be wrapped by a supported PromQL aggregation operator. For more information, see <a href=\"https://prometheus.io/docs/prometheus/latest/querying/operators/#aggregation-operators\">Aggregation operators</a> on the <i>Prometheus docs</i> website.</p> <p> <b>Supported PromQL aggregation operators</b>: <code>avg</code>, <code>count</code>, <code>group</code>, <code>max</code>, <code>min</code>, <code>quantile</code>, <code>stddev</code>, <code>stdvar</code>, and <code>sum</code>.</p> </important>"
      }
    },
    "ResourceNotFoundException": {
      "base": "<p>The request references a resources that doesn't exist.</p>",
      "refs": {}
    },
    "RoleConfiguration": {
      "base": "<p>Use this structure to enable cross-account access, so that you can use a target account to access Prometheus metrics from source accounts.</p>",
      "refs": {
        "CreateScraperRequest$roleConfiguration": "<p>Use this structure to enable cross-account access, so that you can use a target account to access Prometheus metrics from source accounts.</p>",
        "ScraperDescription$roleConfiguration": "<p>This structure displays information about the IAM roles used for cross-account scraping configuration.</p>",
        "ScraperSummary$roleConfiguration": "<p>This structure displays information about the IAM roles used for cross-account scraping configuration.</p>",
        "UpdateScraperRequest$roleConfiguration": "<p>Use this structure to enable cross-account access, so that you can use a target account to access Prometheus metrics from source accounts.</p>"
      }
    },
    "RuleGroupsNamespaceArn": {
      "base": "<p>An ARN identifying a rule groups namespace.</p>",
      "refs": {
        "CreateRuleGroupsNamespaceResponse$arn": "<p>The Amazon Resource Name (ARN) of the new rule groups namespace.</p>",
        "PutRuleGroupsNamespaceResponse$arn": "<p>The ARN of the rule groups namespace.</p>",
        "RuleGroupsNamespaceDescription$arn": "<p>The ARN of the rule groups namespace. For example, <code>arn:aws:aps:&lt;region&gt;:123456789012:rulegroupsnamespace/ws-example1-1234-abcd-5678-ef90abcd1234/rulesfile1</code>.</p>",
        "RuleGroupsNamespaceSummary$arn": "<p>The ARN of the rule groups namespace.</p>"
      }
    },
    "RuleGroupsNamespaceData": {
      "base": "<p>The rule groups namespace data.</p>",
      "refs": {
        "CreateRuleGroupsNamespaceRequest$data": "<p>The rules file to use in the new namespace.</p> <p>Contains the base64-encoded version of the YAML rules file.</p> <p>For details about the rule groups namespace structure, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/APIReference/yaml-RuleGroupsNamespaceData.html\">RuleGroupsNamespaceData</a>.</p>",
        "PutRuleGroupsNamespaceRequest$data": "<p>The new rules file to use in the namespace. A base64-encoded version of the YAML rule groups file.</p> <p>For details about the rule groups namespace structure, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/APIReference/yaml-RuleGroupsNamespaceData.html\">RuleGroupsNamespaceData</a>.</p>",
        "RuleGroupsNamespaceDescription$data": "<p>The rule groups file used in the namespace.</p> <p>For details about the rule groups namespace structure, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/APIReference/yaml-RuleGroupsNamespaceData.html\">RuleGroupsNamespaceData</a>.</p>"
      }
    },
    "RuleGroupsNamespaceDescription": {
      "base": "<p>The details about one rule groups namespace. </p>",
      "refs": {
        "DescribeRuleGroupsNamespaceResponse$ruleGroupsNamespace": "<p>The information about the rule groups namespace.</p>"
      }
    },
    "RuleGroupsNamespaceName": {
      "base": "<p>The name of the namespace that the rule group belong to.</p>",
      "refs": {
        "CreateRuleGroupsNamespaceRequest$name": "<p>The name for the new rule groups namespace.</p>",
        "CreateRuleGroupsNamespaceResponse$name": "<p>The name of the new rule groups namespace.</p>",
        "DeleteRuleGroupsNamespaceRequest$name": "<p>The name of the rule groups namespace to delete.</p>",
        "DescribeRuleGroupsNamespaceRequest$name": "<p>The name of the rule groups namespace that you want information for.</p>",
        "ListRuleGroupsNamespacesRequest$name": "<p>Use this parameter to filter the rule groups namespaces that are returned. Only the namespaces with names that begin with the value that you specify are returned.</p>",
        "PutRuleGroupsNamespaceRequest$name": "<p>The name of the rule groups namespace that you are updating.</p>",
        "PutRuleGroupsNamespaceResponse$name": "<p>The name of the rule groups namespace that was updated.</p>",
        "RuleGroupsNamespaceDescription$name": "<p>The name of the rule groups namespace.</p>",
        "RuleGroupsNamespaceSummary$name": "<p>The name of the rule groups namespace.</p>"
      }
    },
    "RuleGroupsNamespaceStatus": {
      "base": "<p>The status information about a rule groups namespace. </p>",
      "refs": {
        "CreateRuleGroupsNamespaceResponse$status": "<p>A structure that returns the current status of the rule groups namespace.</p>",
        "PutRuleGroupsNamespaceResponse$status": "<p>A structure that includes the current status of the rule groups namespace.</p>",
        "RuleGroupsNamespaceDescription$status": "<p>The current status of the rule groups namespace.</p>",
        "RuleGroupsNamespaceSummary$status": "<p>A structure that displays the current status of the rule groups namespace.</p>"
      }
    },
    "RuleGroupsNamespaceStatusCode": {
      "base": "<p>State of a namespace.</p>",
      "refs": {
        "RuleGroupsNamespaceStatus$statusCode": "<p>The current status of the namespace.</p>"
      }
    },
    "RuleGroupsNamespaceSummary": {
      "base": "<p>The high-level information about a rule groups namespace. To retrieve more information, use <code>DescribeRuleGroupsNamespace</code>.</p>",
      "refs": {
        "RuleGroupsNamespaceSummaryList$member": null
      }
    },
    "RuleGroupsNamespaceSummaryList": {
      "base": "<p>A list of rule groups namespace summary.</p>",
      "refs": {
        "ListRuleGroupsNamespacesResponse$ruleGroupsNamespaces": "<p>The returned list of rule groups namespaces.</p>"
      }
    },
    "ScrapeConfiguration": {
      "base": "<p>A scrape configuration for a scraper, base 64 encoded. For more information, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/AMP-collector-how-to.html#AMP-collector-configuration\">Scraper configuration</a> in the <i>Amazon Managed Service for Prometheus User Guide</i>.</p>",
      "refs": {
        "CreateScraperRequest$scrapeConfiguration": "<p>The configuration file to use in the new scraper. For more information, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/AMP-collector-how-to.html#AMP-collector-configuration\">Scraper configuration</a> in the <i>Amazon Managed Service for Prometheus User Guide</i>.</p>",
        "ScraperDescription$scrapeConfiguration": "<p>The configuration in use by the scraper.</p>",
        "UpdateScraperRequest$scrapeConfiguration": "<p>Contains the base-64 encoded YAML configuration for the scraper.</p> <note> <p>For more information about configuring a scraper, see <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/AMP-collector-how-to.html\">Using an Amazon Web Services managed collector</a> in the <i>Amazon Managed Service for Prometheus User Guide</i>.</p> </note>"
      }
    },
    "ScraperAlias": {
      "base": "<p>An optional user-assigned scraper alias.</p>",
      "refs": {
        "CreateScraperRequest$alias": "<p>(optional) An alias to associate with the scraper. This is for your use, and does not need to be unique.</p>",
        "ScraperDescription$alias": "<p>(Optional) A name associated with the scraper.</p>",
        "ScraperSummary$alias": "<p>(Optional) A name associated with the scraper.</p>",
        "UpdateScraperRequest$alias": "<p>The new alias of the scraper.</p>"
      }
    },
    "ScraperArn": {
      "base": "<p>An ARN identifying a scrape configuration.</p>",
      "refs": {
        "CreateScraperResponse$arn": "<p>The Amazon Resource Name (ARN) of the new scraper.</p>",
        "ScraperDescription$arn": "<p>The Amazon Resource Name (ARN) of the scraper. For example, <code>arn:aws:aps:&lt;region&gt;:123456798012:scraper/s-example1-1234-abcd-5678-ef9012abcd34</code>.</p>",
        "ScraperSummary$arn": "<p>The Amazon Resource Name (ARN) of the scraper.</p>",
        "UpdateScraperResponse$arn": "<p>The Amazon Resource Name (ARN) of the updated scraper.</p>"
      }
    },
    "ScraperComponent": {
      "base": "<p>A component of a Amazon Managed Service for Prometheus scraper that can be configured for logging.</p>",
      "refs": {
        "ScraperComponents$member": null
      }
    },
    "ScraperComponentType": {
      "base": null,
      "refs": {
        "ScraperComponent$type": "<p>The type of the scraper component.</p>"
      }
    },
    "ScraperComponents": {
      "base": null,
      "refs": {
        "DescribeScraperLoggingConfigurationResponse$scraperComponents": "<p>The list of scraper components configured for logging.</p>",
        "UpdateScraperLoggingConfigurationRequest$scraperComponents": "<p>The list of scraper components to configure for logging.</p>"
      }
    },
    "ScraperDescription": {
      "base": "<p>The <code>ScraperDescription</code> structure contains the full details about one scraper in your account.</p>",
      "refs": {
        "DescribeScraperResponse$scraper": "<p>Contains details about the scraper.</p>"
      }
    },
    "ScraperFilters": {
      "base": "<p>A list of scraper filters.</p>",
      "refs": {
        "ListScrapersRequest$filters": "<p>(Optional) A list of key-value pairs to filter the list of scrapers returned. Keys include <code>status</code>, <code>sourceArn</code>, <code>destinationArn</code>, and <code>alias</code>.</p> <p>Filters on the same key are <code>OR</code>'d together, and filters on different keys are <code>AND</code>'d together. For example, <code>status=ACTIVE&amp;status=CREATING&amp;alias=Test</code>, will return all scrapers that have the alias Test, and are either in status ACTIVE or CREATING.</p> <p>To find all active scrapers that are sending metrics to a specific Amazon Managed Service for Prometheus workspace, you would use the ARN of the workspace in a query:</p> <p> <code>status=ACTIVE&amp;destinationArn=arn:aws:aps:us-east-1:123456789012:workspace/ws-example1-1234-abcd-56ef-123456789012</code> </p> <p>If this is included, it filters the results to only the scrapers that match the filter.</p>"
      }
    },
    "ScraperId": {
      "base": "<p>A scraper ID.</p>",
      "refs": {
        "CreateScraperResponse$scraperId": "<p>The ID of the new scraper.</p>",
        "DeleteScraperLoggingConfigurationRequest$scraperId": "<p>The ID of the scraper whose logging configuration will be deleted.</p>",
        "DeleteScraperRequest$scraperId": "<p>The ID of the scraper to delete.</p>",
        "DeleteScraperResponse$scraperId": "<p>The ID of the scraper to delete.</p>",
        "DescribeScraperLoggingConfigurationRequest$scraperId": "<p>The ID of the scraper whose logging configuration will be described.</p>",
        "DescribeScraperLoggingConfigurationResponse$scraperId": "<p>The ID of the scraper.</p>",
        "DescribeScraperRequest$scraperId": "<p>The ID of the scraper to describe.</p>",
        "ScraperDescription$scraperId": "<p>The ID of the scraper. For example, <code>s-example1-1234-abcd-5678-ef9012abcd34</code>.</p>",
        "ScraperSummary$scraperId": "<p>The ID of the scraper.</p>",
        "UpdateScraperLoggingConfigurationRequest$scraperId": "<p>The ID of the scraper whose logging configuration will be updated.</p>",
        "UpdateScraperRequest$scraperId": "<p>The ID of the scraper to update.</p>",
        "UpdateScraperResponse$scraperId": "<p>The ID of the updated scraper.</p>"
      }
    },
    "ScraperLoggingConfigurationStatus": {
      "base": "<p>The status of a scraper logging configuration.</p>",
      "refs": {
        "DescribeScraperLoggingConfigurationResponse$status": "<p>The status of the scraper logging configuration.</p>",
        "UpdateScraperLoggingConfigurationResponse$status": "<p>The status of the updated scraper logging configuration.</p>"
      }
    },
    "ScraperLoggingConfigurationStatusCode": {
      "base": null,
      "refs": {
        "ScraperLoggingConfigurationStatus$statusCode": "<p>The status code of the scraper logging configuration.</p>"
      }
    },
    "ScraperLoggingDestination": {
      "base": "<p>The destination where scraper logs are sent.</p>",
      "refs": {
        "DescribeScraperLoggingConfigurationResponse$loggingDestination": "<p>The destination where scraper logs are sent.</p>",
        "UpdateScraperLoggingConfigurationRequest$loggingDestination": "<p>The destination where scraper logs will be sent.</p>"
      }
    },
    "ScraperStatus": {
      "base": "<p>The <code>ScraperStatus</code> structure contains status information about the scraper.</p>",
      "refs": {
        "CreateScraperResponse$status": "<p>A structure that displays the current status of the scraper.</p>",
        "DeleteScraperResponse$status": "<p>The current status of the scraper.</p>",
        "ScraperDescription$status": "<p>A structure that contains the current status of the scraper.</p>",
        "ScraperSummary$status": "<p>A structure that contains the current status of the scraper.</p>",
        "UpdateScraperResponse$status": "<p>A structure that displays the current status of the scraper.</p>"
      }
    },
    "ScraperStatusCode": {
      "base": "<p>State of a scraper.</p>",
      "refs": {
        "ScraperStatus$statusCode": "<p>The current status of the scraper.</p>"
      }
    },
    "ScraperSummary": {
      "base": "<p>The <code>ScraperSummary</code> structure contains a summary of the details about one scraper in your account.</p>",
      "refs": {
        "ScraperSummaryList$member": null
      }
    },
    "ScraperSummaryList": {
      "base": "<p>A list of scraper summaries.</p>",
      "refs": {
        "ListScrapersResponse$scrapers": "<p>A list of <code>ScraperSummary</code> structures giving information about scrapers in the account that match the filters provided.</p>"
      }
    },
    "SecurityGroupId": {
      "base": "<p>ID of a VPC security group.</p>",
      "refs": {
        "SecurityGroupIds$member": null
      }
    },
    "SecurityGroupIds": {
      "base": "<p>A list of security group IDs specified for VPC configuration.</p>",
      "refs": {
        "EksConfiguration$securityGroupIds": "<p>A list of the security group IDs for the Amazon EKS cluster VPC configuration.</p>",
        "VpcConfiguration$securityGroupIds": "<p>The security group IDs that control network access for the Prometheus collector. These security groups must allow the collector to communicate with your Amazon MSK cluster on the required ports.</p>"
      }
    },
    "ServiceQuotaExceededException": {
      "base": "<p>Completing the request would cause a service quota to be exceeded.</p>",
      "refs": {}
    },
    "Source": {
      "base": "<p>The source of collected metrics for a scraper.</p>",
      "refs": {
        "CreateScraperRequest$source": "<p>The Amazon EKS or Amazon Web Services cluster from which the scraper will collect metrics.</p>",
        "ScraperDescription$source": "<p>The Amazon EKS cluster from which the scraper collects metrics.</p>",
        "ScraperSummary$source": "<p>The Amazon EKS cluster from which the scraper collects metrics.</p>"
      }
    },
    "StatusReason": {
      "base": "<p>The reason for the failure, if any.</p>",
      "refs": {
        "ScraperDescription$statusReason": "<p>If there is a failure, the reason for the failure.</p>",
        "ScraperSummary$statusReason": "<p>If there is a failure, the reason for the failure.</p>"
      }
    },
    "String": {
      "base": null,
      "refs": {
        "AccessDeniedException$message": "<p>Description of the error.</p>",
        "AlertManagerDefinitionStatus$statusReason": "<p>If there is a failure, the reason for the failure.</p>",
        "AnomalyDetectorStatus$statusReason": "<p>A description of the current status of the anomaly detector.</p>",
        "ConflictException$message": "<p>Description of the error.</p>",
        "ConflictException$resourceId": "<p>Identifier of the resource affected.</p>",
        "ConflictException$resourceType": "<p>Type of the resource affected.</p>",
        "DeleteResourcePolicyRequest$revisionId": "<p>The revision ID of the policy to delete. Use this parameter to ensure that you are deleting the correct version of the policy.</p>",
        "DescribeResourcePolicyResponse$policyDocument": "<p>The JSON policy document for the resource-based policy attached to the workspace.</p>",
        "DescribeResourcePolicyResponse$revisionId": "<p>The revision ID of the current resource-based policy.</p>",
        "InternalServerException$message": "<p>Description of the error.</p>",
        "ListTagsForResourceRequest$resourceArn": "<p>The ARN of the resource to list tages for. Must be a workspace, scraper, or rule groups namespace resource.</p>",
        "LoggingConfigurationStatus$statusReason": "<p>If failed, the reason for the failure.</p>",
        "PutResourcePolicyRequest$policyDocument": "<p>The JSON policy document to use as the resource-based policy. This policy defines the permissions that other AWS accounts or services have to access your workspace.</p>",
        "PutResourcePolicyRequest$revisionId": "<p>The revision ID of the policy to update. Use this parameter to ensure that you are updating the correct version of the policy. If you don't specify a revision ID, the policy is updated regardless of its current revision.</p> <p>For the first <b>PUT</b> request on a workspace that doesn't have an existing resource policy, you can specify <code>NO_POLICY</code> as the revision ID.</p>",
        "PutResourcePolicyResponse$revisionId": "<p>The revision ID of the newly created or updated resource-based policy.</p>",
        "QueryLoggingConfigurationStatus$statusReason": "<p>If there is a failure, the reason for the failure.</p>",
        "ResourceNotFoundException$message": "<p>Description of the error.</p>",
        "ResourceNotFoundException$resourceId": "<p>Identifier of the resource affected.</p>",
        "ResourceNotFoundException$resourceType": "<p>Type of the resource affected.</p>",
        "RuleGroupsNamespaceStatus$statusReason": "<p>The reason for the failure, if any.</p>",
        "ScraperLoggingConfigurationStatus$statusReason": "<p>The reason for the current status of the scraper logging configuration.</p>",
        "ServiceQuotaExceededException$message": "<p>Description of the error.</p>",
        "ServiceQuotaExceededException$resourceId": "<p>Identifier of the resource affected.</p>",
        "ServiceQuotaExceededException$resourceType": "<p>Type of the resource affected.</p>",
        "ServiceQuotaExceededException$serviceCode": "<p>Service quotas code for the originating service.</p>",
        "ServiceQuotaExceededException$quotaCode": "<p>Service quotas code of the originating quota.</p>",
        "StringMap$key": null,
        "StringMap$value": null,
        "TagResourceRequest$resourceArn": "<p>The ARN of the resource to apply tags to.</p>",
        "ThrottlingException$message": "<p>Description of the error.</p>",
        "ThrottlingException$serviceCode": "<p>Service quotas code for the originating service.</p>",
        "ThrottlingException$quotaCode": "<p>Service quotas code for the originating quota.</p>",
        "UntagResourceRequest$resourceArn": "<p>The ARN of the resource from which to remove a tag.</p>",
        "ValidationException$message": "<p>Description of the error.</p>",
        "ValidationExceptionField$name": "<p>The name of the field that caused an exception.</p>",
        "ValidationExceptionField$message": "<p>A message describing why the field caused an exception.</p>",
        "WorkspaceConfigurationStatus$statusReason": "<p>The reason for the current status, if a reason is available.</p>"
      }
    },
    "StringMap": {
      "base": null,
      "refs": {
        "ComponentConfig$options": "<p>Configuration options for the scraper component.</p>"
      }
    },
    "SubnetId": {
      "base": "<p>ID of a VPC subnet.</p>",
      "refs": {
        "SubnetIds$member": null
      }
    },
    "SubnetIds": {
      "base": "<p>A list of subnet IDs specified for VPC configuration.</p>",
      "refs": {
        "EksConfiguration$subnetIds": "<p>A list of subnet IDs for the Amazon EKS cluster VPC configuration.</p>",
        "VpcConfiguration$subnetIds": "<p>The subnet IDs where the Prometheus collector will be deployed. The subnets must be in the same Amazon VPC as your Amazon MSK cluster and have network connectivity to the cluster.</p>"
      }
    },
    "TagKey": {
      "base": null,
      "refs": {
        "TagKeys$member": null,
        "TagMap$key": "<p>The key of the tag. Must not begin with <code>aws:</code>.</p>"
      }
    },
    "TagKeys": {
      "base": null,
      "refs": {
        "UntagResourceRequest$tagKeys": "<p>The keys of the tags to remove.</p>"
      }
    },
    "TagMap": {
      "base": "<p>A tag associated with a resource.</p>",
      "refs": {
        "AnomalyDetectorDescription$tags": "<p>The tags applied to the anomaly detector.</p>",
        "AnomalyDetectorSummary$tags": "<p>The tags applied to the anomaly detector.</p>",
        "CreateAnomalyDetectorRequest$tags": "<p>The metadata to apply to the anomaly detector to assist with categorization and organization.</p>",
        "CreateAnomalyDetectorResponse$tags": "<p>The tags applied to the created anomaly detector.</p>",
        "CreateRuleGroupsNamespaceRequest$tags": "<p>The list of tag keys and values to associate with the rule groups namespace.</p>",
        "CreateRuleGroupsNamespaceResponse$tags": "<p>The list of tag keys and values that are associated with the namespace.</p>",
        "CreateScraperRequest$tags": "<p>(Optional) The list of tag keys and values to associate with the scraper.</p>",
        "CreateScraperResponse$tags": "<p>The list of tag keys and values that are associated with the scraper.</p>",
        "CreateWorkspaceRequest$tags": "<p>The list of tag keys and values to associate with the workspace.</p>",
        "CreateWorkspaceResponse$tags": "<p>The list of tag keys and values that are associated with the workspace.</p>",
        "ListTagsForResourceResponse$tags": "<p>The list of tag keys and values associated with the resource.</p>",
        "PutAnomalyDetectorResponse$tags": "<p>The tags applied to the updated anomaly detector.</p>",
        "PutRuleGroupsNamespaceResponse$tags": "<p>The list of tag keys and values that are associated with the namespace.</p>",
        "RuleGroupsNamespaceDescription$tags": "<p>The list of tag keys and values that are associated with the rule groups namespace.</p>",
        "RuleGroupsNamespaceSummary$tags": "<p>The list of tag keys and values that are associated with the rule groups namespace.</p>",
        "ScraperDescription$tags": "<p>(Optional) The list of tag keys and values associated with the scraper.</p>",
        "ScraperSummary$tags": "<p>(Optional) The list of tag keys and values associated with the scraper.</p>",
        "TagResourceRequest$tags": "<p>The list of tag keys and values to associate with the resource.</p> <p>Keys must not begin with <code>aws:</code>.</p>",
        "UpdateScraperResponse$tags": "<p>The list of tag keys and values that are associated with the scraper.</p>",
        "WorkspaceDescription$tags": "<p>The list of tag keys and values that are associated with the workspace.</p>",
        "WorkspaceSummary$tags": "<p>The list of tag keys and values that are associated with the workspace.</p>"
      }
    },
    "TagResourceRequest": {
      "base": null,
      "refs": {}
    },
    "TagResourceResponse": {
      "base": null,
      "refs": {}
    },
    "TagValue": {
      "base": null,
      "refs": {
        "TagMap$value": "<p>The value of the tag.</p>"
      }
    },
    "ThrottlingException": {
      "base": "<p>The request was denied due to request throttling.</p>",
      "refs": {}
    },
    "Timestamp": {
      "base": null,
      "refs": {
        "AlertManagerDefinitionDescription$createdAt": "<p>The date and time that the alert manager definition was created.</p>",
        "AlertManagerDefinitionDescription$modifiedAt": "<p>The date and time that the alert manager definition was most recently changed.</p>",
        "AnomalyDetectorDescription$createdAt": "<p>The timestamp when the anomaly detector was created.</p>",
        "AnomalyDetectorDescription$modifiedAt": "<p>The timestamp when the anomaly detector was last modified.</p>",
        "AnomalyDetectorSummary$createdAt": "<p>The timestamp when the anomaly detector was created.</p>",
        "AnomalyDetectorSummary$modifiedAt": "<p>The timestamp when the anomaly detector was last modified.</p>",
        "DescribeScraperLoggingConfigurationResponse$modifiedAt": "<p>The date and time when the logging configuration was last modified.</p>",
        "LoggingConfigurationMetadata$createdAt": "<p>The date and time that the logging configuration was created.</p>",
        "LoggingConfigurationMetadata$modifiedAt": "<p>The date and time that the logging configuration was most recently changed.</p>",
        "QueryLoggingConfigurationMetadata$createdAt": "<p>The date and time when the query logging configuration was created.</p>",
        "QueryLoggingConfigurationMetadata$modifiedAt": "<p>The date and time when the query logging configuration was last modified.</p>",
        "RuleGroupsNamespaceDescription$createdAt": "<p>The date and time that the rule groups namespace was created.</p>",
        "RuleGroupsNamespaceDescription$modifiedAt": "<p>The date and time that the rule groups namespace was most recently changed.</p>",
        "RuleGroupsNamespaceSummary$createdAt": "<p>The date and time that the rule groups namespace was created.</p>",
        "RuleGroupsNamespaceSummary$modifiedAt": "<p>The date and time that the rule groups namespace was most recently changed.</p>",
        "ScraperDescription$createdAt": "<p>The date and time that the scraper was created.</p>",
        "ScraperDescription$lastModifiedAt": "<p>The date and time that the scraper was last modified.</p>",
        "ScraperSummary$createdAt": "<p>The date and time that the scraper was created.</p>",
        "ScraperSummary$lastModifiedAt": "<p>The date and time that the scraper was last modified.</p>",
        "WorkspaceDescription$createdAt": "<p>The date and time that the workspace was created.</p>",
        "WorkspaceSummary$createdAt": "<p>The date and time that the workspace was created.</p>"
      }
    },
    "UntagResourceRequest": {
      "base": null,
      "refs": {}
    },
    "UntagResourceResponse": {
      "base": null,
      "refs": {}
    },
    "UpdateLoggingConfigurationRequest": {
      "base": "<p>Represents the input of an <code>UpdateLoggingConfiguration</code> operation.</p>",
      "refs": {}
    },
    "UpdateLoggingConfigurationResponse": {
      "base": "<p>Represents the output of an <code>UpdateLoggingConfiguration</code> operation.</p>",
      "refs": {}
    },
    "UpdateQueryLoggingConfigurationRequest": {
      "base": null,
      "refs": {}
    },
    "UpdateQueryLoggingConfigurationResponse": {
      "base": null,
      "refs": {}
    },
    "UpdateScraperLoggingConfigurationRequest": {
      "base": null,
      "refs": {}
    },
    "UpdateScraperLoggingConfigurationResponse": {
      "base": null,
      "refs": {}
    },
    "UpdateScraperRequest": {
      "base": null,
      "refs": {}
    },
    "UpdateScraperResponse": {
      "base": null,
      "refs": {}
    },
    "UpdateWorkspaceAliasRequest": {
      "base": "<p>Represents the input of an <code>UpdateWorkspaceAlias</code> operation.</p>",
      "refs": {}
    },
    "UpdateWorkspaceConfigurationRequest": {
      "base": null,
      "refs": {}
    },
    "UpdateWorkspaceConfigurationRequestRetentionPeriodInDaysInteger": {
      "base": null,
      "refs": {
        "UpdateWorkspaceConfigurationRequest$retentionPeriodInDays": "<p>Specifies how many days that metrics will be retained in the workspace.</p>"
      }
    },
    "UpdateWorkspaceConfigurationResponse": {
      "base": null,
      "refs": {}
    },
    "Uri": {
      "base": null,
      "refs": {
        "WorkspaceDescription$prometheusEndpoint": "<p>The Prometheus endpoint available for this workspace. For example, <code>https://aps-workspaces.&lt;region&gt;.amazonaws.com/workspaces/ws-example1-1234-abcd-5678-ef90abcd1234/api/v1/</code>.</p>"
      }
    },
    "ValidationException": {
      "base": "<p>The input fails to satisfy the constraints specified by an Amazon Web Services service.</p>",
      "refs": {}
    },
    "ValidationExceptionField": {
      "base": "<p>Information about a field passed into a request that resulted in an exception.</p>",
      "refs": {
        "ValidationExceptionFieldList$member": null
      }
    },
    "ValidationExceptionFieldList": {
      "base": "<p>A list of fields.</p>",
      "refs": {
        "ValidationException$fieldList": "<p>The field that caused the error, if applicable.</p>"
      }
    },
    "ValidationExceptionReason": {
      "base": "<p>Possible reasons a request failed validation.</p>",
      "refs": {
        "ValidationException$reason": "<p>Reason the request failed validation.</p>"
      }
    },
    "VpcConfiguration": {
      "base": "<p>The Amazon VPC configuration that specifies the network settings for a Prometheus collector to securely connect to Amazon MSK clusters. This configuration includes the security groups and subnets that control network access and placement for the collector.</p>",
      "refs": {
        "Source$vpcConfiguration": "<p>The Amazon VPC configuration for the Prometheus collector when connecting to Amazon MSK clusters. This configuration enables secure, private network connectivity between the collector and your Amazon MSK cluster within your Amazon VPC.</p>"
      }
    },
    "WorkspaceAlias": {
      "base": "<p>A user-assigned workspace alias.</p>",
      "refs": {
        "CreateWorkspaceRequest$alias": "<p>An alias that you assign to this workspace to help you identify it. It does not need to be unique.</p> <p>Blank spaces at the beginning or end of the alias that you specify will be trimmed from the value used.</p>",
        "ListWorkspacesRequest$alias": "<p>If this is included, it filters the results to only the workspaces with names that start with the value that you specify here.</p> <p>Amazon Managed Service for Prometheus will automatically strip any blank spaces from the beginning and end of the alias that you specify.</p>",
        "UpdateWorkspaceAliasRequest$alias": "<p>The new alias for the workspace. It does not need to be unique.</p> <p>Amazon Managed Service for Prometheus will automatically strip any blank spaces from the beginning and end of the alias that you specify.</p>",
        "WorkspaceDescription$alias": "<p>The alias that is assigned to this workspace to help identify it. It does not need to be unique.</p>",
        "WorkspaceSummary$alias": "<p>The alias that is assigned to this workspace to help identify it. It does not need to be unique.</p>"
      }
    },
    "WorkspaceArn": {
      "base": "<p>An ARN identifying a Workspace.</p>",
      "refs": {
        "AmpConfiguration$workspaceArn": "<p>ARN of the Amazon Managed Service for Prometheus workspace.</p>",
        "CreateWorkspaceResponse$arn": "<p>The ARN for the new workspace.</p>",
        "WorkspaceDescription$arn": "<p>The ARN of the workspace. For example, <code>arn:aws:aps:&lt;region&gt;:123456789012:workspace/ws-example1-1234-abcd-5678-ef90abcd1234</code>.</p>",
        "WorkspaceSummary$arn": "<p>The ARN of the workspace.</p>"
      }
    },
    "WorkspaceConfigurationDescription": {
      "base": "<p>This structure contains the description of the workspace configuration.</p>",
      "refs": {
        "DescribeWorkspaceConfigurationResponse$workspaceConfiguration": "<p>This structure contains the information about the workspace configuration.</p>"
      }
    },
    "WorkspaceConfigurationDescriptionRetentionPeriodInDaysInteger": {
      "base": null,
      "refs": {
        "WorkspaceConfigurationDescription$retentionPeriodInDays": "<p>This field displays how many days that metrics are retained in the workspace.</p>"
      }
    },
    "WorkspaceConfigurationStatus": {
      "base": "<p>This structure displays the current status of the workspace configuration, and might also contain a reason for that status.</p>",
      "refs": {
        "UpdateWorkspaceConfigurationResponse$status": "<p>The status of the workspace configuration.</p>",
        "WorkspaceConfigurationDescription$status": "<p>This structure displays the current status of the workspace configuration, and might also contain a reason for that status.</p>"
      }
    },
    "WorkspaceConfigurationStatusCode": {
      "base": null,
      "refs": {
        "WorkspaceConfigurationStatus$statusCode": "<p>The current status of the workspace configuration.</p>"
      }
    },
    "WorkspaceDescription": {
      "base": "<p>The full details about one Amazon Managed Service for Prometheus workspace in your account.</p>",
      "refs": {
        "DescribeWorkspaceResponse$workspace": "<p>A structure that contains details about the workspace.</p>"
      }
    },
    "WorkspaceId": {
      "base": "<p>A workspace ID.</p>",
      "refs": {
        "CreateAlertManagerDefinitionRequest$workspaceId": "<p>The ID of the workspace to add the alert manager definition to.</p>",
        "CreateAnomalyDetectorRequest$workspaceId": "<p>The identifier of the workspace where the anomaly detector will be created.</p>",
        "CreateLoggingConfigurationRequest$workspaceId": "<p>The ID of the workspace to create the logging configuration for.</p>",
        "CreateQueryLoggingConfigurationRequest$workspaceId": "<p>The ID of the workspace for which to create the query logging configuration.</p>",
        "CreateRuleGroupsNamespaceRequest$workspaceId": "<p>The ID of the workspace to add the rule groups namespace.</p>",
        "CreateWorkspaceResponse$workspaceId": "<p>The unique ID for the new workspace.</p>",
        "DeleteAlertManagerDefinitionRequest$workspaceId": "<p>The ID of the workspace to delete the alert manager definition from.</p>",
        "DeleteAnomalyDetectorRequest$workspaceId": "<p>The identifier of the workspace containing the anomaly detector to delete.</p>",
        "DeleteLoggingConfigurationRequest$workspaceId": "<p>The ID of the workspace containing the logging configuration to delete.</p>",
        "DeleteQueryLoggingConfigurationRequest$workspaceId": "<p>The ID of the workspace from which to delete the query logging configuration.</p>",
        "DeleteResourcePolicyRequest$workspaceId": "<p>The ID of the workspace from which to delete the resource-based policy.</p>",
        "DeleteRuleGroupsNamespaceRequest$workspaceId": "<p>The ID of the workspace containing the rule groups namespace and definition to delete.</p>",
        "DeleteWorkspaceRequest$workspaceId": "<p>The ID of the workspace to delete.</p>",
        "DescribeAlertManagerDefinitionRequest$workspaceId": "<p>The ID of the workspace to retrieve the alert manager definition from.</p>",
        "DescribeAnomalyDetectorRequest$workspaceId": "<p>The identifier of the workspace containing the anomaly detector.</p>",
        "DescribeLoggingConfigurationRequest$workspaceId": "<p>The ID of the workspace to describe the logging configuration for.</p>",
        "DescribeQueryLoggingConfigurationRequest$workspaceId": "<p>The ID of the workspace for which to retrieve the query logging configuration.</p>",
        "DescribeResourcePolicyRequest$workspaceId": "<p>The ID of the workspace to describe the resource-based policy for.</p>",
        "DescribeRuleGroupsNamespaceRequest$workspaceId": "<p>The ID of the workspace containing the rule groups namespace.</p>",
        "DescribeWorkspaceConfigurationRequest$workspaceId": "<p>The ID of the workspace that you want to retrieve information for. To find the IDs of your workspaces, use the <a href=\"https://docs.aws.amazon.com/prometheus/latest/APIReference/API_ListWorkspaces.htm\">ListWorkspaces</a> operation.</p>",
        "DescribeWorkspaceRequest$workspaceId": "<p>The ID of the workspace to describe.</p>",
        "ListAnomalyDetectorsRequest$workspaceId": "<p>The identifier of the workspace containing the anomaly detectors to list.</p>",
        "ListRuleGroupsNamespacesRequest$workspaceId": "<p>The ID of the workspace containing the rule groups namespaces.</p>",
        "LoggingConfigurationMetadata$workspace": "<p>The ID of the workspace the logging configuration is for.</p>",
        "PutAlertManagerDefinitionRequest$workspaceId": "<p>The ID of the workspace to update the alert manager definition in.</p>",
        "PutAnomalyDetectorRequest$workspaceId": "<p>The identifier of the workspace containing the anomaly detector to update.</p>",
        "PutResourcePolicyRequest$workspaceId": "<p>The ID of the workspace to attach the resource-based policy to.</p>",
        "PutRuleGroupsNamespaceRequest$workspaceId": "<p>The ID of the workspace where you are updating the rule groups namespace.</p>",
        "QueryLoggingConfigurationMetadata$workspace": "<p>The ID of the workspace associated with this query logging configuration.</p>",
        "UpdateLoggingConfigurationRequest$workspaceId": "<p>The ID of the workspace to update the logging configuration for.</p>",
        "UpdateQueryLoggingConfigurationRequest$workspaceId": "<p>The ID of the workspace for which to update the query logging configuration.</p>",
        "UpdateWorkspaceAliasRequest$workspaceId": "<p>The ID of the workspace to update.</p>",
        "UpdateWorkspaceConfigurationRequest$workspaceId": "<p>The ID of the workspace that you want to update. To find the IDs of your workspaces, use the <a href=\"https://docs.aws.amazon.com/prometheus/latest/APIReference/API_ListWorkspaces.htm\">ListWorkspaces</a> operation.</p>",
        "WorkspaceDescription$workspaceId": "<p>The unique ID for the workspace. For example, <code>ws-example1-1234-abcd-5678-ef90abcd1234</code>.</p>",
        "WorkspaceSummary$workspaceId": "<p>The unique ID for the workspace.</p>"
      }
    },
    "WorkspacePolicyStatusCode": {
      "base": null,
      "refs": {
        "DescribeResourcePolicyResponse$policyStatus": "<p>The current status of the resource-based policy.</p>",
        "PutResourcePolicyResponse$policyStatus": "<p>The current status of the resource-based policy.</p>"
      }
    },
    "WorkspaceStatus": {
      "base": "<p>The status of the workspace.</p>",
      "refs": {
        "CreateWorkspaceResponse$status": "<p>The current status of the new workspace. Immediately after you create the workspace, the status is usually <code>CREATING</code>.</p>",
        "WorkspaceDescription$status": "<p>The current status of the workspace.</p>",
        "WorkspaceSummary$status": "<p>The current status of the workspace.</p>"
      }
    },
    "WorkspaceStatusCode": {
      "base": "<p>State of a workspace.</p>",
      "refs": {
        "WorkspaceStatus$statusCode": "<p>The current status of the workspace.</p>"
      }
    },
    "WorkspaceSummary": {
      "base": "<p>The information about one Amazon Managed Service for Prometheus workspace in your account. </p>",
      "refs": {
        "WorkspaceSummaryList$member": null
      }
    },
    "WorkspaceSummaryList": {
      "base": "<p>A list of workspace summaries.</p>",
      "refs": {
        "ListWorkspacesResponse$workspaces": "<p>An array of <code>WorkspaceSummary</code> structures containing information about the workspaces requested.</p>"
      }
    }
  }
}
