{
  "version": "2.0",
  "service": "<p>Use CloudWatch Application Signals for comprehensive observability of your cloud-based applications. It enables real-time service health dashboards and helps you track long-term performance trends against your business goals. The application-centric view provides you with unified visibility across your applications, services, and dependencies, so you can proactively monitor and efficiently triage any issues that may arise, ensuring optimal customer experience.</p> <p>Application Signals provides the following benefits:</p> <ul> <li> <p>Automatically collect metrics and traces from your applications, and display key metrics such as call volume, availability, latency, faults, and errors. </p> </li> <li> <p>Create and monitor service level objectives (SLOs). </p> </li> <li> <p>See a map of your application topology that Application Signals automatically discovers, that gives you a visual representation of your applications, dependencies, and their connectivity.</p> </li> </ul> <p>Application Signals works with CloudWatch RUM, CloudWatch Synthetics canaries, and Amazon Web Services Service Catalog AppRegistry, to display your client pages, Synthetics canaries, and application names within dashboards and maps.</p>",
  "operations": {
    "BatchGetServiceLevelObjectiveBudgetReport": "<p>Use this operation to retrieve one or more <i>service level objective (SLO) budget reports</i>.</p> <p>An <i>error budget</i> is the amount of time or requests in an unhealthy state that your service can accumulate during an interval before your overall SLO budget health is breached and the SLO is considered to be unmet. For example, an SLO with a threshold of 99.95% and a monthly interval translates to an error budget of 21.9 minutes of downtime in a 30-day month.</p> <p>Budget reports include a health indicator, the attainment value, and remaining budget.</p> <p>For more information about SLO error budgets, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/CloudWatch-ServiceLevelObjectives.html#CloudWatch-ServiceLevelObjectives-concepts\"> SLO concepts</a>.</p>",
    "BatchUpdateExclusionWindows": "<p>Add or remove time window exclusions for one or more Service Level Objectives (SLOs).</p>",
    "CreateServiceLevelObjective": "<p>Creates a service level objective (SLO), which can help you ensure that your critical business operations are meeting customer expectations. Use SLOs to set and track specific target levels for the reliability and availability of your applications and services. SLOs use service level indicators (SLIs) to calculate whether the application is performing at the level that you want.</p> <p>Create an SLO to set a target for a service or operation’s availability or latency. CloudWatch measures this target frequently you can find whether it has been breached. </p> <p>The target performance quality that is defined for an SLO is the <i>attainment goal</i>.</p> <p>You can set SLO targets for your applications that are discovered by Application Signals, using critical metrics such as latency and availability. You can also set SLOs against any CloudWatch metric or math expression that produces a time series.</p> <note> <p>You can't create an SLO for a service operation that was discovered by Application Signals until after that operation has reported standard metrics to Application Signals.</p> </note> <p>When you create an SLO, you specify whether it is a <i>period-based SLO</i> or a <i>request-based SLO</i>. Each type of SLO has a different way of evaluating your application's performance against its attainment goal.</p> <ul> <li> <p>A <i>period-based SLO</i> uses defined <i>periods</i> of time within a specified total time interval. For each period of time, Application Signals determines whether the application met its goal. The attainment rate is calculated as the <code>number of good periods/number of total periods</code>.</p> <p>For example, for a period-based SLO, meeting an attainment goal of 99.9% means that within your interval, your application must meet its performance goal during at least 99.9% of the time periods.</p> </li> <li> <p>A <i>request-based SLO</i> doesn't use pre-defined periods of time. Instead, the SLO measures <code>number of good requests/number of total requests</code> during the interval. At any time, you can find the ratio of good requests to total requests for the interval up to the time stamp that you specify, and measure that ratio against the goal set in your SLO.</p> </li> </ul> <p>After you have created an SLO, you can retrieve error budget reports for it. An <i>error budget</i> is the amount of time or amount of requests that your application can be non-compliant with the SLO's goal, and still have your application meet the goal.</p> <ul> <li> <p>For a period-based SLO, the error budget starts at a number defined by the highest number of periods that can fail to meet the threshold, while still meeting the overall goal. The <i>remaining error budget</i> decreases with every failed period that is recorded. The error budget within one interval can never increase.</p> <p>For example, an SLO with a threshold that 99.95% of requests must be completed under 2000ms every month translates to an error budget of 21.9 minutes of downtime per month.</p> </li> <li> <p>For a request-based SLO, the remaining error budget is dynamic and can increase or decrease, depending on the ratio of good requests to total requests.</p> </li> </ul> <p>For more information about SLOs, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/CloudWatch-ServiceLevelObjectives.html\"> Service level objectives (SLOs)</a>. </p> <p>When you perform a <code>CreateServiceLevelObjective</code> operation, Application Signals creates the <i>AWSServiceRoleForCloudWatchApplicationSignals</i> service-linked role, if it doesn't already exist in your account. This service- linked role has the following permissions:</p> <ul> <li> <p> <code>xray:GetServiceGraph</code> </p> </li> <li> <p> <code>logs:StartQuery</code> </p> </li> <li> <p> <code>logs:GetQueryResults</code> </p> </li> <li> <p> <code>cloudwatch:GetMetricData</code> </p> </li> <li> <p> <code>cloudwatch:ListMetrics</code> </p> </li> <li> <p> <code>tag:GetResources</code> </p> </li> <li> <p> <code>autoscaling:DescribeAutoScalingGroups</code> </p> </li> </ul>",
    "DeleteGroupingConfiguration": "<p>Deletes the grouping configuration for this account. This removes all custom grouping attribute definitions that were previously configured.</p>",
    "DeleteServiceLevelObjective": "<p>Deletes the specified service level objective.</p>",
    "GetService": "<p>Returns information about a service discovered by Application Signals.</p>",
    "GetServiceLevelObjective": "<p>Returns information about one SLO created in the account. </p>",
    "ListAuditFindings": "<p>Returns a list of audit findings that provide automated analysis of service behavior and root cause analysis. These findings help identify the most significant observations about your services, including performance issues, anomalies, and potential problems. The findings are generated using heuristic algorithms based on established troubleshooting patterns.</p>",
    "ListEntityEvents": "<p>Returns a list of change events for a specific entity, such as deployments, configuration changes, or other state-changing activities. This operation helps track the history of changes that may have affected service performance.</p>",
    "ListGroupingAttributeDefinitions": "<p>Returns the current grouping configuration for this account, including all custom grouping attribute definitions that have been configured. These definitions determine how services are logically grouped based on telemetry attributes, Amazon Web Services tags, or predefined mappings.</p>",
    "ListServiceDependencies": "<p>Returns a list of service dependencies of the service that you specify. A dependency is an infrastructure component that an operation of this service connects with. Dependencies can include Amazon Web Services services, Amazon Web Services resources, and third-party services. </p>",
    "ListServiceDependents": "<p>Returns the list of dependents that invoked the specified service during the provided time range. Dependents include other services, CloudWatch Synthetics canaries, and clients that are instrumented with CloudWatch RUM app monitors.</p>",
    "ListServiceLevelObjectiveExclusionWindows": "<p>Retrieves all exclusion windows configured for a specific SLO.</p>",
    "ListServiceLevelObjectives": "<p>Returns a list of SLOs created in this account.</p>",
    "ListServiceOperations": "<p>Returns a list of the <i>operations</i> of this service that have been discovered by Application Signals. Only the operations that were invoked during the specified time range are returned.</p>",
    "ListServiceStates": "<p>Returns information about the last deployment and other change states of services. This API provides visibility into recent changes that may have affected service performance, helping with troubleshooting and change correlation.</p>",
    "ListServices": "<p>Returns a list of services that have been discovered by Application Signals. A service represents a minimum logical and transactional unit that completes a business function. Services are discovered through Application Signals instrumentation.</p>",
    "ListTagsForResource": "<p>Displays the tags associated with a CloudWatch resource. Tags can be assigned to service level objectives.</p>",
    "PutGroupingConfiguration": "<p>Creates or updates the grouping configuration for this account. This operation allows you to define custom grouping attributes that determine how services are logically grouped based on telemetry attributes, Amazon Web Services tags, or predefined mappings. These grouping attributes can then be used to organize and filter services in the Application Signals console and APIs.</p>",
    "StartDiscovery": "<p>Enables this Amazon Web Services account to be able to use CloudWatch Application Signals by creating the <i>AWSServiceRoleForCloudWatchApplicationSignals</i> service-linked role. This service- linked role has the following permissions:</p> <ul> <li> <p> <code>xray:GetServiceGraph</code> </p> </li> <li> <p> <code>logs:StartQuery</code> </p> </li> <li> <p> <code>logs:GetQueryResults</code> </p> </li> <li> <p> <code>cloudwatch:GetMetricData</code> </p> </li> <li> <p> <code>cloudwatch:ListMetrics</code> </p> </li> <li> <p> <code>tag:GetResources</code> </p> </li> <li> <p> <code>autoscaling:DescribeAutoScalingGroups</code> </p> </li> </ul> <p>A service-linked CloudTrail event channel is created to process CloudTrail events and return change event information. This includes last deployment time, userName, eventName, and other event metadata.</p> <p>After completing this step, you still need to instrument your Java and Python applications to send data to Application Signals. For more information, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/CloudWatch-Application-Signals-Enable.html\"> Enabling Application Signals</a>.</p>",
    "TagResource": "<p>Assigns one or more tags (key-value pairs) to the specified CloudWatch resource, such as a service level objective.</p> <p>Tags can help you organize and categorize your resources. You can also use them to scope user permissions by granting a user permission to access or change only resources with certain tag values.</p> <p>Tags don't have any semantic meaning to Amazon Web Services and are interpreted strictly as strings of characters.</p> <p>You can use the <code>TagResource</code> action with an alarm that already has tags. If you specify a new tag key for the alarm, this tag is appended to the list of tags associated with the alarm. If you specify a tag key that is already associated with the alarm, the new tag value that you specify replaces the previous value for that tag.</p> <p>You can associate as many as 50 tags with a CloudWatch resource.</p>",
    "UntagResource": "<p>Removes one or more tags from the specified resource.</p>",
    "UpdateServiceLevelObjective": "<p>Updates an existing service level objective (SLO). If you omit parameters, the previous values of those parameters are retained. </p> <p>You cannot change from a period-based SLO to a request-based SLO, or change from a request-based SLO to a period-based SLO.</p>"
  },
  "shapes": {
    "AccessDeniedException": {
      "base": "<p>You don't have sufficient permissions to perform this action.</p>",
      "refs": {}
    },
    "AccountId": {
      "base": null,
      "refs": {
        "MetricDataQuery$AccountId": "<p>The ID of the account where this metric is located. If you are performing this operation in a monitoring account, use this to specify which source account to retrieve this metric from.</p>"
      }
    },
    "AmazonResourceName": {
      "base": null,
      "refs": {
        "ListTagsForResourceRequest$ResourceArn": "<p>The Amazon Resource Name (ARN) of the CloudWatch resource that you want to view tags for.</p> <p>The ARN format of an Application Signals SLO is <code>arn:aws:cloudwatch:<i>Region</i>:<i>account-id</i>:slo:<i>slo-name</i> </code> </p> <p>For more information about ARN format, see <a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/list_amazoncloudwatch.html#amazoncloudwatch-resources-for-iam-policies\"> Resource Types Defined by Amazon CloudWatch</a> in the <i>Amazon Web Services General Reference</i>.</p>",
        "TagResourceRequest$ResourceArn": "<p>The Amazon Resource Name (ARN) of the CloudWatch resource that you want to set tags for.</p> <p>The ARN format of an Application Signals SLO is <code>arn:aws:cloudwatch:<i>Region</i>:<i>account-id</i>:slo:<i>slo-name</i> </code> </p> <p>For more information about ARN format, see <a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/list_amazoncloudwatch.html#amazoncloudwatch-resources-for-iam-policies\"> Resource Types Defined by Amazon CloudWatch</a> in the <i>Amazon Web Services General Reference</i>.</p>",
        "UntagResourceRequest$ResourceArn": "<p>The Amazon Resource Name (ARN) of the CloudWatch resource that you want to delete tags from.</p> <p>The ARN format of an Application Signals SLO is <code>arn:aws:cloudwatch:<i>Region</i>:<i>account-id</i>:slo:<i>slo-name</i> </code> </p> <p>For more information about ARN format, see <a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/list_amazoncloudwatch.html#amazoncloudwatch-resources-for-iam-policies\"> Resource Types Defined by Amazon CloudWatch</a> in the <i>Amazon Web Services General Reference</i>.</p>"
      }
    },
    "Attainment": {
      "base": null,
      "refs": {
        "ServiceLevelObjectiveBudgetReport$Attainment": "<p>A number between 0 and 100 that represents the success percentage of your application compared to the goal set by the SLO.</p> <p>If this is a period-based SLO, the number is the percentage of time periods that the service has attained the SLO's attainment goal, as of the time of the request.</p> <p>If this is a request-based SLO, the number is the number of successful requests divided by the number of total requests, multiplied by 100, during the time range that you specified in your request.</p>"
      }
    },
    "AttainmentGoal": {
      "base": null,
      "refs": {
        "Goal$AttainmentGoal": "<p>The threshold that determines if the goal is being met.</p> <p>If this is a period-based SLO, the attainment goal is the percentage of good periods that meet the threshold requirements to the total periods within the interval. For example, an attainment goal of 99.9% means that within your interval, you are targeting 99.9% of the periods to be in healthy state.</p> <p>If this is a request-based SLO, the attainment goal is the percentage of requests that must be successful to meet the attainment goal.</p> <p>If you omit this parameter, 99 is used to represent 99% as the attainment goal.</p>"
      }
    },
    "AttributeFilter": {
      "base": "<p>A structure that defines a filter for narrowing down results based on specific attribute values. This can be used to filter services by platform, environment, or other service characteristics.</p>",
      "refs": {
        "AttributeFilters$member": null
      }
    },
    "AttributeFilterName": {
      "base": null,
      "refs": {
        "AttributeFilter$AttributeFilterName": "<p>The name of the attribute to filter by, such as <code>Platform</code>, <code>Environment</code>, or <code>BusinessUnit</code>.</p>"
      }
    },
    "AttributeFilterValue": {
      "base": null,
      "refs": {
        "AttributeFilterValues$member": null
      }
    },
    "AttributeFilterValues": {
      "base": null,
      "refs": {
        "AttributeFilter$AttributeFilterValues": "<p>An array of values to match for the specified attribute. Services that have any of these values for the attribute will be included in the results.</p>"
      }
    },
    "AttributeFilters": {
      "base": null,
      "refs": {
        "ListServiceStatesInput$AttributeFilters": "<p>A list of attribute filters to narrow down the services. You can filter by platform, environment, or other service attributes.</p>",
        "ServiceState$AttributeFilters": "<p>The attribute filters that were applied when retrieving this service state information.</p>"
      }
    },
    "AttributeMap": {
      "base": null,
      "refs": {
        "AttributeMaps$member": null
      }
    },
    "AttributeMaps": {
      "base": null,
      "refs": {
        "Service$AttributeMaps": "<p>This structure contains one or more string-to-string maps that help identify this service. It can include <i>platform attributes</i>, <i>application attributes</i>, and <i>telemetry attributes</i>.</p> <p>Platform attributes contain information the service's platform.</p> <ul> <li> <p> <code>PlatformType</code> defines the hosted-in platform.</p> </li> <li> <p> <code>EKS.Cluster</code> is the name of the Amazon EKS cluster.</p> </li> <li> <p> <code>K8s.Cluster</code> is the name of the self-hosted Kubernetes cluster.</p> </li> <li> <p> <code>K8s.Namespace</code> is the name of the Kubernetes namespace in either Amazon EKS or Kubernetes clusters.</p> </li> <li> <p> <code>K8s.Workload</code> is the name of the Kubernetes workload in either Amazon EKS or Kubernetes clusters.</p> </li> <li> <p> <code>K8s.Node</code> is the name of the Kubernetes node in either Amazon EKS or Kubernetes clusters.</p> </li> <li> <p> <code>K8s.Pod</code> is the name of the Kubernetes pod in either Amazon EKS or Kubernetes clusters.</p> </li> <li> <p> <code>EC2.AutoScalingGroup</code> is the name of the Amazon EC2 Auto Scaling group.</p> </li> <li> <p> <code>EC2.InstanceId</code> is the ID of the Amazon EC2 instance.</p> </li> <li> <p> <code>Host</code> is the name of the host, for all platform types.</p> </li> </ul> <p>Application attributes contain information about the application.</p> <ul> <li> <p> <code>AWS.Application</code> is the application's name in Amazon Web Services Service Catalog AppRegistry.</p> </li> <li> <p> <code>AWS.Application.ARN</code> is the application's ARN in Amazon Web Services Service Catalog AppRegistry.</p> </li> </ul> <p>Telemetry attributes contain telemetry information.</p> <ul> <li> <p> <code>Telemetry.SDK</code> is the fingerprint of the OpenTelemetry SDK version for instrumented services.</p> </li> <li> <p> <code>Telemetry.Agent</code> is the fingerprint of the agent used to collect and send telemetry data.</p> </li> <li> <p> <code>Telemetry.Source</code> Specifies the point of application where the telemetry was collected or specifies what was used for the source of telemetry data.</p> </li> </ul>",
        "ServiceSummary$AttributeMaps": "<p>This structure contains one or more string-to-string maps that help identify this service. It can include <i>platform attributes</i>, <i>application attributes</i>, and <i>telemetry attributes</i>.</p> <p>Platform attributes contain information the service's platform.</p> <ul> <li> <p> <code>PlatformType</code> defines the hosted-in platform.</p> </li> <li> <p> <code>EKS.Cluster</code> is the name of the Amazon EKS cluster.</p> </li> <li> <p> <code>K8s.Cluster</code> is the name of the self-hosted Kubernetes cluster.</p> </li> <li> <p> <code>K8s.Namespace</code> is the name of the Kubernetes namespace in either Amazon EKS or Kubernetes clusters.</p> </li> <li> <p> <code>K8s.Workload</code> is the name of the Kubernetes workload in either Amazon EKS or Kubernetes clusters.</p> </li> <li> <p> <code>K8s.Node</code> is the name of the Kubernetes node in either Amazon EKS or Kubernetes clusters.</p> </li> <li> <p> <code>K8s.Pod</code> is the name of the Kubernetes pod in either Amazon EKS or Kubernetes clusters.</p> </li> <li> <p> <code>EC2.AutoScalingGroup</code> is the name of the Amazon EC2 Auto Scaling group.</p> </li> <li> <p> <code>EC2.InstanceId</code> is the ID of the Amazon EC2 instance.</p> </li> <li> <p> <code>Host</code> is the name of the host, for all platform types.</p> </li> </ul> <p>Application attributes contain information about the application.</p> <ul> <li> <p> <code>AWS.Application</code> is the application's name in Amazon Web Services Service Catalog AppRegistry.</p> </li> <li> <p> <code>AWS.Application.ARN</code> is the application's ARN in Amazon Web Services Service Catalog AppRegistry.</p> </li> </ul> <p>Telemetry attributes contain telemetry information.</p> <ul> <li> <p> <code>Telemetry.SDK</code> is the fingerprint of the OpenTelemetry SDK version for instrumented services.</p> </li> <li> <p> <code>Telemetry.Agent</code> is the fingerprint of the agent used to collect and send telemetry data.</p> </li> <li> <p> <code>Telemetry.Source</code> Specifies the point of application where the telemetry was collected or specifies what was used for the source of telemetry data.</p> </li> </ul>"
      }
    },
    "Attributes": {
      "base": null,
      "refs": {
        "AuditFinding$KeyAttributes": "<p>The key attributes that identify the service or entity this audit finding relates to. This is a string-to-string map that includes fields like Type, Name, and Environment.</p>",
        "ChangeEvent$Entity": "<p>The entity (service or resource) that was affected by this change event, including its key attributes.</p> <p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> <li> <p> <code>AwsAccountId</code> specifies the account where this object is in.</p> </li> </ul> <p>Below is an example of a service.</p> <p> <code>{ \"Type\": \"Service\", \"Name\": \"visits-service\", \"Environment\": \"petclinic-test\" }</code> </p> <p>Below is an example of a resource.</p> <p> <code>{ \"Type\": \"AWS::Resource\", \"ResourceType\": \"AWS::DynamoDB::Table\", \"Identifier\": \"Customers\" }</code> </p>",
        "DependencyConfig$DependencyKeyAttributes": "<p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "GetServiceInput$KeyAttributes": "<p>Use this field to specify which service you want to retrieve information for. You must specify at least the <code>Type</code>, <code>Name</code>, and <code>Environment</code> attributes.</p> <p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "ListEntityEventsInput$Entity": "<p>The entity for which to retrieve change events. This specifies the service, resource, or other entity whose event history you want to examine.</p> <p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> <li> <p> <code>AwsAccountId</code> specifies the account where this object is in.</p> </li> </ul> <p>Below is an example of a service.</p> <p> <code>{ \"Type\": \"Service\", \"Name\": \"visits-service\", \"Environment\": \"petclinic-test\" }</code> </p> <p>Below is an example of a resource.</p> <p> <code>{ \"Type\": \"AWS::Resource\", \"ResourceType\": \"AWS::DynamoDB::Table\", \"Identifier\": \"Customers\" }</code> </p>",
        "ListServiceDependenciesInput$KeyAttributes": "<p>Use this field to specify which service you want to retrieve information for. You must specify at least the <code>Type</code>, <code>Name</code>, and <code>Environment</code> attributes.</p> <p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "ListServiceDependentsInput$KeyAttributes": "<p>Use this field to specify which service you want to retrieve information for. You must specify at least the <code>Type</code>, <code>Name</code>, and <code>Environment</code> attributes.</p> <p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "ListServiceLevelObjectivesInput$KeyAttributes": "<p>You can use this optional field to specify which services you want to retrieve SLO information for.</p> <p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "ListServiceOperationsInput$KeyAttributes": "<p>Use this field to specify which service you want to retrieve information for. You must specify at least the <code>Type</code>, <code>Name</code>, and <code>Environment</code> attributes.</p> <p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "LogGroupReferences$member": null,
        "Node$KeyAttributes": "<p>The key attributes that identify this node, including Type, Name, and Environment information.</p>",
        "RequestBasedServiceLevelIndicatorMetric$KeyAttributes": "<p>This is a string-to-string map that contains information about the type of object that this SLO is related to. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object that this SLO is related to.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "RequestBasedServiceLevelIndicatorMetricConfig$KeyAttributes": "<p>If this SLO is related to a metric collected by Application Signals, you must use this field to specify which service the SLO metric is related to. To do so, you must specify at least the <code>Type</code>, <code>Name</code>, and <code>Environment</code> attributes.</p> <p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "Service$KeyAttributes": "<p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "ServiceDependency$DependencyKeyAttributes": "<p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "ServiceDependent$DependentKeyAttributes": "<p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "ServiceLevelIndicatorMetric$KeyAttributes": "<p>This is a string-to-string map that contains information about the type of object that this SLO is related to. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object that this SLO is related to.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "ServiceLevelIndicatorMetricConfig$KeyAttributes": "<p>If this SLO is related to a metric collected by Application Signals, you must use this field to specify which service the SLO metric is related to. To do so, you must specify at least the <code>Type</code>, <code>Name</code>, and <code>Environment</code> attributes.</p> <p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "ServiceLevelObjectiveSummary$KeyAttributes": "<p>This is a string-to-string map. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this service level objective is for.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>",
        "ServiceState$Service": "<p>The key attributes that identify this service, including Type, Name, and Environment information.</p>",
        "ServiceSummary$KeyAttributes": "<p>This is a string-to-string map that help identify the objects discovered by Application Signals. It can include the following fields.</p> <ul> <li> <p> <code>Type</code> designates the type of object this is.</p> </li> <li> <p> <code>ResourceType</code> specifies the type of the resource. This field is used only when the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Name</code> specifies the name of the object. This is used only if the value of the <code>Type</code> field is <code>Service</code>, <code>RemoteService</code>, or <code>AWS::Service</code>.</p> </li> <li> <p> <code>Identifier</code> identifies the resource objects of this resource. This is used only if the value of the <code>Type</code> field is <code>Resource</code> or <code>AWS::Resource</code>.</p> </li> <li> <p> <code>Environment</code> specifies the location where this object is hosted, or what it belongs to.</p> </li> </ul>"
      }
    },
    "AuditFinding": {
      "base": "<p>A structure that contains information about an audit finding, which represents an automated analysis result about service behavior, performance issues, or potential problems identified through heuristic algorithms.</p>",
      "refs": {
        "AuditFindings$member": null
      }
    },
    "AuditFindings": {
      "base": null,
      "refs": {
        "ListAuditFindingsOutput$AuditFindings": "<p>An array of structures, where each structure contains information about one audit finding, including the auditor results, severity, and associated metric and dependency graphs.</p>"
      }
    },
    "AuditTarget": {
      "base": "<p>A structure that specifies the target entity for audit analysis, such as a <code>service</code>, <code>SLO</code>, <code>service_operation</code>, or <code>canary</code>.</p>",
      "refs": {
        "AuditTargets$member": null
      }
    },
    "AuditTargetEntity": {
      "base": "<p>A union structure that contains the specific entity information for different types of audit targets.</p>",
      "refs": {
        "AuditTarget$Data": "<p>The specific data identifying the audit target entity.</p>"
      }
    },
    "AuditTargets": {
      "base": null,
      "refs": {
        "ListAuditFindingsInput$AuditTargets": "<p>A list of audit targets to filter the findings by. You can specify services, SLOs, or service operations to limit the audit findings to specific entities.</p>"
      }
    },
    "AuditorResult": {
      "base": "<p>A structure that contains the result of an automated audit analysis, including the auditor name, description of findings, additional data, and severity level.</p>",
      "refs": {
        "AuditorResults$member": null
      }
    },
    "AuditorResultDescriptionString": {
      "base": null,
      "refs": {
        "AuditorResult$Description": "<p>A detailed description of the audit finding, explaining what was observed and potential implications.</p>"
      }
    },
    "AuditorResults": {
      "base": null,
      "refs": {
        "AuditFinding$AuditorResults": "<p>An array of auditor results that contain the specific findings, descriptions, and severity levels identified by different auditing algorithms.</p>"
      }
    },
    "Auditors": {
      "base": null,
      "refs": {
        "ListAuditFindingsInput$Auditors": "<p>A list of auditor names to filter the findings by. Only findings generated by the specified auditors will be returned.</p> <p>The following auditors are available for configuration:</p> <ul> <li> <p> <code>slo</code> - SloAuditor: Identifies SLO violations and detects breached thresholds during the Assessment phase.</p> </li> <li> <p> <code>operation_metric</code> - OperationMetricAuditor: Detects anomalies in service operation metrics from Application Signals RED metrics during the Assessment phase</p> <note> <p>Anomaly detection is not supported for sparse metrics (those missing more than 80% of datapoints within the given time period).</p> </note> </li> <li> <p> <code>service_quota</code> - ServiceQuotaAuditor: Monitors resource utilization against service quotas during the Assessment phase</p> </li> <li> <p> <code>trace</code> - TraceAuditor: Performs deep-dive analysis of distributed traces, correlating traces with breached SLOs or abnormal RED metrics during the Analysis phase</p> </li> <li> <p> <code>dependency_metric</code> - CriticalPathAuditor: Analyzes service dependency impacts and maps dependency relationships from Application Signals RED metrics during the Analysis phase</p> </li> <li> <p> <code>top_contributor</code> - TopContributorAuditor: Identifies infrastructure-level contributors to issues by analyzing EMF logs of Application Signals RED metrics during the Analysis phase</p> </li> <li> <p> <code>log</code> - LogAuditor: Extracts insights from application logs, categorizing error types and ranking severity by frequency during the Analysis phase</p> </li> </ul> <note> <p> <code>InitAuditor</code> and <code>Summarizer</code> auditors are not configurable as they are automatically triggered during the audit process.</p> </note>"
      }
    },
    "AwsAccountId": {
      "base": null,
      "refs": {
        "ChangeEvent$AccountId": "<p>The Amazon Web Services account ID where this change event occurred.</p>",
        "ListGroupingAttributeDefinitionsInput$AwsAccountId": "<p>The Amazon Web Services account ID to retrieve grouping attribute definitions for. Use this when accessing grouping configurations from a different account in cross-account monitoring scenarios.</p>",
        "ListServiceLevelObjectivesInput$SloOwnerAwsAccountId": "<p>SLO's Amazon Web Services account ID.</p>",
        "ListServiceStatesInput$AwsAccountId": "<p>The Amazon Web Services account ID to filter service states by. Use this to limit results to services from a specific account.</p>",
        "ListServicesInput$AwsAccountId": "<p>Amazon Web Services Account ID.</p>",
        "MetricReference$AccountId": "<p>Amazon Web Services account ID.</p>"
      }
    },
    "BatchGetServiceLevelObjectiveBudgetReportInput": {
      "base": null,
      "refs": {}
    },
    "BatchGetServiceLevelObjectiveBudgetReportOutput": {
      "base": null,
      "refs": {}
    },
    "BatchUpdateExclusionWindowsError": {
      "base": "<p>An array of structures, where each structure includes an error indicating that one of the requests in the array was not valid.</p>",
      "refs": {
        "BatchUpdateExclusionWindowsErrors$member": null
      }
    },
    "BatchUpdateExclusionWindowsErrors": {
      "base": null,
      "refs": {
        "BatchUpdateExclusionWindowsOutput$Errors": "<p>A list of errors that occurred while processing the request.</p>"
      }
    },
    "BatchUpdateExclusionWindowsInput": {
      "base": null,
      "refs": {}
    },
    "BatchUpdateExclusionWindowsOutput": {
      "base": null,
      "refs": {}
    },
    "Boolean": {
      "base": null,
      "refs": {
        "ListGroupingAttributeDefinitionsInput$IncludeLinkedAccounts": "<p>If you are using this operation in a monitoring account, specify <code>true</code> to include grouping attributes from source accounts in the returned data.</p>",
        "ListServiceLevelObjectivesInput$IncludeLinkedAccounts": "<p>If you are using this operation in a monitoring account, specify <code>true</code> to include SLO from source accounts in the returned data. </p> <p>When you are monitoring an account, you can use Amazon Web Services account ID in <code>KeyAttribute</code> filter for service source account and <code>SloOwnerawsaccountID</code> for SLO source account with <code>IncludeLinkedAccounts</code> to filter the returned data to only a single source account. </p>",
        "ListServiceStatesInput$IncludeLinkedAccounts": "<p>If you are using this operation in a monitoring account, specify <code>true</code> to include service states from source accounts in the returned data.</p>",
        "ListServicesInput$IncludeLinkedAccounts": "<p>If you are using this operation in a monitoring account, specify <code>true</code> to include services from source accounts in the returned data. </p>"
      }
    },
    "BudgetRequestsRemaining": {
      "base": null,
      "refs": {
        "ServiceLevelObjectiveBudgetReport$BudgetRequestsRemaining": "<p>This field is displayed only for request-based SLOs. It displays the number of failed requests that can be tolerated before any more successful requests occur, and still have the application meet its SLO goal.</p> <p>This number can go up and down between different reports, based on both how many successful requests and how many failed requests occur in that time.</p>"
      }
    },
    "BudgetSecondsRemaining": {
      "base": null,
      "refs": {
        "ServiceLevelObjectiveBudgetReport$BudgetSecondsRemaining": "<p>The budget amount remaining before the SLO status becomes <code>BREACHING</code>, at the time specified in the <code>Timestemp</code> parameter of the request. If this value is negative, then the SLO is already in <code>BREACHING</code> status.</p> <p> This field is included only if the SLO is a period-based SLO.</p>"
      }
    },
    "BurnRateConfiguration": {
      "base": "<p>This object defines the length of the look-back window used to calculate one burn rate metric for this SLO. The burn rate measures how fast the service is consuming the error budget, relative to the attainment goal of the SLO. A burn rate of exactly 1 indicates that the SLO goal will be met exactly.</p> <p>For example, if you specify 60 as the number of minutes in the look-back window, the burn rate is calculated as the following:</p> <p> <i>burn rate = error rate over the look-back window / (100% - attainment goal percentage)</i> </p> <p>For more information about burn rates, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/CloudWatch-ServiceLevelObjectives.html#CloudWatch-ServiceLevelObjectives-burn\">Calculate burn rates</a>.</p>",
      "refs": {
        "BurnRateConfigurations$member": null
      }
    },
    "BurnRateConfigurations": {
      "base": null,
      "refs": {
        "CreateServiceLevelObjectiveInput$BurnRateConfigurations": "<p>Use this array to create <i>burn rates</i> for this SLO. Each burn rate is a metric that indicates how fast the service is consuming the error budget, relative to the attainment goal of the SLO.</p>",
        "ServiceLevelObjective$BurnRateConfigurations": "<p>Each object in this array defines the length of the look-back window used to calculate one burn rate metric for this SLO. The burn rate measures how fast the service is consuming the error budget, relative to the attainment goal of the SLO.</p>",
        "UpdateServiceLevelObjectiveInput$BurnRateConfigurations": "<p>Use this array to create <i>burn rates</i> for this SLO. Each burn rate is a metric that indicates how fast the service is consuming the error budget, relative to the attainment goal of the SLO.</p>"
      }
    },
    "BurnRateLookBackWindowMinutes": {
      "base": null,
      "refs": {
        "BurnRateConfiguration$LookBackWindowMinutes": "<p>The number of minutes to use as the look-back window.</p>"
      }
    },
    "CalendarInterval": {
      "base": "<p>If the interval for this service level objective is a calendar interval, this structure contains the interval specifications.</p>",
      "refs": {
        "Interval$CalendarInterval": "<p>If the interval is a calendar interval, this structure contains the interval specifications.</p>"
      }
    },
    "CalendarIntervalDuration": {
      "base": null,
      "refs": {
        "CalendarInterval$Duration": "<p>Specifies the duration of each calendar interval. For example, if <code>Duration</code> is <code>1</code> and <code>DurationUnit</code> is <code>MONTH</code>, each interval is one month, aligned with the calendar.</p>"
      }
    },
    "CanaryEntity": {
      "base": "<p>A structure that contains identifying information for a CloudWatch Synthetics canary entity used in audit targeting.</p>",
      "refs": {
        "AuditTargetEntity$Canary": "<p>Canary entity information when the audit target is a CloudWatch Synthetics canary.</p>"
      }
    },
    "ChangeEvent": {
      "base": "<p>A structure that contains information about a change event that occurred for a service, such as a deployment or configuration change.</p>",
      "refs": {
        "ChangeEvents$member": null,
        "LatestChangeEvents$member": null
      }
    },
    "ChangeEventType": {
      "base": null,
      "refs": {
        "ChangeEvent$ChangeEventType": "<p>The type of change event that occurred, such as <code>DEPLOYMENT</code>.</p>"
      }
    },
    "ChangeEvents": {
      "base": null,
      "refs": {
        "ListEntityEventsOutput$ChangeEvents": "<p>An array of structures, where each structure contains information about one change event that occurred for the specified entity during the requested time period.</p>"
      }
    },
    "ConflictException": {
      "base": "<p>This operation attempted to create a resource that already exists.</p>",
      "refs": {}
    },
    "ConnectionType": {
      "base": null,
      "refs": {
        "Edge$ConnectionType": "<p>The type of connection between the nodes, indicating the nature of the relationship.</p>"
      }
    },
    "CreateServiceLevelObjectiveInput": {
      "base": null,
      "refs": {}
    },
    "CreateServiceLevelObjectiveOutput": {
      "base": null,
      "refs": {}
    },
    "DataMap": {
      "base": null,
      "refs": {
        "AuditorResult$Data": "<p>This is a string-to-string map. It contains additional data about the result of an automated audit analysis.</p>"
      }
    },
    "DeleteGroupingConfigurationOutput": {
      "base": null,
      "refs": {}
    },
    "DeleteServiceLevelObjectiveInput": {
      "base": null,
      "refs": {}
    },
    "DeleteServiceLevelObjectiveOutput": {
      "base": null,
      "refs": {}
    },
    "DependencyConfig": {
      "base": "<p>Identifies the dependency using the <code>DependencyKeyAttributes</code> and <code>DependencyOperationName</code>.</p> <p>When creating a service dependency SLO, you must specify the <code>KeyAttributes</code> of the service, and the <code>DependencyConfig</code> for the dependency. You can specify the <code>OperationName</code> of the service, from which it calls the dependency. Alternatively, you can exclude <code>OperationName</code> and the SLO will monitor all of the service's operations that call the dependency.</p>",
      "refs": {
        "ListServiceLevelObjectivesInput$DependencyConfig": "<p>Identifies the dependency using the <code>DependencyKeyAttributes</code> and <code>DependencyOperationName</code>. </p>",
        "RequestBasedServiceLevelIndicatorMetric$DependencyConfig": "<p>Identifies the dependency using the <code>DependencyKeyAttributes</code> and <code>DependencyOperationName</code>. </p>",
        "RequestBasedServiceLevelIndicatorMetricConfig$DependencyConfig": "<p>Identifies the dependency using the <code>DependencyKeyAttributes</code> and <code>DependencyOperationName</code>. </p>",
        "ServiceLevelIndicatorMetric$DependencyConfig": "<p>Identifies the dependency using the <code>DependencyKeyAttributes</code> and <code>DependencyOperationName</code>. </p>",
        "ServiceLevelIndicatorMetricConfig$DependencyConfig": "<p>Identifies the dependency using the <code>DependencyKeyAttributes</code> and <code>DependencyOperationName</code>. </p>",
        "ServiceLevelObjectiveSummary$DependencyConfig": "<p>Identifies the dependency using the <code>DependencyKeyAttributes</code> and <code>DependencyOperationName</code>. </p>"
      }
    },
    "DependencyGraph": {
      "base": "<p>A structure that represents the dependency relationships relevant to an audit finding, containing nodes and edges that show how services and resources are connected.</p>",
      "refs": {
        "AuditFinding$DependencyGraph": "<p>A structure containing nodes and edges that represent the dependency relationships relevant to this audit finding, helping to understand the context and potential impact.</p>"
      }
    },
    "DetailLevel": {
      "base": null,
      "refs": {
        "ListAuditFindingsInput$DetailLevel": "<p>The level of details of the audit findings. Supported values: <code>BRIEF</code>, <code>DETAILED</code>.</p>"
      }
    },
    "Dimension": {
      "base": "<p>A dimension is a name/value pair that is part of the identity of a metric. Because dimensions are part of the unique identifier for a metric, whenever you add a unique name/value pair to one of your metrics, you are creating a new variation of that metric. For example, many Amazon EC2 metrics publish <code>InstanceId</code> as a dimension name, and the actual instance ID as the value for that dimension.</p> <p>You can assign up to 30 dimensions to a metric.</p>",
      "refs": {
        "Dimensions$member": null
      }
    },
    "DimensionName": {
      "base": null,
      "refs": {
        "Dimension$Name": "<p>The name of the dimension. Dimension names must contain only ASCII characters, must include at least one non-whitespace character, and cannot start with a colon (<code>:</code>). ASCII control characters are not supported as part of dimension names.</p>"
      }
    },
    "DimensionValue": {
      "base": null,
      "refs": {
        "Dimension$Value": "<p>The value of the dimension. Dimension values must contain only ASCII characters and must include at least one non-whitespace character. ASCII control characters are not supported as part of dimension values.</p>"
      }
    },
    "Dimensions": {
      "base": null,
      "refs": {
        "Metric$Dimensions": "<p>An array of one or more dimensions to use to define the metric that you want to use. For more information, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/cloudwatch_concepts.html#Dimension\">Dimensions</a>.</p>",
        "MetricReference$Dimensions": "<p>An array of one or more dimensions that further define the metric. For more information, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/cloudwatch_concepts.html#Dimension\">CloudWatchDimensions</a>.</p>"
      }
    },
    "Double": {
      "base": null,
      "refs": {
        "Edge$Duration": "<p>The duration or latency associated with this connection, if applicable.</p>",
        "Node$Duration": "<p>The duration or processing time associated with this node, if applicable.</p>"
      }
    },
    "DurationUnit": {
      "base": null,
      "refs": {
        "CalendarInterval$DurationUnit": "<p>Specifies the calendar interval unit.</p>",
        "RollingInterval$DurationUnit": "<p>Specifies the rolling interval unit.</p>",
        "Window$DurationUnit": "<p>The unit of time for the exclusion window duration. Valid values: MINUTE, HOUR, DAY, MONTH.</p>"
      }
    },
    "Edge": {
      "base": "<p>A structure that represents a connection between two nodes in a dependency graph, showing the relationship and characteristics of the connection.</p>",
      "refs": {
        "Edges$member": null
      }
    },
    "Edges": {
      "base": null,
      "refs": {
        "DependencyGraph$Edges": "<p>An array of edges representing the connections and relationships between the nodes in the dependency graph.</p>"
      }
    },
    "EvaluationType": {
      "base": null,
      "refs": {
        "ServiceLevelObjective$EvaluationType": "<p>Displays whether this is a period-based SLO or a request-based SLO.</p>",
        "ServiceLevelObjectiveBudgetReport$EvaluationType": "<p>Displays whether this budget report is for a period-based SLO or a request-based SLO.</p>",
        "ServiceLevelObjectiveSummary$EvaluationType": "<p>Displays whether this is a period-based SLO or a request-based SLO.</p>"
      }
    },
    "ExclusionDuration": {
      "base": null,
      "refs": {
        "Window$Duration": "<p>The number of time units for the exclusion window length.</p>"
      }
    },
    "ExclusionReason": {
      "base": null,
      "refs": {
        "ExclusionWindow$Reason": "<p>A description explaining why this time period should be excluded from SLO calculations.</p>"
      }
    },
    "ExclusionWindow": {
      "base": "<p>The core SLO time window exclusion object that includes Window, StartTime, RecurrenceRule, and Reason.</p>",
      "refs": {
        "ExclusionWindows$member": null
      }
    },
    "ExclusionWindowErrorCode": {
      "base": null,
      "refs": {
        "BatchUpdateExclusionWindowsError$ErrorCode": "<p>The error code.</p>"
      }
    },
    "ExclusionWindowErrorMessage": {
      "base": null,
      "refs": {
        "BatchUpdateExclusionWindowsError$ErrorMessage": "<p>The error message.</p>"
      }
    },
    "ExclusionWindows": {
      "base": null,
      "refs": {
        "BatchUpdateExclusionWindowsInput$AddExclusionWindows": "<p>A list of exclusion windows to add to the specified SLOs. You can add up to 10 exclusion windows per SLO.</p>",
        "BatchUpdateExclusionWindowsInput$RemoveExclusionWindows": "<p>A list of exclusion windows to remove from the specified SLOs. The window configuration must match an existing exclusion window.</p>",
        "ListServiceLevelObjectiveExclusionWindowsOutput$ExclusionWindows": "<p>A list of exclusion windows configured for the SLO.</p>"
      }
    },
    "Expression": {
      "base": null,
      "refs": {
        "RecurrenceRule$Expression": "<p>A cron or rate expression that specifies the schedule for the exclusion window.</p>"
      }
    },
    "FaultDescription": {
      "base": null,
      "refs": {
        "ResourceNotFoundException$Message": null
      }
    },
    "GetServiceInput": {
      "base": null,
      "refs": {}
    },
    "GetServiceLevelObjectiveInput": {
      "base": null,
      "refs": {}
    },
    "GetServiceLevelObjectiveOutput": {
      "base": null,
      "refs": {}
    },
    "GetServiceOutput": {
      "base": null,
      "refs": {}
    },
    "Goal": {
      "base": "<p>This structure contains the attributes that determine the goal of an SLO. This includes the time period for evaluation and the attainment threshold.</p>",
      "refs": {
        "CreateServiceLevelObjectiveInput$Goal": "<p>This structure contains the attributes that determine the goal of the SLO.</p>",
        "ServiceLevelObjective$Goal": null,
        "ServiceLevelObjectiveBudgetReport$Goal": null,
        "UpdateServiceLevelObjectiveInput$Goal": "<p>A structure that contains the attributes that determine the goal of the SLO. This includes the time period for evaluation and the attainment threshold.</p>"
      }
    },
    "GroupIdentifier": {
      "base": null,
      "refs": {
        "ServiceGroup$GroupIdentifier": "<p>A unique identifier for this grouping attribute value, used for filtering and API operations.</p>"
      }
    },
    "GroupName": {
      "base": null,
      "refs": {
        "ServiceGroup$GroupName": "<p>The name of the grouping attribute, such as <code>BusinessUnit</code> or <code>Environment</code>.</p>"
      }
    },
    "GroupSource": {
      "base": null,
      "refs": {
        "ServiceGroup$GroupSource": "<p>The source of the grouping attribute, such as <code>TAG</code>, <code>OTEL</code>, or <code>DEFAULT</code>.</p>"
      }
    },
    "GroupValue": {
      "base": null,
      "refs": {
        "ServiceGroup$GroupValue": "<p>The value of the grouping attribute for this service, such as <code>Payments</code> or <code>Production</code>.</p>"
      }
    },
    "GroupingAttributeDefinition": {
      "base": "<p>A structure that defines how services should be grouped based on specific attributes. This includes the friendly name for the grouping, the source keys to derive values from, and an optional default value.</p>",
      "refs": {
        "GroupingAttributeDefinitions$member": null
      }
    },
    "GroupingAttributeDefinitions": {
      "base": null,
      "refs": {
        "GroupingConfiguration$GroupingAttributeDefinitions": "<p>An array of grouping attribute definitions that specify how services should be grouped based on various attributes and source keys.</p>",
        "ListGroupingAttributeDefinitionsOutput$GroupingAttributeDefinitions": "<p>An array of structures, where each structure contains information about one grouping attribute definition, including the grouping name, source keys, and default values.</p>",
        "PutGroupingConfigurationInput$GroupingAttributeDefinitions": "<p>An array of grouping attribute definitions that specify how services should be grouped. Each definition includes a friendly name, source keys to derive the grouping value from, and an optional default value.</p>"
      }
    },
    "GroupingConfiguration": {
      "base": "<p>A structure that contains the complete grouping configuration for an account, including all defined grouping attributes and metadata about when it was last updated.</p>",
      "refs": {
        "PutGroupingConfigurationOutput$GroupingConfiguration": "<p>A structure containing the updated grouping configuration, including all grouping attribute definitions and the timestamp when it was last updated.</p>"
      }
    },
    "GroupingSourceKeyStringList": {
      "base": null,
      "refs": {
        "GroupingAttributeDefinition$GroupingSourceKeys": "<p>An array of source keys used to derive the grouping attribute value from telemetry data, Amazon Web Services tags, or other sources. For example, [\"business_unit\", \"team\"] would look for values in those fields.</p>"
      }
    },
    "GroupingString": {
      "base": null,
      "refs": {
        "GroupingAttributeDefinition$GroupingName": "<p>The friendly name for this grouping attribute, such as <code>BusinessUnit</code> or <code>Environment</code>. This name is used to identify the grouping in the console and APIs.</p>",
        "GroupingAttributeDefinition$DefaultGroupingValue": "<p>The default value to use for this grouping attribute when no value can be derived from the source keys. This ensures all services have a grouping value even if the source data is missing.</p>",
        "GroupingSourceKeyStringList$member": null
      }
    },
    "Interval": {
      "base": "<p>The time period used to evaluate the SLO. It can be either a calendar interval or rolling interval.</p>",
      "refs": {
        "Goal$Interval": "<p>The time period used to evaluate the SLO. It can be either a calendar interval or rolling interval.</p> <p>If you omit this parameter, a rolling interval of 7 days is used.</p>"
      }
    },
    "KeyAttributeName": {
      "base": null,
      "refs": {
        "Attributes$key": null
      }
    },
    "KeyAttributeValue": {
      "base": null,
      "refs": {
        "Attributes$value": null
      }
    },
    "LatestChangeEvents": {
      "base": null,
      "refs": {
        "ServiceState$LatestChangeEvents": "<p>An array containing the most recent change events for this service, such as deployments, with information about when they occurred and who initiated them.</p>"
      }
    },
    "ListAuditFindingMaxResults": {
      "base": null,
      "refs": {
        "ListAuditFindingsInput$MaxResults": "<p>The maximum number of audit findings to return in one operation. If you omit this parameter, the default of 10 is used.</p>"
      }
    },
    "ListAuditFindingsInput": {
      "base": null,
      "refs": {}
    },
    "ListAuditFindingsOutput": {
      "base": null,
      "refs": {}
    },
    "ListEntityEventsInput": {
      "base": null,
      "refs": {}
    },
    "ListEntityEventsMaxResults": {
      "base": null,
      "refs": {
        "ListEntityEventsInput$MaxResults": "<p>The maximum number of change events to return in one operation. If you omit this parameter, the default of 50 is used.</p>"
      }
    },
    "ListEntityEventsOutput": {
      "base": null,
      "refs": {}
    },
    "ListGroupingAttributeDefinitionsInput": {
      "base": null,
      "refs": {}
    },
    "ListGroupingAttributeDefinitionsOutput": {
      "base": null,
      "refs": {}
    },
    "ListServiceDependenciesInput": {
      "base": null,
      "refs": {}
    },
    "ListServiceDependenciesMaxResults": {
      "base": null,
      "refs": {
        "ListServiceDependenciesInput$MaxResults": "<p>The maximum number of results to return in one operation. If you omit this parameter, the default of 50 is used.</p>"
      }
    },
    "ListServiceDependenciesOutput": {
      "base": null,
      "refs": {}
    },
    "ListServiceDependentsInput": {
      "base": null,
      "refs": {}
    },
    "ListServiceDependentsMaxResults": {
      "base": null,
      "refs": {
        "ListServiceDependentsInput$MaxResults": "<p>The maximum number of results to return in one operation. If you omit this parameter, the default of 50 is used.</p>"
      }
    },
    "ListServiceDependentsOutput": {
      "base": null,
      "refs": {}
    },
    "ListServiceLevelObjectiveExclusionWindowsInput": {
      "base": null,
      "refs": {}
    },
    "ListServiceLevelObjectiveExclusionWindowsMaxResults": {
      "base": null,
      "refs": {
        "ListServiceLevelObjectiveExclusionWindowsInput$MaxResults": "<p>The maximum number of results to return in one operation. If you omit this parameter, the default of 50 is used. </p>"
      }
    },
    "ListServiceLevelObjectiveExclusionWindowsOutput": {
      "base": null,
      "refs": {}
    },
    "ListServiceLevelObjectivesInput": {
      "base": null,
      "refs": {}
    },
    "ListServiceLevelObjectivesMaxResults": {
      "base": null,
      "refs": {
        "ListServiceLevelObjectivesInput$MaxResults": "<p>The maximum number of results to return in one operation. If you omit this parameter, the default of 50 is used.</p>"
      }
    },
    "ListServiceLevelObjectivesOutput": {
      "base": null,
      "refs": {}
    },
    "ListServiceOperationMaxResults": {
      "base": null,
      "refs": {
        "ListServiceOperationsInput$MaxResults": "<p>The maximum number of results to return in one operation. If you omit this parameter, the default of 50 is used.</p>"
      }
    },
    "ListServiceOperationsInput": {
      "base": null,
      "refs": {}
    },
    "ListServiceOperationsOutput": {
      "base": null,
      "refs": {}
    },
    "ListServiceStatesInput": {
      "base": null,
      "refs": {}
    },
    "ListServiceStatesMaxResults": {
      "base": null,
      "refs": {
        "ListServiceStatesInput$MaxResults": "<p>The maximum number of service states to return in one operation. If you omit this parameter, the default of 20 is used.</p>"
      }
    },
    "ListServiceStatesOutput": {
      "base": null,
      "refs": {}
    },
    "ListServicesInput": {
      "base": null,
      "refs": {}
    },
    "ListServicesMaxResults": {
      "base": null,
      "refs": {
        "ListServicesInput$MaxResults": "<p> The maximum number of results to return in one operation. If you omit this parameter, the default of 50 is used. </p>"
      }
    },
    "ListServicesOutput": {
      "base": null,
      "refs": {}
    },
    "ListTagsForResourceRequest": {
      "base": null,
      "refs": {}
    },
    "ListTagsForResourceResponse": {
      "base": null,
      "refs": {}
    },
    "LogGroupReferences": {
      "base": null,
      "refs": {
        "GetServiceOutput$LogGroupReferences": "<p>An array of string-to-string maps that each contain information about one log group associated with this service. Each string-to-string map includes the following fields:</p> <ul> <li> <p> <code>\"Type\": \"AWS::Resource\"</code> </p> </li> <li> <p> <code>\"ResourceType\": \"AWS::Logs::LogGroup\"</code> </p> </li> <li> <p> <code>\"Identifier\": \"<i>name-of-log-group</i>\"</code> </p> </li> </ul>",
        "Service$LogGroupReferences": "<p>An array of string-to-string maps that each contain information about one log group associated with this service. Each string-to-string map includes the following fields:</p> <ul> <li> <p> <code>\"Type\": \"AWS::Resource\"</code> </p> </li> <li> <p> <code>\"ResourceType\": \"AWS::Logs::LogGroup\"</code> </p> </li> <li> <p> <code>\"Identifier\": \"<i>name-of-log-group</i>\"</code> </p> </li> </ul>"
      }
    },
    "Metric": {
      "base": "<p>This structure defines the metric used for a service level indicator, including the metric name, namespace, and dimensions</p>",
      "refs": {
        "MetricStat$Metric": "<p>The metric to use as the service level indicator, including the metric name, namespace, and dimensions.</p>"
      }
    },
    "MetricDataQueries": {
      "base": null,
      "refs": {
        "MetricGraph$MetricDataQueries": "<p>An array of metric data queries that define the metrics to be retrieved and analyzed as part of the audit finding context.</p>",
        "MonitoredRequestCountMetricDataQueries$GoodCountMetric": "<p>If you want to count \"good requests\" to determine the percentage of successful requests for this request-based SLO, specify the metric to use as \"good requests\" in this structure.</p>",
        "MonitoredRequestCountMetricDataQueries$BadCountMetric": "<p>If you want to count \"bad requests\" to determine the percentage of successful requests for this request-based SLO, specify the metric to use as \"bad requests\" in this structure.</p>",
        "RequestBasedServiceLevelIndicatorMetric$TotalRequestCountMetric": "<p>This structure defines the metric that is used as the \"total requests\" number for a request-based SLO. The number observed for this metric is divided by the number of \"good requests\" or \"bad requests\" that is observed for the metric defined in <code>MonitoredRequestCountMetric</code>.</p>",
        "RequestBasedServiceLevelIndicatorMetricConfig$TotalRequestCountMetric": "<p>Use this structure to define the metric that you want to use as the \"total requests\" number for a request-based SLO. This result will be divided by the \"good request\" or \"bad request\" value defined in <code>MonitoredRequestCountMetric</code>.</p>",
        "ServiceLevelIndicatorMetric$MetricDataQueries": "<p>If this SLO monitors a CloudWatch metric or the result of a CloudWatch metric math expression, this structure includes the information about that metric or expression. </p>",
        "ServiceLevelIndicatorMetricConfig$MetricDataQueries": "<p>If this SLO monitors a CloudWatch metric or the result of a CloudWatch metric math expression, use this structure to specify that metric or expression. </p>"
      }
    },
    "MetricDataQuery": {
      "base": "<p>Use this structure to define a metric or metric math expression that you want to use as for a service level objective. </p> <p>Each <code>MetricDataQuery</code> in the <code>MetricDataQueries</code> array specifies either a metric to retrieve, or a metric math expression to be performed on retrieved metrics. A single <code>MetricDataQueries</code> array can include as many as 20 <code>MetricDataQuery</code> structures in the array. The 20 structures can include as many as 10 structures that contain a <code>MetricStat</code> parameter to retrieve a metric, and as many as 10 structures that contain the <code>Expression</code> parameter to perform a math expression. Of those <code>Expression</code> structures, exactly one must have true as the value for <code>ReturnData</code>. The result of this expression used for the SLO.</p> <p>For more information about metric math expressions, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/using-metric-math.html\">CloudWatchUse metric math</a>.</p> <p>Within each <code>MetricDataQuery</code> object, you must specify either <code>Expression</code> or <code>MetricStat</code> but not both.</p>",
      "refs": {
        "MetricDataQueries$member": null
      }
    },
    "MetricExpression": {
      "base": null,
      "refs": {
        "MetricDataQuery$Expression": "<p>This field can contain a metric math expression to be performed on the other metrics that you are retrieving within this <code>MetricDataQueries</code> structure. </p> <p>A math expression can use the <code>Id</code> of the other metrics or queries to refer to those metrics, and can also use the <code>Id</code> of other expressions to use the result of those expressions. For more information about metric math expressions, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/using-metric-math.html#metric-math-syntax\">Metric Math Syntax and Functions</a> in the <i>Amazon CloudWatch User Guide</i>.</p> <p>Within each <code>MetricDataQuery</code> object, you must specify either <code>Expression</code> or <code>MetricStat</code> but not both.</p>"
      }
    },
    "MetricGraph": {
      "base": "<p>A structure that contains metric data queries and time range information that provides context for audit findings through relevant performance metrics.</p>",
      "refs": {
        "AuditFinding$MetricGraph": "<p>A structure containing metric data queries and time range information that provides context for the audit finding through relevant performance metrics.</p>"
      }
    },
    "MetricId": {
      "base": null,
      "refs": {
        "MetricDataQuery$Id": "<p>A short name used to tie this object to the results in the response. This <code>Id</code> must be unique within a <code>MetricDataQueries</code> array. If you are performing math expressions on this set of data, this name represents that data and can serve as a variable in the metric math expression. The valid characters are letters, numbers, and underscore. The first character must be a lowercase letter.</p>"
      }
    },
    "MetricLabel": {
      "base": null,
      "refs": {
        "MetricDataQuery$Label": "<p>A human-readable label for this metric or expression. This is especially useful if this is an expression, so that you know what the value represents. If the metric or expression is shown in a CloudWatch dashboard widget, the label is shown. If <code>Label</code> is omitted, CloudWatch generates a default.</p> <p>You can put dynamic expressions into a label, so that it is more descriptive. For more information, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/graph-dynamic-labels.html\">Using Dynamic Labels</a>.</p>"
      }
    },
    "MetricName": {
      "base": null,
      "refs": {
        "Metric$MetricName": "<p>The name of the metric to use.</p>",
        "MetricReference$MetricName": "<p>The name of the metric.</p>",
        "ServiceLevelIndicatorMetricConfig$MetricName": "<p>The name of the CloudWatch metric to use for the SLO, when using a custom metric rather than Application Signals standard metrics.</p>"
      }
    },
    "MetricReference": {
      "base": "<p>This structure contains information about one CloudWatch metric associated with this entity discovered by Application Signals.</p>",
      "refs": {
        "MetricReferences$member": null
      }
    },
    "MetricReferences": {
      "base": null,
      "refs": {
        "Service$MetricReferences": "<p>An array of structures that each contain information about one metric associated with this service.</p>",
        "ServiceDependency$MetricReferences": "<p>An array of structures that each contain information about one metric associated with this service dependency that was discovered by Application Signals.</p>",
        "ServiceDependent$MetricReferences": "<p>An array of structures that each contain information about one metric associated with this service dependent that was discovered by Application Signals.</p>",
        "ServiceOperation$MetricReferences": "<p>An array of structures that each contain information about one metric associated with this service operation that was discovered by Application Signals.</p>",
        "ServiceSummary$MetricReferences": "<p>An array of structures that each contain information about one metric associated with this service.</p>"
      }
    },
    "MetricSourceType": {
      "base": null,
      "refs": {
        "MetricSourceTypes$member": null,
        "ServiceLevelObjective$MetricSourceType": "<p>Displays the SLI metric source type for this SLO. Supported types are:</p> <ul> <li> <p>Service operation</p> </li> <li> <p>Service dependency</p> </li> <li> <p>CloudWatch metric</p> </li> </ul>",
        "ServiceLevelObjectiveSummary$MetricSourceType": "<p>Displays the SLI metric source type for this SLO. Supported types are:</p> <ul> <li> <p>Service operation</p> </li> <li> <p>Service dependency</p> </li> <li> <p>CloudWatch metric</p> </li> </ul>"
      }
    },
    "MetricSourceTypes": {
      "base": null,
      "refs": {
        "ListServiceLevelObjectivesInput$MetricSourceTypes": "<p>Use this optional field to only include SLOs with the specified metric source types in the output. Supported types are:</p> <ul> <li> <p>Service operation</p> </li> <li> <p>Service dependency</p> </li> <li> <p>CloudWatch metric</p> </li> </ul>"
      }
    },
    "MetricStat": {
      "base": "<p>This structure defines the metric to be used as the service level indicator, along with the statistics, period, and unit.</p>",
      "refs": {
        "MetricDataQuery$MetricStat": "<p>A metric to be used directly for the SLO, or to be used in the math expression that will be used for the SLO.</p> <p>Within one <code>MetricDataQuery</code> object, you must specify either <code>Expression</code> or <code>MetricStat</code> but not both.</p>"
      }
    },
    "MetricType": {
      "base": null,
      "refs": {
        "MetricReference$MetricType": "<p>Used to display the appropriate statistics in the CloudWatch console.</p>"
      }
    },
    "MonitoredRequestCountMetricDataQueries": {
      "base": "<p>This structure defines the metric that is used as the \"good request\" or \"bad request\" value for a request-based SLO. This value observed for the metric defined in <code>TotalRequestCountMetric</code> is divided by the number found for <code>MonitoredRequestCountMetric</code> to determine the percentage of successful requests that this SLO tracks.</p>",
      "refs": {
        "RequestBasedServiceLevelIndicatorMetric$MonitoredRequestCountMetric": "<p>This structure defines the metric that is used as the \"good request\" or \"bad request\" value for a request-based SLO. This value observed for the metric defined in <code>TotalRequestCountMetric</code> is divided by the number found for <code>MonitoredRequestCountMetric</code> to determine the percentage of successful requests that this SLO tracks.</p>",
        "RequestBasedServiceLevelIndicatorMetricConfig$MonitoredRequestCountMetric": "<p>Use this structure to define the metric that you want to use as the \"good request\" or \"bad request\" value for a request-based SLO. This value observed for the metric defined in <code>TotalRequestCountMetric</code> will be divided by the number found for <code>MonitoredRequestCountMetric</code> to determine the percentage of successful requests that this SLO tracks.</p>"
      }
    },
    "Namespace": {
      "base": null,
      "refs": {
        "Metric$Namespace": "<p>The namespace of the metric. For more information, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/cloudwatch_concepts.html#Namespace\">Namespaces</a>.</p>",
        "MetricReference$Namespace": "<p>The namespace of the metric. For more information, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/cloudwatch_concepts.html#Namespace\">CloudWatchNamespaces</a>.</p>"
      }
    },
    "NextToken": {
      "base": null,
      "refs": {
        "ListAuditFindingsInput$NextToken": "<p>Include this value, if it was returned by the previous operation, to get the next set of audit findings.</p>",
        "ListAuditFindingsOutput$NextToken": "<p>Include this value in your next use of this API to get the next set of audit findings.</p>",
        "ListEntityEventsInput$NextToken": "<p>Include this value, if it was returned by the previous operation, to get the next set of change events.</p>",
        "ListEntityEventsOutput$NextToken": "<p>Include this value in your next use of this API to get the next set of change events.</p>",
        "ListGroupingAttributeDefinitionsInput$NextToken": "<p>Include this value, if it was returned by the previous operation, to get the next set of grouping attribute definitions.</p>",
        "ListGroupingAttributeDefinitionsOutput$NextToken": "<p>Include this value in your next use of this API to get the next set of grouping attribute definitions.</p>",
        "ListServiceDependenciesInput$NextToken": "<p>Include this value, if it was returned by the previous operation, to get the next set of service dependencies.</p>",
        "ListServiceDependenciesOutput$NextToken": "<p>Include this value in your next use of this API to get next set of service dependencies.</p>",
        "ListServiceDependentsInput$NextToken": "<p>Include this value, if it was returned by the previous operation, to get the next set of service dependents.</p>",
        "ListServiceDependentsOutput$NextToken": "<p>Include this value in your next use of this API to get next set of service dependents.</p>",
        "ListServiceLevelObjectiveExclusionWindowsInput$NextToken": "<p>Include this value, if it was returned by the previous operation, to get the next set of service level objectives. </p>",
        "ListServiceLevelObjectiveExclusionWindowsOutput$NextToken": "<p>Include this value, if it was returned by the previous operation, to get the next set of service level objectives. </p>",
        "ListServiceLevelObjectivesInput$NextToken": "<p>Include this value, if it was returned by the previous operation, to get the next set of service level objectives.</p>",
        "ListServiceLevelObjectivesOutput$NextToken": "<p>Include this value in your next use of this API to get next set of service level objectives.</p>",
        "ListServiceOperationsInput$NextToken": "<p>Include this value, if it was returned by the previous operation, to get the next set of service operations.</p>",
        "ListServiceOperationsOutput$NextToken": "<p>Include this value in your next use of this API to get next set of service operations.</p>",
        "ListServiceStatesInput$NextToken": "<p>Include this value, if it was returned by the previous operation, to get the next set of service states.</p>",
        "ListServiceStatesOutput$NextToken": "<p>Include this value in your next use of this API to get the next set of service states.</p>",
        "ListServicesInput$NextToken": "<p>Include this value, if it was returned by the previous operation, to get the next set of services.</p>",
        "ListServicesOutput$NextToken": "<p>Include this value in your next use of this API to get next set of services.</p>"
      }
    },
    "Node": {
      "base": "<p>A structure that represents a node in a dependency graph, containing information about a service, resource, or other entity and its characteristics.</p>",
      "refs": {
        "Nodes$member": null
      }
    },
    "Nodes": {
      "base": null,
      "refs": {
        "DependencyGraph$Nodes": "<p>An array of nodes representing the services, resources, or other entities in the dependency graph.</p>"
      }
    },
    "OperationName": {
      "base": null,
      "refs": {
        "DependencyConfig$DependencyOperationName": "<p>The name of the called operation in the dependency.</p>",
        "ListServiceLevelObjectivesInput$OperationName": "<p>The name of the operation that this SLO is associated with.</p>",
        "RequestBasedServiceLevelIndicatorMetric$OperationName": "<p>If the SLO monitors a specific operation of the service, this field displays that operation name.</p>",
        "RequestBasedServiceLevelIndicatorMetricConfig$OperationName": "<p>If the SLO is to monitor a specific operation of the service, use this field to specify the name of that operation.</p>",
        "ServiceDependency$OperationName": "<p>The name of the operation in this service that calls the dependency.</p>",
        "ServiceDependency$DependencyOperationName": "<p>The name of the called operation in the dependency.</p>",
        "ServiceDependent$OperationName": "<p>If the invoked entity is an operation on an entity, the name of that dependent operation is displayed here.</p>",
        "ServiceDependent$DependentOperationName": "<p>If the dependent invoker was a service that invoked it from an operation, the name of that dependent operation is displayed here.</p>",
        "ServiceLevelIndicatorMetric$OperationName": "<p>If the SLO monitors a specific operation of the service, this field displays that operation name.</p>",
        "ServiceLevelIndicatorMetricConfig$OperationName": "<p>If the SLO is to monitor a specific operation of the service, use this field to specify the name of that operation.</p>",
        "ServiceLevelObjectiveSummary$OperationName": "<p>If this service level objective is specific to a single operation, this field displays the name of that operation.</p>",
        "ServiceOperation$Name": "<p>The name of the operation, discovered by Application Signals.</p>"
      }
    },
    "Period": {
      "base": null,
      "refs": {
        "MetricDataQuery$Period": "<p>The granularity, in seconds, of the returned data points for this metric. For metrics with regular resolution, a period can be as short as one minute (60 seconds) and must be a multiple of 60. For high-resolution metrics that are collected at intervals of less than one minute, the period can be 1, 5, 10, 30, 60, or any multiple of 60. High-resolution metrics are those metrics stored by a <code>PutMetricData</code> call that includes a <code>StorageResolution</code> of 1 second.</p> <p>If the <code>StartTime</code> parameter specifies a time stamp that is greater than 3 hours ago, you must specify the period as follows or no data points in that time range is returned:</p> <ul> <li> <p>Start time between 3 hours and 15 days ago - Use a multiple of 60 seconds (1 minute).</p> </li> <li> <p>Start time between 15 and 63 days ago - Use a multiple of 300 seconds (5 minutes).</p> </li> <li> <p>Start time greater than 63 days ago - Use a multiple of 3600 seconds (1 hour).</p> </li> </ul>",
        "MetricStat$Period": "<p>The granularity, in seconds, to be used for the metric. For metrics with regular resolution, a period can be as short as one minute (60 seconds) and must be a multiple of 60. For high-resolution metrics that are collected at intervals of less than one minute, the period can be 1, 5, 10, 30, 60, or any multiple of 60. High-resolution metrics are those metrics stored by a <code>PutMetricData</code> call that includes a <code>StorageResolution</code> of 1 second.</p>"
      }
    },
    "PutGroupingConfigurationInput": {
      "base": null,
      "refs": {}
    },
    "PutGroupingConfigurationOutput": {
      "base": null,
      "refs": {}
    },
    "RecurrenceRule": {
      "base": "<p>The recurrence rule for the SLO time window exclusion .</p>",
      "refs": {
        "ExclusionWindow$RecurrenceRule": "<p>The recurrence rule for the SLO time window exclusion. Supports both cron and rate expressions.</p>"
      }
    },
    "RequestBasedServiceLevelIndicator": {
      "base": "<p>This structure contains information about the performance metric that a request-based SLO monitors.</p>",
      "refs": {
        "ServiceLevelObjective$RequestBasedSli": "<p>A structure containing information about the performance metric that this SLO monitors, if this is a request-based SLO.</p>",
        "ServiceLevelObjectiveBudgetReport$RequestBasedSli": null
      }
    },
    "RequestBasedServiceLevelIndicatorConfig": {
      "base": "<p>This structure specifies the information about the service and the performance metric that a request-based SLO is to monitor.</p>",
      "refs": {
        "CreateServiceLevelObjectiveInput$RequestBasedSliConfig": "<p>If this SLO is a request-based SLO, this structure defines the information about what performance metric this SLO will monitor.</p> <p>You can't specify both <code>RequestBasedSliConfig</code> and <code>SliConfig</code> in the same operation.</p>",
        "UpdateServiceLevelObjectiveInput$RequestBasedSliConfig": "<p>If this SLO is a request-based SLO, this structure defines the information about what performance metric this SLO will monitor.</p> <p>You can't specify both <code>SliConfig</code> and <code>RequestBasedSliConfig</code> in the same operation.</p>"
      }
    },
    "RequestBasedServiceLevelIndicatorMetric": {
      "base": "<p>This structure contains the information about the metric that is used for a request-based SLO.</p>",
      "refs": {
        "RequestBasedServiceLevelIndicator$RequestBasedSliMetric": "<p>A structure that contains information about the metric that the SLO monitors. </p>"
      }
    },
    "RequestBasedServiceLevelIndicatorMetricConfig": {
      "base": "<p>Use this structure to specify the information for the metric that a period-based SLO will monitor.</p>",
      "refs": {
        "RequestBasedServiceLevelIndicatorConfig$RequestBasedSliMetricConfig": "<p>Use this structure to specify the metric to be used for the SLO.</p>"
      }
    },
    "ResourceId": {
      "base": null,
      "refs": {
        "ResourceNotFoundException$ResourceId": "<p>Can't find the resource id.</p>"
      }
    },
    "ResourceNotFoundException": {
      "base": "<p>Resource not found.</p>",
      "refs": {}
    },
    "ResourceType": {
      "base": null,
      "refs": {
        "ResourceNotFoundException$ResourceType": "<p>The resource type is not valid.</p>"
      }
    },
    "ReturnData": {
      "base": null,
      "refs": {
        "MetricDataQuery$ReturnData": "<p>Use this only if you are using a metric math expression for the SLO. Specify <code>true</code> for <code>ReturnData</code> for only the one expression result to use as the alarm. For all other metrics and expressions in the same <code>CreateServiceLevelObjective</code> operation, specify <code>ReturnData</code> as <code>false</code>.</p>"
      }
    },
    "RollingInterval": {
      "base": "<p>If the interval for this SLO is a rolling interval, this structure contains the interval specifications.</p>",
      "refs": {
        "Interval$RollingInterval": "<p>If the interval is a rolling interval, this structure contains the interval specifications.</p>"
      }
    },
    "RollingIntervalDuration": {
      "base": null,
      "refs": {
        "RollingInterval$Duration": "<p>Specifies the duration of each rolling interval. For example, if <code>Duration</code> is <code>7</code> and <code>DurationUnit</code> is <code>DAY</code>, each rolling interval is seven days.</p>"
      }
    },
    "SLIPeriodSeconds": {
      "base": null,
      "refs": {
        "ServiceLevelIndicatorMetricConfig$PeriodSeconds": "<p>The number of seconds to use as the period for SLO evaluation. Your application's performance is compared to the SLI during each period. For each period, the application is determined to have either achieved or not achieved the necessary performance.</p>"
      }
    },
    "Service": {
      "base": "<p>This structure contains information about one of your services that was discovered by Application Signals. </p>",
      "refs": {
        "GetServiceOutput$Service": "<p>A structure containing information about the service.</p>"
      }
    },
    "ServiceDependencies": {
      "base": null,
      "refs": {
        "ListServiceDependenciesOutput$ServiceDependencies": "<p>An array, where each object in the array contains information about one of the dependencies of this service.</p>"
      }
    },
    "ServiceDependency": {
      "base": "<p>This structure contains information about one dependency of this service.</p>",
      "refs": {
        "ServiceDependencies$member": null
      }
    },
    "ServiceDependent": {
      "base": "<p>This structure contains information about a service dependent that was discovered by Application Signals. A dependent is an entity that invoked the specified service during the provided time range. Dependents include other services, CloudWatch Synthetics canaries, and clients that are instrumented with CloudWatch RUM app monitors.</p>",
      "refs": {
        "ServiceDependents$member": null
      }
    },
    "ServiceDependents": {
      "base": null,
      "refs": {
        "ListServiceDependentsOutput$ServiceDependents": "<p>An array, where each object in the array contains information about one of the dependents of this service.</p>"
      }
    },
    "ServiceEntity": {
      "base": "<p>A structure that contains identifying information for a service entity.</p>",
      "refs": {
        "AuditTargetEntity$Service": "<p>Service entity information when the audit target is a service.</p>",
        "ServiceOperationEntity$Service": "<p>The service entity that contains this operation.</p>"
      }
    },
    "ServiceErrorMessage": {
      "base": null,
      "refs": {
        "AccessDeniedException$Message": null
      }
    },
    "ServiceGroup": {
      "base": "<p>A structure that represents a logical grouping of services based on shared attributes such as business unit, environment, or entry point.</p>",
      "refs": {
        "ServiceGroups$member": null
      }
    },
    "ServiceGroups": {
      "base": null,
      "refs": {
        "Service$ServiceGroups": "<p>An array of service groups that this service belongs to, based on the configured grouping attributes.</p>",
        "ServiceSummary$ServiceGroups": "<p>An array of service groups that this service belongs to, based on the configured grouping attributes.</p>"
      }
    },
    "ServiceLevelIndicator": {
      "base": "<p>This structure contains information about the performance metric that a period-based SLO monitors.</p>",
      "refs": {
        "ServiceLevelObjective$Sli": "<p>A structure containing information about the performance metric that this SLO monitors, if this is a period-based SLO.</p>",
        "ServiceLevelObjectiveBudgetReport$Sli": "<p>A structure that contains information about the performance metric that this SLO monitors.</p>"
      }
    },
    "ServiceLevelIndicatorComparisonOperator": {
      "base": null,
      "refs": {
        "RequestBasedServiceLevelIndicator$ComparisonOperator": "<p>The arithmetic operation used when comparing the specified metric to the threshold.</p>",
        "RequestBasedServiceLevelIndicatorConfig$ComparisonOperator": "<p>The arithmetic operation to use when comparing the specified metric to the threshold. This parameter is required if this SLO is tracking the <code>Latency</code> metric.</p>",
        "ServiceLevelIndicator$ComparisonOperator": "<p>The arithmetic operation used when comparing the specified metric to the threshold.</p>",
        "ServiceLevelIndicatorConfig$ComparisonOperator": "<p>The arithmetic operation to use when comparing the specified metric to the threshold.</p>"
      }
    },
    "ServiceLevelIndicatorConfig": {
      "base": "<p>This structure specifies the information about the service and the performance metric that a period-based SLO is to monitor.</p>",
      "refs": {
        "CreateServiceLevelObjectiveInput$SliConfig": "<p>If this SLO is a period-based SLO, this structure defines the information about what performance metric this SLO will monitor.</p> <p>You can't specify both <code>RequestBasedSliConfig</code> and <code>SliConfig</code> in the same operation.</p>",
        "UpdateServiceLevelObjectiveInput$SliConfig": "<p>If this SLO is a period-based SLO, this structure defines the information about what performance metric this SLO will monitor.</p>"
      }
    },
    "ServiceLevelIndicatorMetric": {
      "base": "<p>This structure contains the information about the metric that is used for a period-based SLO.</p>",
      "refs": {
        "ServiceLevelIndicator$SliMetric": "<p>A structure that contains information about the metric that the SLO monitors. </p>"
      }
    },
    "ServiceLevelIndicatorMetricConfig": {
      "base": "<p>Use this structure to specify the information for the metric that a period-based SLO will monitor.</p>",
      "refs": {
        "ServiceLevelIndicatorConfig$SliMetricConfig": "<p>Use this structure to specify the metric to be used for the SLO.</p>"
      }
    },
    "ServiceLevelIndicatorMetricThreshold": {
      "base": null,
      "refs": {
        "RequestBasedServiceLevelIndicator$MetricThreshold": "<p>This value is the threshold that the observed metric values of the SLI metric are compared to.</p>",
        "RequestBasedServiceLevelIndicatorConfig$MetricThreshold": "<p>The value that the SLI metric is compared to. This parameter is required if this SLO is tracking the <code>Latency</code> metric.</p>",
        "ServiceLevelIndicator$MetricThreshold": "<p>The value that the SLI metric is compared to.</p>",
        "ServiceLevelIndicatorConfig$MetricThreshold": "<p>This parameter is used only when a request-based SLO tracks the <code>Latency</code> metric. Specify the threshold value that the observed <code>Latency</code> metric values are to be compared to.</p>"
      }
    },
    "ServiceLevelIndicatorMetricType": {
      "base": null,
      "refs": {
        "RequestBasedServiceLevelIndicatorMetric$MetricType": "<p>If the SLO monitors either the <code>LATENCY</code> or <code>AVAILABILITY</code> metric that Application Signals collects, this field displays which of those metrics is used.</p>",
        "RequestBasedServiceLevelIndicatorMetricConfig$MetricType": "<p>If the SLO is to monitor either the <code>LATENCY</code> or <code>AVAILABILITY</code> metric that Application Signals collects, use this field to specify which of those metrics is used.</p>",
        "ServiceLevelIndicatorMetric$MetricType": "<p>If the SLO monitors either the <code>LATENCY</code> or <code>AVAILABILITY</code> metric that Application Signals collects, this field displays which of those metrics is used.</p>",
        "ServiceLevelIndicatorMetricConfig$MetricType": "<p>If the SLO is to monitor either the <code>LATENCY</code> or <code>AVAILABILITY</code> metric that Application Signals collects, use this field to specify which of those metrics is used.</p>"
      }
    },
    "ServiceLevelIndicatorStatistic": {
      "base": null,
      "refs": {
        "ServiceLevelIndicatorMetricConfig$Statistic": "<p>The statistic to use for comparison to the threshold. It can be any CloudWatch statistic or extended statistic. For more information about statistics, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/Statistics-definitions.html\">CloudWatch statistics definitions</a>.</p>"
      }
    },
    "ServiceLevelObjective": {
      "base": "<p>A structure containing information about one service level objective (SLO) that has been created in Application Signals. Creating SLOs can help you ensure your services are performing to the level that you expect. SLOs help you set and track a specific target level for the reliability and availability of your applications and services. Each SLO uses a service level indicator (SLI), which is a key performance metric, to calculate how much underperformance can be tolerated before the goal that you set for the SLO is not achieved.</p>",
      "refs": {
        "CreateServiceLevelObjectiveOutput$Slo": "<p>A structure that contains information about the SLO that you just created.</p>",
        "GetServiceLevelObjectiveOutput$Slo": "<p>A structure containing the information about the SLO.</p>",
        "UpdateServiceLevelObjectiveOutput$Slo": "<p>A structure that contains information about the SLO that you just updated.</p>"
      }
    },
    "ServiceLevelObjectiveArn": {
      "base": null,
      "refs": {
        "ServiceLevelObjective$Arn": "<p>The ARN of this SLO.</p>",
        "ServiceLevelObjectiveBudgetReport$Arn": "<p>The ARN of the SLO that this report is for.</p>",
        "ServiceLevelObjectiveBudgetReportError$Arn": "<p>The ARN of the SLO that this error is related to.</p>",
        "ServiceLevelObjectiveSummary$Arn": "<p>The ARN of this service level objective.</p>"
      }
    },
    "ServiceLevelObjectiveBudgetReport": {
      "base": "<p>A structure containing an SLO budget report that you have requested.</p>",
      "refs": {
        "ServiceLevelObjectiveBudgetReports$member": null
      }
    },
    "ServiceLevelObjectiveBudgetReportError": {
      "base": "<p>A structure containing information about one error that occurred during a <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/APIReference/API_BatchGetServiceLevelObjectiveBudgetReport.html\">BatchGetServiceLevelObjectiveBudgetReport</a> operation.</p>",
      "refs": {
        "ServiceLevelObjectiveBudgetReportErrors$member": null
      }
    },
    "ServiceLevelObjectiveBudgetReportErrorCode": {
      "base": null,
      "refs": {
        "ServiceLevelObjectiveBudgetReportError$ErrorCode": "<p>The error code for this error.</p>"
      }
    },
    "ServiceLevelObjectiveBudgetReportErrorMessage": {
      "base": null,
      "refs": {
        "ServiceLevelObjectiveBudgetReportError$ErrorMessage": "<p>The message for this error.</p>"
      }
    },
    "ServiceLevelObjectiveBudgetReportErrors": {
      "base": null,
      "refs": {
        "BatchGetServiceLevelObjectiveBudgetReportOutput$Errors": "<p>An array of structures, where each structure includes an error indicating that one of the requests in the array was not valid.</p>"
      }
    },
    "ServiceLevelObjectiveBudgetReports": {
      "base": null,
      "refs": {
        "BatchGetServiceLevelObjectiveBudgetReportOutput$Reports": "<p>An array of structures, where each structure is one budget report.</p>"
      }
    },
    "ServiceLevelObjectiveBudgetStatus": {
      "base": null,
      "refs": {
        "ServiceLevelObjectiveBudgetReport$BudgetStatus": "<p>The status of this SLO, as it relates to the error budget for the entire time interval.</p> <ul> <li> <p> <code>OK</code> means that the SLO had remaining budget above the warning threshold, as of the time that you specified in <code>TimeStamp</code>.</p> </li> <li> <p> <code>WARNING</code> means that the SLO's remaining budget was below the warning threshold, as of the time that you specified in <code>TimeStamp</code>.</p> </li> <li> <p> <code>BREACHED</code> means that the SLO's budget was exhausted, as of the time that you specified in <code>TimeStamp</code>.</p> </li> <li> <p> <code>INSUFFICIENT_DATA</code> means that the specified start and end times were before the SLO was created, or that attainment data is missing.</p> </li> </ul>"
      }
    },
    "ServiceLevelObjectiveDescription": {
      "base": null,
      "refs": {
        "CreateServiceLevelObjectiveInput$Description": "<p>An optional description for this SLO.</p>",
        "ServiceLevelObjective$Description": "<p>The description that you created for this SLO.</p>",
        "UpdateServiceLevelObjectiveInput$Description": "<p>An optional description for the SLO.</p>"
      }
    },
    "ServiceLevelObjectiveEntity": {
      "base": "<p>A structure that contains identifying information for a service level objective entity.</p>",
      "refs": {
        "AuditTargetEntity$Slo": "<p>SLO entity information when the audit target is a service level objective.</p>"
      }
    },
    "ServiceLevelObjectiveId": {
      "base": null,
      "refs": {
        "BatchUpdateExclusionWindowsError$SloId": "<p>The SLO ID in the error.</p>",
        "DeleteServiceLevelObjectiveInput$Id": "<p>The ARN or name of the service level objective to delete.</p>",
        "GetServiceLevelObjectiveInput$Id": "<p>The ARN or name of the SLO that you want to retrieve information about. You can find the ARNs of SLOs by using the <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/APIReference/API_ListServiceLevelObjectives.html\">ListServiceLevelObjectives</a> operation.</p>",
        "ListServiceLevelObjectiveExclusionWindowsInput$Id": "<p>The ID of the SLO to list exclusion windows for.</p>",
        "UpdateServiceLevelObjectiveInput$Id": "<p>The Amazon Resource Name (ARN) or name of the service level objective that you want to update.</p>"
      }
    },
    "ServiceLevelObjectiveIds": {
      "base": null,
      "refs": {
        "BatchGetServiceLevelObjectiveBudgetReportInput$SloIds": "<p>An array containing the IDs of the service level objectives that you want to include in the report.</p>",
        "BatchUpdateExclusionWindowsInput$SloIds": "<p>The list of SLO IDs to add or remove exclusion windows from.</p>",
        "BatchUpdateExclusionWindowsOutput$SloIds": "<p>The list of SLO IDs that were successfully processed.</p>"
      }
    },
    "ServiceLevelObjectiveName": {
      "base": null,
      "refs": {
        "CreateServiceLevelObjectiveInput$Name": "<p>A name for this SLO.</p>",
        "ServiceLevelObjective$Name": "<p>The name of this SLO.</p>",
        "ServiceLevelObjectiveBudgetReport$Name": "<p>The name of the SLO that this report is for.</p>",
        "ServiceLevelObjectiveBudgetReportError$Name": "<p>The name of the SLO that this error is related to.</p>",
        "ServiceLevelObjectiveSummary$Name": "<p>The name of the service level objective.</p>"
      }
    },
    "ServiceLevelObjectiveSummaries": {
      "base": null,
      "refs": {
        "ListServiceLevelObjectivesOutput$SloSummaries": "<p>An array of structures, where each structure contains information about one SLO.</p>"
      }
    },
    "ServiceLevelObjectiveSummary": {
      "base": "<p>A structure that contains information about one service level objective (SLO) created in Application Signals.</p>",
      "refs": {
        "ServiceLevelObjectiveSummaries$member": null
      }
    },
    "ServiceOperation": {
      "base": "<p>This structure contains information about an operation discovered by Application Signals. An operation is a specific function performed by a service that was discovered by Application Signals, and is often an API that is called by an upstream dependent. </p>",
      "refs": {
        "ServiceOperations$member": null
      }
    },
    "ServiceOperationEntity": {
      "base": "<p>A structure that contains identifying information for a service operation entity.</p>",
      "refs": {
        "AuditTargetEntity$ServiceOperation": "<p>Service operation entity information when the audit target is a specific service operation.</p>"
      }
    },
    "ServiceOperations": {
      "base": null,
      "refs": {
        "ListServiceOperationsOutput$ServiceOperations": "<p>An array of structures that each contain information about one operation of this service.</p>"
      }
    },
    "ServiceQuotaExceededException": {
      "base": "<p>This request exceeds a service quota.</p>",
      "refs": {}
    },
    "ServiceState": {
      "base": "<p>A structure that contains information about the current state of a service, including its latest change events such as deployments and other state-changing activities.</p>",
      "refs": {
        "ServiceStates$member": null
      }
    },
    "ServiceStates": {
      "base": null,
      "refs": {
        "ListServiceStatesOutput$ServiceStates": "<p>An array of structures, where each structure contains information about the state of one service, including its latest change events such as deployments.</p>"
      }
    },
    "ServiceSummaries": {
      "base": null,
      "refs": {
        "ListServicesOutput$ServiceSummaries": "<p>An array of structures, where each structure contains some information about a service. To get complete information about a service, use <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/APIReference/API_GetService.html\">GetService</a>.</p>"
      }
    },
    "ServiceSummary": {
      "base": "<p>This structure contains information about one of your services that was discovered by Application Signals</p>",
      "refs": {
        "ServiceSummaries$member": null
      }
    },
    "Severity": {
      "base": null,
      "refs": {
        "AuditorResult$Severity": "<p>The severity level of this audit finding, indicating the importance and potential impact of the issue.</p>"
      }
    },
    "StandardUnit": {
      "base": null,
      "refs": {
        "MetricStat$Unit": "<p>If you omit <code>Unit</code> then all data that was collected with any unit is returned, along with the corresponding units that were specified when the data was reported to CloudWatch. If you specify a unit, the operation returns only data that was collected with that unit specified. If you specify a unit that does not match the data collected, the results of the operation are null. CloudWatch does not perform unit conversions.</p>"
      }
    },
    "StartDiscoveryInput": {
      "base": null,
      "refs": {}
    },
    "StartDiscoveryOutput": {
      "base": null,
      "refs": {}
    },
    "Stat": {
      "base": null,
      "refs": {
        "MetricStat$Stat": "<p>The statistic to use for comparison to the threshold. It can be any CloudWatch statistic or extended statistic. For more information about statistics, see <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/Statistics-definitions.html\">CloudWatch statistics definitions</a>.</p>"
      }
    },
    "String": {
      "base": null,
      "refs": {
        "AttributeMap$key": null,
        "AttributeMap$value": null,
        "AuditFinding$Operation": "<p>The name of the operation associated with this audit finding, if the finding is specific to a particular service operation.</p>",
        "AuditFinding$Type": "<p>The type of audit finding.</p>",
        "AuditTarget$Type": "<p>The type of entity being audited, such as <code>service</code>, <code>SLO</code>, <code>service_operation</code>, or <code>canary</code>. </p>",
        "AuditorResult$Auditor": "<p>The name of the auditor algorithm that generated this result.</p>",
        "Auditors$member": null,
        "CanaryEntity$CanaryName": "<p>The name of the CloudWatch Synthetics canary.</p>",
        "ChangeEvent$Region": "<p>The Amazon Web Services region where this change event occurred.</p>",
        "ChangeEvent$EventId": "<p>A unique identifier for this change event. For CloudTrail-based events, this is the CloudTrail event id. For other events, this will be <code>Unknown</code>.</p>",
        "ChangeEvent$UserName": "<p>The name of the user who initiated this change event, if available.</p>",
        "ChangeEvent$EventName": "<p>The name or description of this change event.</p>",
        "ConflictException$Message": null,
        "DataMap$key": null,
        "DataMap$value": null,
        "Edge$SourceNodeId": "<p>The identifier of the source node in this edge connection.</p>",
        "Edge$DestinationNodeId": "<p>The identifier of the destination node in this edge connection.</p>",
        "Node$Name": "<p>The name of the entity represented by this node.</p>",
        "Node$NodeId": "<p>A unique identifier for this node within the dependency graph.</p>",
        "Node$Operation": "<p>The operation associated with this node, if applicable.</p>",
        "Node$Type": "<p>The type of entity represented by this node, such as <code>Service</code> or <code>Resource</code>.</p>",
        "Node$Status": "<p>The status of the entity represented by this node.</p>",
        "ServiceEntity$Type": "<p>The type of the service entity.</p>",
        "ServiceEntity$Name": "<p>The name of the service.</p>",
        "ServiceEntity$Environment": "<p>The environment where the service is deployed.</p>",
        "ServiceEntity$AwsAccountId": "<p>The Amazon Web Services account ID where the service is located. Provide this value only for cross-account access.</p>",
        "ServiceLevelObjectiveEntity$SloName": "<p>The name of the service level objective.</p>",
        "ServiceLevelObjectiveEntity$SloArn": "<p>The ARN of the service level objective. The SLO must be provided with ARN for cross-account access.</p>",
        "ServiceLevelObjectiveIds$member": null,
        "ServiceOperationEntity$Operation": "<p>The name of the operation.</p>",
        "ServiceOperationEntity$MetricType": "<p>The type of metric associated with this service operation.</p>",
        "ServiceQuotaExceededException$Message": null,
        "ThrottlingException$Message": null
      }
    },
    "Tag": {
      "base": "<p>A key-value pair associated with a resource. Tags can help you organize and categorize your resources.</p>",
      "refs": {
        "TagList$member": null
      }
    },
    "TagKey": {
      "base": null,
      "refs": {
        "Tag$Key": "<p>A string that you can use to assign a value. The combination of tag keys and values can help you organize and categorize your resources.</p>",
        "TagKeyList$member": null
      }
    },
    "TagKeyList": {
      "base": null,
      "refs": {
        "UntagResourceRequest$TagKeys": "<p>The list of tag keys to remove from the resource.</p>"
      }
    },
    "TagList": {
      "base": null,
      "refs": {
        "CreateServiceLevelObjectiveInput$Tags": "<p>A list of key-value pairs to associate with the SLO. You can associate as many as 50 tags with an SLO. To be able to associate tags with the SLO when you create the SLO, you must have the <code>cloudwatch:TagResource</code> permission.</p> <p>Tags can help you organize and categorize your resources. You can also use them to scope user permissions by granting a user permission to access or change only resources with certain tag values.</p>",
        "ListTagsForResourceResponse$Tags": "<p>The list of tag keys and values associated with the resource you specified.</p>",
        "TagResourceRequest$Tags": "<p>The list of key-value pairs to associate with the alarm.</p>"
      }
    },
    "TagResourceRequest": {
      "base": null,
      "refs": {}
    },
    "TagResourceResponse": {
      "base": null,
      "refs": {}
    },
    "TagValue": {
      "base": null,
      "refs": {
        "Tag$Value": "<p>The value for the specified tag key.</p>"
      }
    },
    "ThrottlingException": {
      "base": "<p>The request was throttled because of quota limits.</p>",
      "refs": {}
    },
    "Timestamp": {
      "base": null,
      "refs": {
        "BatchGetServiceLevelObjectiveBudgetReportInput$Timestamp": "<p>The date and time that you want the report to be for. It is expressed as the number of milliseconds since Jan 1, 1970 00:00:00 UTC.</p>",
        "BatchGetServiceLevelObjectiveBudgetReportOutput$Timestamp": "<p>The date and time that the report is for. It is expressed as the number of milliseconds since Jan 1, 1970 00:00:00 UTC.</p>",
        "CalendarInterval$StartTime": "<p>The date and time when you want the first interval to start. Be sure to choose a time that configures the intervals the way that you want. For example, if you want weekly intervals starting on Mondays at 6 a.m., be sure to specify a start time that is a Monday at 6 a.m.</p> <p>When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>As soon as one calendar interval ends, another automatically begins.</p>",
        "ChangeEvent$Timestamp": "<p>The timestamp when this change event occurred. When used in a raw HTTP Query API, it is formatted as epoch time in seconds.</p>",
        "ExclusionWindow$StartTime": "<p>The start of the SLO time window exclusion. Defaults to current time if not specified.</p>",
        "GetServiceInput$StartTime": "<p>The start of the time period to retrieve information about. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>Your requested start time will be rounded to the nearest hour.</p>",
        "GetServiceInput$EndTime": "<p>The end of the time period to retrieve information about. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>Your requested start time will be rounded to the nearest hour.</p>",
        "GetServiceOutput$StartTime": "<p>The start time of the data included in the response. In a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code>.</p> <p>This displays the time that Application Signals used for the request. It might not match your request exactly, because it was rounded to the nearest hour.</p>",
        "GetServiceOutput$EndTime": "<p>The end time of the data included in the response. In a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code>.</p> <p>This displays the time that Application Signals used for the request. It might not match your request exactly, because it was rounded to the nearest hour.</p>",
        "GroupingConfiguration$UpdatedAt": "<p>The timestamp when this grouping configuration was last updated. When used in a raw HTTP Query API, it is formatted as epoch time in seconds.</p>",
        "ListAuditFindingsInput$StartTime": "<p>The start of the time period to retrieve audit findings for. When used in a raw HTTP Query API, it is formatted as epoch time in seconds. For example, <code>1698778057</code> </p>",
        "ListAuditFindingsInput$EndTime": "<p>The end of the time period to retrieve audit findings for. When used in a raw HTTP Query API, it is formatted as epoch time in seconds. For example, <code>1698778057</code> </p>",
        "ListAuditFindingsOutput$StartTime": "<p>The start of the time period that the returned audit findings apply to. When used in a raw HTTP Query API, it is formatted as epoch time in seconds. For example, <code>1698778057</code> </p>",
        "ListAuditFindingsOutput$EndTime": "<p>The end of the time period that the returned audit findings apply to. When used in a raw HTTP Query API, it is formatted as epoch time in seconds. For example, <code>1698778057</code> </p>",
        "ListEntityEventsInput$StartTime": "<p>The start of the time period to retrieve change events for. When used in a raw HTTP Query API, it is formatted as epoch time in seconds. For example: <code>1698778057</code> </p>",
        "ListEntityEventsInput$EndTime": "<p>The end of the time period to retrieve change events for. When used in a raw HTTP Query API, it is formatted as epoch time in seconds. For example: <code>1698778057</code> </p>",
        "ListEntityEventsOutput$StartTime": "<p>The start of the time period that the returned change events apply to. When used in a raw HTTP Query API, it is formatted as epoch time in seconds. For example: <code>1698778057</code> </p>",
        "ListEntityEventsOutput$EndTime": "<p>The end of the time period that the returned change events apply to. When used in a raw HTTP Query API, it is formatted as epoch time in seconds. For example: <code>1698778057</code> </p>",
        "ListGroupingAttributeDefinitionsOutput$UpdatedAt": "<p>The timestamp when the grouping configuration was last updated. When used in a raw HTTP Query API, it is formatted as epoch time in seconds.</p>",
        "ListServiceDependenciesInput$StartTime": "<p>The start of the time period to retrieve information about. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>Your requested start time will be rounded to the nearest hour.</p>",
        "ListServiceDependenciesInput$EndTime": "<p>The end of the time period to retrieve information about. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>Your requested end time will be rounded to the nearest hour.</p>",
        "ListServiceDependenciesOutput$StartTime": "<p>The start of the time period that the returned information applies to. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>This displays the time that Application Signals used for the request. It might not match your request exactly, because it was rounded to the nearest hour.</p>",
        "ListServiceDependenciesOutput$EndTime": "<p>The end of the time period that the returned information applies to. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>This displays the time that Application Signals used for the request. It might not match your request exactly, because it was rounded to the nearest hour.</p>",
        "ListServiceDependentsInput$StartTime": "<p>The start of the time period to retrieve information about. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>Your requested start time will be rounded to the nearest hour.</p>",
        "ListServiceDependentsInput$EndTime": "<p>The end of the time period to retrieve information about. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>Your requested start time will be rounded to the nearest hour.</p>",
        "ListServiceDependentsOutput$StartTime": "<p>The start of the time period that the returned information applies to. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>This displays the time that Application Signals used for the request. It might not match your request exactly, because it was rounded to the nearest hour.</p>",
        "ListServiceDependentsOutput$EndTime": "<p>The end of the time period that the returned information applies to. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>This displays the time that Application Signals used for the request. It might not match your request exactly, because it was rounded to the nearest hour.</p>",
        "ListServiceOperationsInput$StartTime": "<p>The start of the time period to retrieve information about. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>Your requested start time will be rounded to the nearest hour.</p>",
        "ListServiceOperationsInput$EndTime": "<p>The end of the time period to retrieve information about. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>Your requested end time will be rounded to the nearest hour.</p>",
        "ListServiceOperationsOutput$StartTime": "<p>The start of the time period that the returned information applies to. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>This displays the time that Application Signals used for the request. It might not match your request exactly, because it was rounded to the nearest hour.</p>",
        "ListServiceOperationsOutput$EndTime": "<p>The end of the time period that the returned information applies to. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>This displays the time that Application Signals used for the request. It might not match your request exactly, because it was rounded to the nearest hour.</p>",
        "ListServiceStatesInput$StartTime": "<p>The start of the time period to retrieve service state information for. When used in a raw HTTP Query API, it is formatted as epoch time in seconds. For example, <code>1698778057</code>.</p>",
        "ListServiceStatesInput$EndTime": "<p>The end of the time period to retrieve service state information for. When used in a raw HTTP Query API, it is formatted as epoch time in seconds. For example, <code>1698778057</code>.</p>",
        "ListServiceStatesOutput$StartTime": "<p>The start of the time period that the returned information applies to. When used in a raw HTTP Query API, it is formatted as epoch time in seconds. For example, <code>1698778057</code>.</p>",
        "ListServiceStatesOutput$EndTime": "<p>The end of the time period that the returned information applies to. When used in a raw HTTP Query API, it is formatted as epoch time in seconds. For example, <code>1698778057</code>.</p>",
        "ListServicesInput$StartTime": "<p>The start of the time period to retrieve information about. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>Your requested start time will be rounded to the nearest hour.</p>",
        "ListServicesInput$EndTime": "<p>The end of the time period to retrieve information about. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>Your requested start time will be rounded to the nearest hour.</p>",
        "ListServicesOutput$StartTime": "<p>The start of the time period that the returned information applies to. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>This displays the time that Application Signals used for the request. It might not match your request exactly, because it was rounded to the nearest hour.</p>",
        "ListServicesOutput$EndTime": "<p>The end of the time period that the returned information applies to. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: <code>1698778057</code> </p> <p>This displays the time that Application Signals used for the request. It might not match your request exactly, because it was rounded to the nearest hour.</p>",
        "MetricGraph$StartTime": "<p>The start time for the metric data included in this graph. When used in a raw HTTP Query API, it is formatted as epoch time in seconds.</p>",
        "MetricGraph$EndTime": "<p>The end time for the metric data included in this graph. When used in a raw HTTP Query API, it is formatted as epoch time in seconds.</p>",
        "ServiceLevelObjective$CreatedTime": "<p>The date and time that this SLO was created. When used in a raw HTTP Query API, it is formatted as <code>yyyy-MM-dd'T'HH:mm:ss</code>. For example, <code>2019-07-01T23:59:59</code>.</p>",
        "ServiceLevelObjective$LastUpdatedTime": "<p>The time that this SLO was most recently updated. When used in a raw HTTP Query API, it is formatted as <code>yyyy-MM-dd'T'HH:mm:ss</code>. For example, <code>2019-07-01T23:59:59</code>.</p>",
        "ServiceLevelObjectiveSummary$CreatedTime": "<p>The date and time that this service level objective was created. It is expressed as the number of milliseconds since Jan 1, 1970 00:00:00 UTC.</p>"
      }
    },
    "TotalBudgetRequests": {
      "base": null,
      "refs": {
        "ServiceLevelObjectiveBudgetReport$TotalBudgetRequests": "<p>This field is displayed only for request-based SLOs. It displays the total number of failed requests that can be tolerated during the time range between the start of the interval and the time stamp supplied in the budget report request. It is based on the total number of requests that occurred, and the percentage specified in the attainment goal. If the number of failed requests matches this number or is higher, then this SLO is currently breaching.</p> <p>This number can go up and down between reports with different time stamps, based on both how many total requests occur.</p>"
      }
    },
    "TotalBudgetSeconds": {
      "base": null,
      "refs": {
        "ServiceLevelObjectiveBudgetReport$TotalBudgetSeconds": "<p>The total number of seconds in the error budget for the interval. This field is included only if the SLO is a period-based SLO.</p>"
      }
    },
    "UntagResourceRequest": {
      "base": null,
      "refs": {}
    },
    "UntagResourceResponse": {
      "base": null,
      "refs": {}
    },
    "UpdateServiceLevelObjectiveInput": {
      "base": null,
      "refs": {}
    },
    "UpdateServiceLevelObjectiveOutput": {
      "base": null,
      "refs": {}
    },
    "ValidationException": {
      "base": "<p>The resource is not valid.</p>",
      "refs": {}
    },
    "ValidationExceptionMessage": {
      "base": null,
      "refs": {
        "ValidationException$message": null
      }
    },
    "WarningThreshold": {
      "base": null,
      "refs": {
        "Goal$WarningThreshold": "<p>The percentage of remaining budget over total budget that you want to get warnings for. If you omit this parameter, the default of 50.0 is used. </p>"
      }
    },
    "Window": {
      "base": "<p>The object that defines the time length of an exclusion window.</p>",
      "refs": {
        "ExclusionWindow$Window": "<p>The SLO time window exclusion .</p>"
      }
    }
  }
}
