{
  "version": "2.0",
  "service": "<p>Welcome to the Control Catalog API reference. This guide is for developers who need detailed information about how to programmatically identify and filter the common controls and related metadata that are available to Amazon Web Services customers. This API reference provides descriptions, syntax, and usage examples for each of the actions and data types that are supported by Control Catalog. </p> <p>Use the following links to get started with the Control Catalog API:</p> <ul> <li> <p> <a href=\"https://docs.aws.amazon.com/controlcatalog/latest/APIReference/API_Operations.html\">Actions</a>: An alphabetical list of all Control Catalog API operations.</p> </li> <li> <p> <a href=\"https://docs.aws.amazon.com/controlcatalog/latest/APIReference/API_Types.html\">Data types</a>: An alphabetical list of all Control Catalog data types.</p> </li> <li> <p> <a href=\"https://docs.aws.amazon.com/controlcatalog/latest/APIReference/CommonParameters.html\">Common parameters</a>: Parameters that all operations can use.</p> </li> <li> <p> <a href=\"https://docs.aws.amazon.com/controlcatalog/latest/APIReference/CommonErrors.html\">Common errors</a>: Client and server errors that all operations can return.</p> </li> </ul>",
  "operations": {
    "GetControl": "<p>Returns details about a specific control, most notably a list of Amazon Web Services Regions where this control is supported. Input a value for the <i>ControlArn</i> parameter, in ARN form. <code>GetControl</code> accepts <i>controltower</i> or <i>controlcatalog</i> control ARNs as input. Returns a <i>controlcatalog</i> ARN format.</p> <p>In the API response, controls that have the value <code>GLOBAL</code> in the <code>Scope</code> field do not show the <code>DeployableRegions</code> field, because it does not apply. Controls that have the value <code>REGIONAL</code> in the <code>Scope</code> field return a value for the <code>DeployableRegions</code> field, as shown in the example.</p>",
    "ListCommonControls": "<p>Returns a paginated list of common controls from the Amazon Web Services Control Catalog.</p> <p>You can apply an optional filter to see common controls that have a specific objective. If you don’t provide a filter, the operation returns all common controls. </p>",
    "ListControlMappings": "<p>Returns a paginated list of control mappings from the Control Catalog. Control mappings show relationships between controls and other entities, such as common controls or compliance frameworks.</p>",
    "ListControls": "<p>Returns a paginated list of all available controls in the Control Catalog library. Allows you to discover available controls. The list of controls is given as structures of type <i>controlSummary</i>. The ARN is returned in the global <i>controlcatalog</i> format, as shown in the examples.</p>",
    "ListDomains": "<p>Returns a paginated list of domains from the Control Catalog.</p>",
    "ListObjectives": "<p>Returns a paginated list of objectives from the Control Catalog.</p> <p>You can apply an optional filter to see the objectives that belong to a specific domain. If you don’t provide a filter, the operation returns all objectives. </p>"
  },
  "shapes": {
    "AccessDeniedException": {
      "base": "<p>You do not have sufficient access to perform this action.</p>",
      "refs": {}
    },
    "AssociatedDomainSummary": {
      "base": "<p>A summary of the domain that a common control or an objective belongs to.</p>",
      "refs": {
        "CommonControlSummary$Domain": "<p>The domain that the common control belongs to.</p>",
        "ObjectiveSummary$Domain": "<p>The domain that the objective belongs to.</p>"
      }
    },
    "AssociatedObjectiveSummary": {
      "base": "<p>A summary of the objective that a common control supports.</p>",
      "refs": {
        "CommonControlSummary$Objective": "<p>The objective that the common control belongs to.</p>"
      }
    },
    "CommonControlArn": {
      "base": null,
      "refs": {
        "CommonControlArnFilterList$member": null,
        "CommonControlMappingDetails$CommonControlArn": "<p>The Amazon Resource Name (ARN) that identifies the common control in the mapping.</p>",
        "CommonControlSummary$Arn": "<p>The Amazon Resource Name (ARN) that identifies the common control.</p>"
      }
    },
    "CommonControlArnFilterList": {
      "base": null,
      "refs": {
        "ControlMappingFilter$CommonControlArns": "<p>A list of common control ARNs to filter the mappings. When specified, only mappings associated with these common controls are returned.</p>"
      }
    },
    "CommonControlFilter": {
      "base": "<p>An optional filter that narrows the results to a specific objective.</p>",
      "refs": {
        "ListCommonControlsRequest$CommonControlFilter": "<p>An optional filter that narrows the results to a specific objective.</p> <p>This filter allows you to specify one objective ARN at a time. Passing multiple ARNs in the <code>CommonControlFilter</code> isn’t supported.</p>"
      }
    },
    "CommonControlMappingDetails": {
      "base": "<p>A structure that contains details about a common control mapping. In particular, it returns the Amazon Resource Name (ARN) of the common control.</p>",
      "refs": {
        "Mapping$CommonControl": "<p>The common control mapping details when the mapping type relates to a common control.</p>"
      }
    },
    "CommonControlSummary": {
      "base": "<p>A summary of metadata for a common control.</p>",
      "refs": {
        "CommonControlSummaryList$member": null
      }
    },
    "CommonControlSummaryList": {
      "base": null,
      "refs": {
        "ListCommonControlsResponse$CommonControls": "<p>The list of common controls that the <code>ListCommonControls</code> API returns.</p>"
      }
    },
    "ControlAlias": {
      "base": null,
      "refs": {
        "ControlAliases$member": null
      }
    },
    "ControlAliases": {
      "base": null,
      "refs": {
        "ControlSummary$Aliases": "<p>A list of alternative identifiers for the control. These are human-readable designators, such as <code>SH.S3.1</code>. Several aliases can refer to the same control across different Amazon Web Services services or compliance frameworks.</p>",
        "GetControlResponse$Aliases": "<p>A list of alternative identifiers for the control. These are human-readable designators, such as <code>SH.S3.1</code>. Several aliases can refer to the same control across different Amazon Web Services services or compliance frameworks.</p>"
      }
    },
    "ControlArn": {
      "base": null,
      "refs": {
        "ControlArnFilterList$member": null,
        "ControlMapping$ControlArn": "<p>The Amazon Resource Name (ARN) that identifies the control in the mapping.</p>",
        "ControlSummary$Arn": "<p>The Amazon Resource Name (ARN) of the control.</p>",
        "GetControlRequest$ControlArn": "<p>The Amazon Resource Name (ARN) of the control. It has one of the following formats:</p> <p> <i>Global format</i> </p> <p> <code>arn:{PARTITION}:controlcatalog:::control/{CONTROL_CATALOG_OPAQUE_ID}</code> </p> <p> <i>Or Regional format</i> </p> <p> <code>arn:{PARTITION}:controltower:{REGION}::control/{CONTROL_TOWER_OPAQUE_ID}</code> </p> <p>Here is a more general pattern that covers Amazon Web Services Control Tower and Control Catalog ARNs:</p> <p> <code>^arn:(aws(?:[-a-z]*)?):(controlcatalog|controltower):[a-zA-Z0-9-]*::control/[0-9a-zA-Z_\\\\-]+$</code> </p>",
        "GetControlResponse$Arn": "<p>The Amazon Resource Name (ARN) of the control.</p>",
        "RelatedControlMappingDetails$ControlArn": "<p>The unique identifier of a control.</p>"
      }
    },
    "ControlArnFilterList": {
      "base": null,
      "refs": {
        "ControlMappingFilter$ControlArns": "<p>A list of control ARNs to filter the mappings. When specified, only mappings associated with these controls are returned.</p>"
      }
    },
    "ControlBehavior": {
      "base": null,
      "refs": {
        "ControlSummary$Behavior": "<p>An enumerated type, with the following possible values:</p>",
        "GetControlResponse$Behavior": "<p>A term that identifies the control's functional behavior. One of <code>Preventive</code>, <code>Detective</code>, <code>Proactive</code> </p>"
      }
    },
    "ControlFilter": {
      "base": "<p>A structure that defines filtering criteria for the ListControls operation. You can use this filter to narrow down the list of controls based on their implementation details.</p>",
      "refs": {
        "ListControlsRequest$Filter": "<p>An optional filter that narrows the results to controls with specific implementation types or identifiers. If you don't provide a filter, the operation returns all available controls.</p>"
      }
    },
    "ControlMapping": {
      "base": "<p>A structure that contains information about a control mapping, including the control ARN, mapping type, and mapping details.</p>",
      "refs": {
        "ControlMappings$member": null
      }
    },
    "ControlMappingFilter": {
      "base": "<p>A structure that defines filtering criteria for the ListControlMappings operation. You can use this filter to narrow down the list of control mappings based on control ARNs, common control ARNs, or mapping types.</p>",
      "refs": {
        "ListControlMappingsRequest$Filter": "<p>An optional filter that narrows the results to specific control mappings based on control ARNs, common control ARNs, or mapping types.</p>"
      }
    },
    "ControlMappings": {
      "base": null,
      "refs": {
        "ListControlMappingsResponse$ControlMappings": "<p>The list of control mappings that the ListControlMappings API returns.</p>"
      }
    },
    "ControlParameter": {
      "base": "<p>Five types of control parameters are supported.</p> <ul> <li> <p> <b>AllowedRegions</b>: List of Amazon Web Services Regions exempted from the control. Each string is expected to be an Amazon Web Services Region code. This parameter is mandatory for the <b>OU Region deny</b> control, <b>CT.MULTISERVICE.PV.1</b>.</p> <p>Example: <code>[\"us-east-1\",\"us-west-2\"]</code> </p> </li> <li> <p> <b>ExemptedActions</b>: List of Amazon Web Services IAM actions exempted from the control. Each string is expected to be an IAM action.</p> <p>Example: <code>[\"logs:DescribeLogGroups\",\"logs:StartQuery\",\"logs:GetQueryResults\"]</code> </p> </li> <li> <p> <b>ExemptedPrincipalArns</b>: List of Amazon Web Services IAM principal ARNs exempted from the control. Each string is expected to be an IAM principal that follows the pattern <code>^arn:(aws|aws-us-gov):(iam|sts)::.+:.+$</code> </p> <p>Example: <code>[\"arn:aws:iam::*:role/ReadOnly\",\"arn:aws:sts::*:assumed-role/ReadOnly/*\"]</code> </p> </li> <li> <p> <b>ExemptedResourceArns</b>: List of resource ARNs exempted from the control. Each string is expected to be a resource ARN.</p> <p>Example: <code>[\"arn:aws:s3:::my-bucket-name\"]</code> </p> </li> <li> <p> <b>ExemptAssumeRoot</b>: A parameter that lets you choose whether to exempt requests made with <code>AssumeRoot</code> from this control, for this OU. For member accounts, the <code>AssumeRoot</code> property is included in requests initiated by IAM centralized root access. This parameter applies only to the <code>AWS-GR_RESTRICT_ROOT_USER</code> control. If you add the parameter when enabling the control, the <code>AssumeRoot</code> exemption is allowed. If you omit the parameter, the <code>AssumeRoot</code> exception is not permitted. The parameter does not accept <code>False</code> as a value.</p> <p> <i>Example: Enabling the control and allowing <code>AssumeRoot</code> </i> </p> <p> <code>{ \"controlIdentifier\": \"arn:aws:controlcatalog:::control/5kvme4m5d2b4d7if2fs5yg2ui\", \"parameters\": [ { \"key\": \"ExemptAssumeRoot\", \"value\": true } ], \"targetIdentifier\": \"arn:aws:organizations::8633900XXXXX:ou/o-6jmn81636m/ou-qsah-jtiihcla\" }</code> </p> </li> </ul>",
      "refs": {
        "ControlParameters$member": null
      }
    },
    "ControlParameters": {
      "base": null,
      "refs": {
        "GetControlResponse$Parameters": "<p>Returns an array of <code>ControlParameter</code> objects that specify the parameters a control supports. An empty list is returned for controls that don’t support parameters. </p>"
      }
    },
    "ControlRelationType": {
      "base": null,
      "refs": {
        "RelatedControlMappingDetails$RelationType": "<p>Returns an enumerated value that represents the relationship between two or more controls.</p>"
      }
    },
    "ControlScope": {
      "base": null,
      "refs": {
        "RegionConfiguration$Scope": "<p>The coverage of the control, if deployed. Scope is an enumerated type, with value <code>Regional</code>, or <code>Global</code>. A control with Global scope is effective in all Amazon Web Services Regions, regardless of the Region from which it is enabled, or to which it is deployed. A control implemented by an SCP is usually Global in scope. A control with Regional scope has operations that are restricted specifically to the Region from which it is enabled and to which it is deployed. Controls implemented by Config rules and CloudFormation hooks usually are Regional in scope. Security Hub controls usually are Regional in scope.</p>"
      }
    },
    "ControlSeverity": {
      "base": null,
      "refs": {
        "ControlSummary$Severity": "<p>An enumerated type, with the following possible values:</p>",
        "GetControlResponse$Severity": "<p>An enumerated type, with the following possible values:</p>"
      }
    },
    "ControlSummary": {
      "base": "<p>Overview of information about a control.</p>",
      "refs": {
        "Controls$member": null
      }
    },
    "Controls": {
      "base": null,
      "refs": {
        "ListControlsResponse$Controls": "<p>Returns a list of controls, given as structures of type <i>controlSummary</i>.</p>"
      }
    },
    "DeployableRegions": {
      "base": null,
      "refs": {
        "RegionConfiguration$DeployableRegions": "<p>Regions in which the control is available to be deployed.</p>"
      }
    },
    "DomainArn": {
      "base": null,
      "refs": {
        "AssociatedDomainSummary$Arn": "<p>The Amazon Resource Name (ARN) of the related domain.</p>",
        "DomainResourceFilter$Arn": "<p>The Amazon Resource Name (ARN) of the domain.</p>",
        "DomainSummary$Arn": "<p>The Amazon Resource Name (ARN) that identifies the domain.</p>"
      }
    },
    "DomainResourceFilter": {
      "base": "<p>The domain resource that's being used as a filter.</p>",
      "refs": {
        "DomainResourceFilterList$member": null
      }
    },
    "DomainResourceFilterList": {
      "base": null,
      "refs": {
        "ObjectiveFilter$Domains": "<p>The domain that's used as filter criteria.</p> <p>You can use this parameter to specify one domain ARN at a time. Passing multiple ARNs in the <code>ObjectiveFilter</code> isn’t supported.</p>"
      }
    },
    "DomainSummary": {
      "base": "<p>A summary of metadata for a domain.</p>",
      "refs": {
        "DomainSummaryList$member": null
      }
    },
    "DomainSummaryList": {
      "base": null,
      "refs": {
        "ListDomainsResponse$Domains": "<p>The list of domains that the <code>ListDomains</code> API returns.</p>"
      }
    },
    "FrameworkItem": {
      "base": null,
      "refs": {
        "FrameworkMappingDetails$Item": "<p>The specific item or requirement within the framework that the control maps to.</p>"
      }
    },
    "FrameworkMappingDetails": {
      "base": "<p>A structure that contains details about a framework mapping, including the framework name and specific item within the framework that the control maps to.</p>",
      "refs": {
        "Mapping$Framework": "<p>The framework mapping details when the mapping type relates to a compliance framework.</p>"
      }
    },
    "FrameworkName": {
      "base": null,
      "refs": {
        "FrameworkMappingDetails$Name": "<p>The name of the compliance framework that the control maps to.</p>"
      }
    },
    "GetControlRequest": {
      "base": null,
      "refs": {}
    },
    "GetControlResponse": {
      "base": null,
      "refs": {}
    },
    "GovernedResource": {
      "base": null,
      "refs": {
        "GovernedResources$member": null
      }
    },
    "GovernedResources": {
      "base": null,
      "refs": {
        "ControlSummary$GovernedResources": "<p>A list of Amazon Web Services resource types that are governed by this control. This information helps you understand which controls can govern certain types of resources, and conversely, which resources are affected when the control is implemented. The resources are represented as Amazon Web Services CloudFormation resource types. If <code>GovernedResources</code> cannot be represented by available CloudFormation resource types, it’s returned as an empty list.</p>",
        "GetControlResponse$GovernedResources": "<p>A list of Amazon Web Services resource types that are governed by this control. This information helps you understand which controls can govern certain types of resources, and conversely, which resources are affected when the control is implemented. The resources are represented as Amazon Web Services CloudFormation resource types. If <code>GovernedResources</code> cannot be represented by available CloudFormation resource types, it’s returned as an empty list.</p>"
      }
    },
    "ImplementationDetails": {
      "base": "<p>An object that describes the implementation type for a control.</p> <p>Our <code>ImplementationDetails</code> <code>Type</code> format has three required segments:</p> <ul> <li> <p> <code>SERVICE-PROVIDER::SERVICE-NAME::RESOURCE-NAME</code> </p> </li> </ul> <p>For example, <code>AWS::Config::ConfigRule</code> <b>or</b> <code>AWS::SecurityHub::SecurityControl</code> resources have the format with three required segments.</p> <p>Our <code>ImplementationDetails</code> <code>Type</code> format has an optional fourth segment, which is present for applicable implementation types. The format is as follows: </p> <ul> <li> <p> <code>SERVICE-PROVIDER::SERVICE-NAME::RESOURCE-NAME::RESOURCE-TYPE-DESCRIPTION</code> </p> </li> </ul> <p>For example, <code>AWS::Organizations::Policy::SERVICE_CONTROL_POLICY</code> <b>or</b> <code>AWS::CloudFormation::Type::HOOK</code> have the format with four segments.</p> <p>Although the format is similar, the values for the <code>Type</code> field do not match any Amazon Web Services CloudFormation values.</p>",
      "refs": {
        "GetControlResponse$Implementation": "<p>Returns information about the control, as an <code>ImplementationDetails</code> object that shows the underlying implementation type for a control.</p>"
      }
    },
    "ImplementationFilter": {
      "base": "<p>A structure that defines filtering criteria for control implementations. You can use this filter to find controls that are implemented by specific Amazon Web Services services or with specific service identifiers.</p>",
      "refs": {
        "ControlFilter$Implementations": "<p>A filter that narrows the results to controls with specific implementation types or identifiers. This field allows you to find controls that are implemented by specific Amazon Web Services services or with specific service identifiers.</p>"
      }
    },
    "ImplementationIdentifier": {
      "base": null,
      "refs": {
        "ImplementationDetails$Identifier": "<p>A service-specific identifier for the control, assigned by the service that implemented the control. For example, this identifier could be an Amazon Web Services Config Rule ID or a Security Hub Control ID.</p>",
        "ImplementationIdentifierFilterList$member": null,
        "ImplementationSummary$Identifier": "<p>The identifier originally assigned by the Amazon Web Services service that implements the control. For example, <code>CODEPIPELINE_DEPLOYMENT_COUNT_CHECK</code>.</p>"
      }
    },
    "ImplementationIdentifierFilterList": {
      "base": null,
      "refs": {
        "ImplementationFilter$Identifiers": "<p>A list of service-specific identifiers that can serve as filters. For example, you can filter for controls with specific Amazon Web Services Config Rule IDs or Security Hub Control IDs.</p>"
      }
    },
    "ImplementationSummary": {
      "base": "<p>A summary of how the control is implemented, including the Amazon Web Services service that enforces the control and its service-specific identifier. For example, the value of this field could indicate that the control is implemented as an Amazon Web Services Config Rule or an Amazon Web Services Security Hub control.</p>",
      "refs": {
        "ControlSummary$Implementation": "<p>An object of type <code>ImplementationSummary</code> that describes how the control is implemented.</p>"
      }
    },
    "ImplementationType": {
      "base": null,
      "refs": {
        "ImplementationDetails$Type": "<p>A string that describes a control's implementation type.</p>",
        "ImplementationSummary$Type": "<p>A string that represents the Amazon Web Services service that implements this control. For example, a value of <code>AWS::Config::ConfigRule</code> indicates that the control is implemented by Amazon Web Services Config, and <code>AWS::SecurityHub::SecurityControl</code> indicates implementation by Amazon Web Services Security Hub.</p>",
        "ImplementationTypeFilterList$member": null
      }
    },
    "ImplementationTypeFilterList": {
      "base": null,
      "refs": {
        "ImplementationFilter$Types": "<p>A list of implementation types that can serve as filters. For example, you can filter for controls implemented as Amazon Web Services Config Rules by specifying AWS::Config::ConfigRule as a type.</p>"
      }
    },
    "InternalServerException": {
      "base": "<p>An internal service error occurred during the processing of your request. Try again later.</p>",
      "refs": {}
    },
    "ListCommonControlsRequest": {
      "base": null,
      "refs": {}
    },
    "ListCommonControlsResponse": {
      "base": null,
      "refs": {}
    },
    "ListControlMappingsRequest": {
      "base": null,
      "refs": {}
    },
    "ListControlMappingsResponse": {
      "base": null,
      "refs": {}
    },
    "ListControlsRequest": {
      "base": null,
      "refs": {}
    },
    "ListControlsResponse": {
      "base": null,
      "refs": {}
    },
    "ListDomainsRequest": {
      "base": null,
      "refs": {}
    },
    "ListDomainsResponse": {
      "base": null,
      "refs": {}
    },
    "ListObjectivesRequest": {
      "base": null,
      "refs": {}
    },
    "ListObjectivesResponse": {
      "base": null,
      "refs": {}
    },
    "Mapping": {
      "base": "<p>A structure that contains the details of a mapping relationship, which can be either to a framework or to a common control.</p>",
      "refs": {
        "ControlMapping$Mapping": "<p>The details of the mapping relationship, for example, containing framework, common control, or related control information.</p>"
      }
    },
    "MappingType": {
      "base": null,
      "refs": {
        "ControlMapping$MappingType": "<p>The type of mapping relationship between the control and other entities.</p>",
        "MappingTypeFilterList$member": null
      }
    },
    "MappingTypeFilterList": {
      "base": null,
      "refs": {
        "ControlMappingFilter$MappingTypes": "<p>A list of mapping types to filter the mappings. When specified, only mappings of these types are returned.</p>"
      }
    },
    "MaxListCommonControlsResults": {
      "base": null,
      "refs": {
        "ListCommonControlsRequest$MaxResults": "<p>The maximum number of results on a page or for an API request call.</p>"
      }
    },
    "MaxListControlMappingsResults": {
      "base": null,
      "refs": {
        "ListControlMappingsRequest$MaxResults": "<p>The maximum number of results on a page or for an API request call.</p>"
      }
    },
    "MaxListControlsResults": {
      "base": null,
      "refs": {
        "ListControlsRequest$MaxResults": "<p>The maximum number of results on a page or for an API request call.</p>"
      }
    },
    "MaxListDomainsResults": {
      "base": null,
      "refs": {
        "ListDomainsRequest$MaxResults": "<p>The maximum number of results on a page or for an API request call.</p>"
      }
    },
    "MaxListObjectivesResults": {
      "base": null,
      "refs": {
        "ListObjectivesRequest$MaxResults": "<p>The maximum number of results on a page or for an API request call.</p>"
      }
    },
    "ObjectiveArn": {
      "base": null,
      "refs": {
        "AssociatedObjectiveSummary$Arn": "<p>The Amazon Resource Name (ARN) of the related objective.</p>",
        "ObjectiveResourceFilter$Arn": "<p>The Amazon Resource Name (ARN) of the objective.</p>",
        "ObjectiveSummary$Arn": "<p>The Amazon Resource Name (ARN) that identifies the objective.</p>"
      }
    },
    "ObjectiveFilter": {
      "base": "<p>An optional filter that narrows the list of objectives to a specific domain.</p>",
      "refs": {
        "ListObjectivesRequest$ObjectiveFilter": "<p>An optional filter that narrows the results to a specific domain.</p> <p>This filter allows you to specify one domain ARN at a time. Passing multiple ARNs in the <code>ObjectiveFilter</code> isn’t supported.</p>"
      }
    },
    "ObjectiveResourceFilter": {
      "base": "<p>The objective resource that's being used as a filter.</p>",
      "refs": {
        "ObjectiveResourceFilterList$member": null
      }
    },
    "ObjectiveResourceFilterList": {
      "base": null,
      "refs": {
        "CommonControlFilter$Objectives": "<p>The objective that's used as filter criteria.</p> <p>You can use this parameter to specify one objective ARN at a time. Passing multiple ARNs in the <code>CommonControlFilter</code> isn’t supported.</p>"
      }
    },
    "ObjectiveSummary": {
      "base": "<p>A summary of metadata for an objective.</p>",
      "refs": {
        "ObjectiveSummaryList$member": null
      }
    },
    "ObjectiveSummaryList": {
      "base": null,
      "refs": {
        "ListObjectivesResponse$Objectives": "<p>The list of objectives that the <code>ListObjectives</code> API returns.</p>"
      }
    },
    "PaginationToken": {
      "base": null,
      "refs": {
        "ListCommonControlsRequest$NextToken": "<p>The pagination token that's used to fetch the next set of results.</p>",
        "ListCommonControlsResponse$NextToken": "<p>The pagination token that's used to fetch the next set of results.</p>",
        "ListControlMappingsRequest$NextToken": "<p>The pagination token that's used to fetch the next set of results.</p>",
        "ListControlMappingsResponse$NextToken": "<p>The pagination token that's used to fetch the next set of results.</p>",
        "ListControlsRequest$NextToken": "<p>The pagination token that's used to fetch the next set of results.</p>",
        "ListControlsResponse$NextToken": "<p>The pagination token that's used to fetch the next set of results.</p>",
        "ListDomainsRequest$NextToken": "<p>The pagination token that's used to fetch the next set of results.</p>",
        "ListDomainsResponse$NextToken": "<p>The pagination token that's used to fetch the next set of results.</p>",
        "ListObjectivesRequest$NextToken": "<p>The pagination token that's used to fetch the next set of results.</p>",
        "ListObjectivesResponse$NextToken": "<p>The pagination token that's used to fetch the next set of results.</p>"
      }
    },
    "RegionCode": {
      "base": null,
      "refs": {
        "DeployableRegions$member": null
      }
    },
    "RegionConfiguration": {
      "base": "<p>Returns information about the control, including the scope of the control, if enabled, and the Regions in which the control is available for deployment. For more information about scope, see <a href=\"https://docs.aws.amazon.com/whitepapers/latest/aws-fault-isolation-boundaries/global-services.html\">Global services</a>.</p> <p>If you are applying controls through an Amazon Web Services Control Tower landing zone environment, remember that the values returned in the <code>RegionConfiguration</code> API operation are not related to the governed Regions in your landing zone. For example, if you are governing Regions <code>A</code>,<code>B</code>,and <code>C</code> while the control is available in Regions <code>A</code>, <code>B</code>, C<code>,</code> and <code>D</code>, you'd see a response with <code>DeployableRegions</code> of <code>A</code>, <code>B</code>, <code>C</code>, and <code>D</code> for a control with <code>REGIONAL</code> scope, even though you may not intend to deploy the control in Region <code>D</code>, because you do not govern it through your landing zone.</p>",
      "refs": {
        "GetControlResponse$RegionConfiguration": null
      }
    },
    "RelatedControlMappingDetails": {
      "base": "<p>A structure that describes a control's relationship status with other controls.</p>",
      "refs": {
        "Mapping$RelatedControl": "<p>Returns information about controls that are related to the specified control.</p>"
      }
    },
    "ResourceNotFoundException": {
      "base": "<p>The requested resource does not exist.</p>",
      "refs": {}
    },
    "String": {
      "base": null,
      "refs": {
        "AccessDeniedException$Message": null,
        "AssociatedDomainSummary$Name": "<p>The name of the related domain.</p>",
        "AssociatedObjectiveSummary$Name": "<p>The name of the related objective.</p>",
        "CommonControlSummary$Name": "<p>The name of the common control.</p>",
        "CommonControlSummary$Description": "<p>The description of the common control.</p>",
        "ControlParameter$Name": "<p>The parameter name. This name is the parameter <code>key</code> when you call <a href=\"https://docs.aws.amazon.com/controltower/latest/APIReference/API_EnableControl.html\"> <code>EnableControl</code> </a> or <a href=\"https://docs.aws.amazon.com/controltower/latest/APIReference/API_UpdateEnabledControl.html\"> <code>UpdateEnabledControl</code> </a>.</p>",
        "ControlSummary$Name": "<p>The display name of the control.</p>",
        "ControlSummary$Description": "<p>A description of the control, as it may appear in the console. Describes the functionality of the control.</p>",
        "DomainSummary$Name": "<p>The name of the domain.</p>",
        "DomainSummary$Description": "<p>The description of the domain.</p>",
        "GetControlResponse$Name": "<p>The display name of the control.</p>",
        "GetControlResponse$Description": "<p>A description of what the control does.</p>",
        "InternalServerException$Message": null,
        "ObjectiveSummary$Name": "<p>The name of the objective.</p>",
        "ObjectiveSummary$Description": "<p>The description of the objective.</p>",
        "ResourceNotFoundException$Message": null,
        "ThrottlingException$Message": null,
        "ValidationException$Message": null
      }
    },
    "ThrottlingException": {
      "base": "<p>The request was denied due to request throttling.</p>",
      "refs": {}
    },
    "Timestamp": {
      "base": null,
      "refs": {
        "CommonControlSummary$CreateTime": "<p>The time when the common control was created.</p>",
        "CommonControlSummary$LastUpdateTime": "<p>The time when the common control was most recently updated.</p>",
        "ControlSummary$CreateTime": "<p>A timestamp that notes the time when the control was released (start of its life) as a governance capability in Amazon Web Services.</p>",
        "DomainSummary$CreateTime": "<p>The time when the domain was created.</p>",
        "DomainSummary$LastUpdateTime": "<p>The time when the domain was most recently updated.</p>",
        "GetControlResponse$CreateTime": "<p>A timestamp that notes the time when the control was released (start of its life) as a governance capability in Amazon Web Services.</p>",
        "ObjectiveSummary$CreateTime": "<p>The time when the objective was created.</p>",
        "ObjectiveSummary$LastUpdateTime": "<p>The time when the objective was most recently updated.</p>"
      }
    },
    "ValidationException": {
      "base": "<p>The request has invalid or missing parameters.</p>",
      "refs": {}
    }
  }
}
